{"id":1001,"date":"2023-07-13T15:09:42","date_gmt":"2023-07-13T15:09:42","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1001"},"modified":"2023-07-13T15:09:42","modified_gmt":"2023-07-13T15:09:42","slug":"getting-an-early-start","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/getting-an-early-start","title":{"rendered":"Getting an early start"},"content":{"rendered":"\n<p>They say that, in life, it’s not how you start out but how you finish that matters. But when it comes to our financial life, how we start out can be a much greater indicator of how we will finish.<\/p>\n\n\n\n<p>Yes, it’s true that Sam Walton was 44 when he started Walmart, but he had already built the foundation for his work when he started. And when he did start, he was very careful how he spent each and every dollar.<\/p>\n\n\n\n<p>Far too many of us grown up without the appreciation of, and the understanding of money and how it works. Instead of being encouraged to save, we are encouraged to spend, even if we are bogged down with debt. And far too often, we find excuses, or blame someone else for our own financial decisions.<\/p>\n\n\n\n<p>Now, we cannot yet travel back in time, so the best place to start is now, and the best way to start is with what we have. But we can’t stope there. Like taking a long trip, we need to know where we want to go and how to get there. It’s not going to be a quick flight but a long journey. And no one is going to be able to do it for you.<\/p>\n\n\n\n<p>It may be a good idea at this time to enlist the help of a financial planner. Like a travel planner, he or she can help you figure out where you want to go, and the things that you can do to get there.<\/p>\n\n\n\n<p>You also need to educate yourself. Dave Ramsey and Crown Financial Ministries are two excellent places to start.<\/p>\n\n\n\n<p>You will need to become clear on your financial goals because a lack of clarity will slow progress and make it harder to go anywhere. In fact, you may wind up going backwards. And the further behind you start, the harder the trip is going to be. You can keep putting it off, but it is just going to keep getting harder to reach any sort of a goal.<\/p>\n\n\n\n<p>You may have to start small, but a small start is better than nothing at all. Remember to reward yourself along the way, with a pat on the back or a small cheer. And don’t think of the time it will take, but remember the goal. The time will pass whether you make progress or not.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>They say that, in life, it’s not how you start out but how you finish that matters. But when it comes to our financial life, how we start out can be a much greater indicator of how we will finish. Yes, it’s true that Sam&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/getting-an-early-start\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1002,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62,70,38],"tags":[3],"class_list":["post-1001","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-finances","category-lifestyle","category-money","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1001","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1001"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1001\/revisions"}],"predecessor-version":[{"id":1003,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1001\/revisions\/1003"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1002"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1001"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1001"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1001"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}