{"id":1040,"date":"2023-07-25T15:30:12","date_gmt":"2023-07-25T15:30:12","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1040"},"modified":"2023-07-25T15:30:12","modified_gmt":"2023-07-25T15:30:12","slug":"let-me-encourage-you","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/let-me-encourage-you","title":{"rendered":"Let me encourage you"},"content":{"rendered":"\n<p>Let me tell you the story of a young man. You may know him. After becoming a Christian, he left his church because he was afraid that he might be called on to pray.<\/p>\n\n\n\n<p>Speaking in front of others: out of the question.<br>Rating the Bible to others: a total embarrassment.<\/p>\n\n\n\n<p>It took all of the courage he had to approach the photo editor at the local newspaper to submit a photo for publication, after which he would receive a check in the mail for $5.<\/p>\n\n\n\n<p>All too often, this young boy was told that being a photographer is too hard. Thought his adolescence, he was told that his work just wasn’t good enough. Even after his work began to improve, he still had trouble seeing it in himself. This failure to see his present reality led him to give up time after time with little or no effort.<\/p>\n\n\n\n<p>This young boy — someone who could have easily passed for someone at least 5 years younger — was so shy. The product of a broken home and a broken educational system, he couldn’t even pray out loud to ask Jesus into his heart. Yet, he knew, somehow, that God heard him.<\/p>\n\n\n\n<p>All this young boy wanted was to take pictures. And, in spite of overhang, he would walk 20 minutes to the athletic department at the local university. It was a path that he had walked often, and he could remember, not only the beer cans that litter the fraternity lawns, but the old school building that piqued his curiosity. You may not know this, but this young boy waited up to an hour for a chance to get a press pass to photograph various sporting events. You may not know that this young boy had a nervous tick in his feet that caused him to rub his toes together until they became raw.<\/p>\n\n\n\n<p>You may not know the impact that you have on a young man — until we reach Heaven and God — Jesus — comes to you and says, “Well done, good and faithful servant.” You see, some live their whole our lives, waiting for Jesus to tell them these words, while many will only hear, “Depart from me, I never knew you.”<\/p>\n\n\n\n<p>I want to be the one whom Jesus meets with a proud smile, gives me a huge hug, and tells me He loves me. I want to be the young man who grew up to be brave and always looking for the bright side: the reason to give praise. I want to be the one who is always looking for ways to help others — the ones who really need it. Like me.<\/p>\n\n\n\n<p>You see, God rally does pay attention, and it is the little things that he sees.<\/p>\n\n\n\n<p>If there is something that you want to do, go for it. You will probably make mistakes along the way, but that’s how we learn. You may just find that the path your are on is not the one that you want to stay on, but that is part of learning, too. The main thing is that you don’t give up — on yourself or on others. Keep going, and you will find where you are meant to go.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Let me tell you the story of a young man. You may know him. After becoming a Christian, he left his church because he was afraid that he might be called on to pray. Speaking in front of others: out of the question.Rating the Bible&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/let-me-encourage-you\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1041,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[51,71],"tags":[3],"class_list":["post-1040","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-personal-growth","category-personal-stories","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1040","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1040"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1040\/revisions"}],"predecessor-version":[{"id":1042,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1040\/revisions\/1042"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1041"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1040"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1040"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1040"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}