{"id":1046,"date":"2023-07-27T15:17:37","date_gmt":"2023-07-27T15:17:37","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1046"},"modified":"2023-07-27T15:17:37","modified_gmt":"2023-07-27T15:17:37","slug":"cross-atlantic-communication-day","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/cross-atlantic-communication-day","title":{"rendered":"Cross Atlantic Communication Day"},"content":{"rendered":"\n<p>July 27 is Cross Atlantic Communication Day. And, though I don’t have any suggestions for how to celebrate the holiday, which is celebrated annually on July 27, there is something to be said about international communication, and how it has affected our lives and careers.<\/p>\n\n\n\n<p>While there have been several ways to communicate within the Untied States, such as telegraph and pony express, early trans Atlantic communication would have been limited to boats — military, cargo and passenger ships — that traveled at great risk across the Atlantic.<\/p>\n\n\n\n<p>The first transatlantic telegraph cable made electronic communication possible. The first communications, telegraph messages sent from the United State to parts of Europe first took place on August 16, 1858, reducing the time to get messages across the Atlantic from an average of 10 days to a matter of minutes.<\/p>\n\n\n\n<p>Today, nearly all of our international communications are done by satellite. Everything from emails to broadcast of the World Cup can be sent anywhere in the world in a matter of seconds.<\/p>\n\n\n\n<p>And while some jobs have gone away, perhaps forever, new doors have been opened up to those with the insight to take advantage of new technologies. Today, a worker in India can market his skills around the world, and a seller on Amazon can find the best price for her product in China, Japan, or in some other country.<\/p>\n\n\n\n<p>Communication has also opened the door to those who want to be able to work and make a living from wherever they choose. Natalie Sisson, author of the “Suitcase Entrepreneur”, left her corporate job in New Zealand and has been able to take her work with her wherever she wants to go.<\/p>\n\n\n\n<p>Large corporations have also made full use of nearly instant communication. And the United States isn’t the only country taking advantage of lower wages or lower taxes outside of their own country.<\/p>\n\n\n\n<p>In spite of the speed which we can communicate, there are still issues that can arise. One is a matter of translation, and the misunderstandings that can arise from not completely understand someone else’s language.<\/p>\n\n\n\n<p>Another problem might come from the assumption that all of us have been guilty of at one time or another: thinking that we have been understood, or that we have understood someone else, when we have not.<\/p>\n\n\n\n<p>Just about every place that I’ve been, and everywhere that I’ve worked, I have seen problems where a lack of proper communication has been a problem. A lack of communication can not only delay progress, but can also lead to a lack of trust, and may hinder future communication. The lack of real communication can not only damage relationships, but a lack of trust can costing businesses millions of dollars a year.<\/p>\n\n\n\n<p>It may be difficult to know when you haven’t been understood or when you have misunderstood someone else. Taking the time to make sure that you have understood someone else may cause delays in the moment, but it is almost certainly better than having to go back and fix what has already been done. And once trust is broken, it can be very difficult to get back<\/p>\n","protected":false},"excerpt":{"rendered":"<p>July 27 is Cross Atlantic Communication Day. And, though I don’t have any suggestions for how to celebrate the holiday, which is celebrated annually on July 27, there is something to be said about international communication, and how it has affected our lives and careers.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/cross-atlantic-communication-day\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1047,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[24],"tags":[3],"class_list":["post-1046","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1046","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1046"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1046\/revisions"}],"predecessor-version":[{"id":1048,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1046\/revisions\/1048"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1047"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1046"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1046"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1046"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}