{"id":1071,"date":"2023-07-31T14:49:31","date_gmt":"2023-07-31T14:49:31","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1071"},"modified":"2024-07-18T14:31:46","modified_gmt":"2024-07-18T14:31:46","slug":"letters-from-a-time-traveler-1802","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/letters-from-a-time-traveler-1802","title":{"rendered":"Letters from a Time Traveler &#8212; 1802"},"content":{"rendered":"\n<p>Chapter 1: Another Letter<\/p>\n\n\n\n<p>There was a small package sitting on Rebekah’s desk when she arrived to prepare to teach her English class that Monday morning. Inside was a diamond ring and a note.<\/p>\n\n\n\n<p>Dearest Rebekah,<\/p>\n\n\n\n<p>I had hoped to give you the ring in person, but I cannot wait. If you accept my proposal for marriage, please take the ring. If not, please leave it on the counter and I will know of your decision. Either way, I want to let you know that I love you and that I respect whatever choice you make.<\/p>\n\n\n\n<p>Rebekah took the ring out of the box and slipped on her finger before continuing to read.<\/p>\n\n\n\n<p>Good. Now, I need you to go to the library and look for anything by William Godwin. Please, don’t delay. I look forward to returning to you.<\/p>\n\n\n\n<p>Love always,<br>Charles<\/p>\n\n\n\n<p>PS: I was the only son of my father.<\/p>\n\n\n\n<p>Rebekah’s class went well, but seemed to pass a little slower than most. Some of Rebekah’s students noticed the rock on her finer, but no one asked about it — until one young girl dared to ask.<\/p>\n\n\n\n<p>“Who gave you the ring,” asked a young lady named Sandy?<\/p>\n\n\n\n<p>“Oh,” said Rebekah, “just a friend.” But the bell rang as she spoke those last words, and she and her students were off to the races.<\/p>\n\n\n\n<p>When Rebekah arrived at The Library, she parked and went in. And when she noted that the few librarians seemed to be busy, she looked around. Spotting a computer, Rebekah sat down and began typing in an internet search.<\/p>\n\n\n\n<p>“William Godwin I was the only son of my father”.<\/p>\n\n\n\n<p>Google came back with “About 12,300,000 results (0.54 seconds).”<\/p>\n\n\n\n<p>Chapter 2: Off to London<\/p>\n\n\n\n<p>Now, since her trip to Paris, Rebekah had decided to keep a suitcase in her car with enough things for a week. And, phoning the school to request the rest of the week off, Rebekah took off for the airport.<\/p>\n\n\n\n<p>“I’d like to go to London,” said Rebekah, handing the young woman at the counter her passport and putting her luggage on the counter. A new DSLR hung on Rebekah’s shoulder.<\/p>\n\n\n\n<p>In the airport terminal, Rebekah met a family of two — mother, daughter — from north Idaho, and a young man named Robert returning to his flat in London. On the flight, Rebekah made a new friend — a five year old girl named Lily Grace, who did most of the talking on the way to London. It was Lily’s second flight and her first trip to America. Lily’s accent gave her away as someone from Ireland. It seemed strange carrying on a conversation with Lily, especially since she was so young. Yet, it did help pass time for the both of them.<\/p>\n\n\n\n<p>There was no one waiting for Rebekah at London’s Heathrow. After finding a bus, Rebekah managed to find a hotel in the south part of town, where she was able to get some much needed sleep before going out for dinner at a small London cafe that was down the street from the hotel. There were other places to choose from — American chain restaurants — but Rebekah wanted to get a taste of London on her short visit. However, it was late and Rebekah had hardly slept on her journey. London would have to wait till tomorrow.<\/p>\n\n\n\n<p>Chapter 3: A Chance Meeting<\/p>\n\n\n\n<p>The hotel where Rebekah stayed had a complimentary breakfast. The hot tea was comforting and the warm croissant went down smoothly with strawberry jam. It was a dream. Leaving her plate on the table, Rebekah headed for the hotel’s front door.<\/p>\n\n\n\n<p>As Rebekah headed prepared to exit the hotel, someone called her name. Forgetting what she was doing, she turned around to see who was calling her. But as she turned to look forward, again, she ran right into the door what she had planned to walk though, nearly knocking her out and sending her to the floor.<\/p>\n\n\n\n<p>Then, out of the blue, a hand reached down and helped her up. It was Robert from the flight to London.<\/p>\n\n\n\n<p>“I was here,” said Robert, “to see a friend. But then I saw you and I thought that we could spend some time tougher.”<\/p>\n\n\n\n<p>“That would be nice,” said Rebekah, more than a little embarrassed at running into the door.<\/p>\n\n\n\n<p>“Have you had breakfast,” asked Robert?<\/p>\n\n\n\n<p>“Yes,” answered Rebekah, “but I could go for a cup of tea.”<\/p>\n\n\n\n<p>“Great,” said Robert, “me too.”<\/p>\n\n\n\n<p>Rebekah continued, “I have just four more days.”<\/p>\n\n\n\n<p>“Before what,” Robert asked?<\/p>\n\n\n\n<p>“Before I fly back to Boston.”<\/p>\n\n\n\n<p>“Oh,” said Robert, “We’ll have to make the most of your stay, then.”<\/p>\n\n\n\n<p>“Sounds good to me,” said Rebekah.<\/p>\n\n\n\n<p>“Good,” said Robert.<\/p>\n\n\n\n<p>Chapter 3: Off to a Good Start<\/p>\n\n\n\n<p>Robert brought Rebekah, not to a street level cafe but to a small cafe at the top of a department store. It was nice and, in spite of having had breakfast, Rebekah picked up a cucumber and cheese sandwich on white bread from the buffet. Robert paid for breakfast and the two sat by a poster of the Eiffel Tower.<\/p>\n\n\n\n<p>“Is there anything that you want to see while you are here,” asked Robert?\u2028<br>“No,” said Rebekah, “not really.”<\/p>\n\n\n\n<p>“I suppose you’ll need to see Big Ben,” said Robert.<\/p>\n\n\n\n<p>“And Parliament,” added Rebekah, but Robert didn’t get the reference.<\/p>\n\n\n\n<p>“There’s also Tower Bridge and Piccadilly Circus,” added Robert.<\/p>\n\n\n\n<p>The two finished breakfast and, after a short walk, found an entrance to the London Underground.<\/p>\n\n\n\n<p>“Mind the gap,” said the recording when the train arrived at their station.<\/p>\n\n\n\n<p>“Mind the gap,” repeated Rebekah, smiling. “I like it.”<\/p>\n\n\n\n<p>The two took seats by the train’s entrance and got up three stops later, before taking a short walk thought Green Park to Buckingham Palace.<\/p>\n\n\n\n<p>“It’s beautiful,” said Rebekah, “but I wouldn’t wan to have to clean the place. And the electric bill….”<\/p>\n\n\n\n<p>“Hand me your camera,” said Robert, “and I’ll get your picture. Beautiful,” added Robert. “And the palace doesn’t look bad, either.”<\/p>\n\n\n\n<p>Robert seemed a natural with the camera, so Rebekah let Robert take most of the pictures. She also let a man who was passing by photograph the two of them in front of the palace before stopping by a market for sandwiches and drinks, which they took back to Green Park for lunch. Rebekah fed bread crumbs to the pigeons.<\/p>\n\n\n\n<p>“Thank you,” said Rebekah, “it’s so nice to have someone to spend time with.”<\/p>\n\n\n\n<p>“You’re welcome,” replied Robert.<\/p>\n\n\n\n<p>After lunch, the two found a tour bus and rode it for about an hour as it went though the streets of London. The two walked around for a couple of hours before taking a ride that took doubt 20 minutes. They got off about a mile and a half away from where they had gotten on.<\/p>\n\n\n\n<p>“What’s this,” asked Rebekah?<\/p>\n\n\n\n<p>“My daughter, Sarah,” said Robert, “goes to school here. She’ll be ten next month.”<\/p>\n\n\n\n<p>“Ten,” asked Rebekah?<\/p>\n\n\n\n<p>“Ten, going on 20,” replied Robert.<br>“Sarah,” said Robert, “this is our guest from America, Rebekah.”<\/p>\n\n\n\n<p>“She’s pretty, daddy,” said Sarah. “Is she going to have dinner with us?”<\/p>\n\n\n\n<p>Robert looked at Rebekah.<\/p>\n\n\n\n<p>“My wife died two years ago and, so, Sarah is trying to find a new wife for me.”<\/p>\n\n\n\n<p>“She wants a mom,” asked Rebekah.<\/p>\n\n\n\n<p>“Yes,” answered Robert.<\/p>\n\n\n\n<p>“I would love to have dinner with you,” added Rebekah, “if it’s okay with your dad.”<\/p>\n\n\n\n<p>“That would be lovely,” said Robert and Sarah, in unison.<\/p>\n\n\n\n<p>“It would be,” said Rebekah.<\/p>\n\n\n\n<p>Another bus arrived and, two bus transfers later, the three arrived at Robert’s and Sarah’s home.<\/p>\n\n\n\n<p>“I’ll make dinner,” said Sarah, “so you two can spend some time together.”<\/p>\n\n\n\n<p>“Sarah’s quite the match maker,” said Rebekah.<\/p>\n\n\n\n<p>“She misses her mum,” replied Robert.<\/p>\n\n\n\n<p>Chef Sarah prepared a wonderful meal of macaroni and cheese with hotdogs. It was amazing and Rebekah ate everything on her plate.<\/p>\n\n\n\n<p>After dinner, Robert walked Rebekah to her hotel.<\/p>\n\n\n\n<p>“Goodnight,” said Robert, trying to give Rebekah a goodnight kiss. Rebekah dodged, however, before entering her room.<\/p>\n\n\n\n<p>“Goodnight,” said Rebekah as she turned and left. It wasn’t that she wasn’t attracted to Robert. It was just that her love for Charles was so strong.<\/p>\n\n\n\n<p>Chapter 4: The Next Day<br>Rebekah got up early and had breakfast at the hotel. While she sat at the hotel’s restaurant, Robert walked in and sat at the table with Rebekah.<\/p>\n\n\n\n<p>“I want to apologize for last night,” said Robert. “I shouldn’t have tried to kiss you.”<\/p>\n\n\n\n<p>“It’s okay,” said Rebekah. “I just…”<\/p>\n\n\n\n<p>“And to make up for it,” continued Robert, “I’d like to invite you over for dinner. I’m making lamb raan with potatoes and green beans. I — we would love to have you back for dinner.<\/p>\n\n\n\n<p>“That sounds wonderful,” said Rebekah. &#8220;I have to do research at the library. I can meet you and your daughter for dinner when I’m done.”<\/p>\n\n\n\n<p>“Great,” replied Robert. “Is there anything I can help you with?”<\/p>\n\n\n\n<p>“No,” answered Rebekah. “But thank you.”<\/p>\n\n\n\n<p>“My pleasure,” added Robert. “See you about 5:30ish?”<\/p>\n\n\n\n<p>“Wouldn’t miss it for the world,” said Rebekah. “Oh, and I have to get ready to go to the library. I have a lot of research to do.”<\/p>\n\n\n\n<p>“On what,” asked Robert.<\/p>\n\n\n\n<p>An author named William Godwin,” answered Rebekah.<\/p>\n\n\n\n<p>“Oh,” said Robert, “is he any good?”<\/p>\n\n\n\n<p>“I don’t know,” replied Rebekah. “He died a long time ago.”<\/p>\n\n\n\n<p>“Oh, well,” said Robert, “best of luck to you. See you around 5:30. Okay?”<\/p>\n\n\n\n<p>“Okay.”<\/p>\n\n\n\n<p>And Robert was off.<\/p>\n\n\n\n<p>A shower and a change into a new wardrobe later, and Rebekah was off to the library. Rebekah arrived at the library early and they weren’t open yet, so she spent half an hour people watching, walking around and photographing the area around the library for half an hour. When the library opened, Rebekah went inside and, fining books by William Godwin, took them to one of the tables and began reading. There were eight books and, starting with “Damon and Delia”, Rebekah began reading. It was when she was reading “Fleetwood” that a note fell out from between the pages. Rebekah picked it up and began reading.<\/p>\n\n\n\n<p>Dearest Rebekah,<\/p>\n\n\n\n<p>I cannot explain how I know, but now I know that you love me because you did not allow Robert to kiss you.<\/p>\n\n\n\n<p>Enjoy the rest of your stay in London and give Sarah a hug for me when you see her, again.<\/p>\n\n\n\n<p>Love,<br>Charles<\/p>\n\n\n\n<p>PS: Sarah will be a great chef some day.<\/p>\n\n\n\n<p>Rebekah took the note and held it to her heart before putting it in her hand bag. It was almost 5, so she went to Roberts house, telling Sarah what Charles had told her and giving Sarah a big hug.<\/p>\n\n\n\n<p>“I know I’m going to be a chef when I grow up,” said Sarah, “but how did you know.”<\/p>\n\n\n\n<p>“A little bird told me,” said Rebekah.<\/p>\n\n\n\n<p>Robert made dinner, but Sarah helped.<\/p>\n\n\n\n<p>Rebekah stayed for two more days before returning to Boston. Rebekah spend one full day with just Sarah, taking her to have her nails and hair done, before going to out to lunch and to the cinema. Sarah loved it and so did Rebekah. It was so hard for Rebekah to leave Sarah behind. But she had to get back home — to her school, and to her students.<\/p>\n\n\n\n<p>Chapter 5: Back home<\/p>\n\n\n\n<p>The Monday that Rebekah returned to work, there was a small box with a crucial glass rose. Rebekah didn’t know who had made it or how, but it was beautiful. A stem of gold held the petals together and there were two gold leaves. There was also a note:<\/p>\n\n\n\n<p>Dearest Rebekah,<\/p>\n\n\n\n<p>I am yet closer to returning home, and I will let you know more in my next note. Just know that I love you more than any other.<\/p>\n\n\n\n<p>Love always,<br>Charles <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chapter 1: Another Letter There was a small package sitting on Rebekah’s desk when she arrived to prepare to teach her English class that Monday morning. Inside was a diamond ring and a note. Dearest Rebekah, I had hoped to give you the ring in&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/letters-from-a-time-traveler-1802\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1072,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[73,72],"tags":[3],"class_list":["post-1071","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fiction","category-letters-from-a-time-traveler","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1071","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1071"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1071\/revisions"}],"predecessor-version":[{"id":1073,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1071\/revisions\/1073"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1072"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}