{"id":1097,"date":"2023-11-20T16:17:03","date_gmt":"2023-11-20T16:17:03","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1097"},"modified":"2023-11-20T16:17:03","modified_gmt":"2023-11-20T16:17:03","slug":"giving-thanks","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/giving-thanks","title":{"rendered":"Giving Thanks"},"content":{"rendered":"\n<p>Thanksgiving is just days away. For many, there’s shopping to do, food to be purchased, prepared and consumed. Then there begins the preparation for Christmas. It can be a busy and, perhaps, stressful time of the year. But in the hustle and bustle of Thanksgiving, it’s good to take time to slow down and remember why we are celebrating. It’s not about the food or the football, it’s about being thankful for what we have.<\/p>\n\n\n\n<p>I’m sure that the pilgrims didn’t have a lot, but they were thankful for what God had provided. Those early days in what would become the United States of America must have been difficult, but these early settlers who got together, along with several native American Indians, were thankful for what God had provided.<\/p>\n\n\n\n<p>First the pilgrims must have been thankful for the help that they had received from the Indian tribe, for many of those who had come to the new land may not have known how to live off of the land. And they must have been thankful what they were able to learn from the Indians.<\/p>\n\n\n\n<p>The pilgrims must have been thankful for the safety that God had provided in their journey as well as their new lives in their new home. These settlers had not only survived the long journey, but they found people who were willing to help them when they arrived in a foreign land. These pilgrims also had each other.<\/p>\n\n\n\n<p>Finally, these pilgrims had food. I don’t know how much food they had but it was enough that they came together to celebrate.<\/p>\n\n\n\n<p>For many, the holidays can be a difficult time of the year. It may be a painful reminder of loved ones who have died. It may also be a reminder of other losses or of the things that we do not have. Yet, we can still choose to be thankful for the things that we have, and not only on Thanksgiving.<br>We can use our fingers to come up with five things that we are thankful for. On Thanksgiving day, my friends go around the table and each person tells of at least one thing that he or she is thankful for. I’m sure if we think about it, each of us can find at least one thing that we are thankful for.<\/p>\n\n\n\n<p>But there is one thing that we should not forget: whatever or whomever we are thankful for, it is God who has provided. I’m not thankful to the company for the job that provides the money to buy the food to put on the table but to God who provided the job that put the food on the table. I shouldn’t be resentful for what I don’t have but thankful for the things that I do have. And, instead of being angry because of our individual differences, I should be thankful that God has created us to be unique individuals.<\/p>\n\n\n\n<p>So, in this time of celebrating nears, what is it that you are most thankful for? Personally, I am thankful that God loved me enough to send his Son, Jesus, to die on the cross in order to pay my sin debt: a debt that I could never pay. And, because of this, I can have a relationship with a living and loving God who provides for all of my needs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Thanksgiving is just days away. For many, there’s shopping to do, food to be purchased, prepared and consumed. Then there begins the preparation for Christmas. It can be a busy and, perhaps, stressful time of the year. But in the hustle and bustle of Thanksgiving,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/giving-thanks\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1098,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,41,43,24],"tags":[3],"class_list":["post-1097","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-family","category-food","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1097","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1097"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1097\/revisions"}],"predecessor-version":[{"id":1099,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1097\/revisions\/1099"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1098"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}