{"id":1121,"date":"2024-07-09T15:09:55","date_gmt":"2024-07-09T15:09:55","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1121"},"modified":"2024-07-09T15:09:55","modified_gmt":"2024-07-09T15:09:55","slug":"excerpt-from-the-heart-of-god","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/excerpt-from-the-heart-of-god","title":{"rendered":"Excerpt from &#8220;The Heart of God&#8221;"},"content":{"rendered":"\n<p>Who am I to write about the heart of God? Who do I think I am? Oh, but it’s not really about me. It’s about God.<\/p>\n\n\n\n<p>You may think of it this way. You are entering an intersection and you see a stop sigh. You may stop at that stop sign, or you may decide simply to slow down. After all, there are other cars approaching the intersection, and simply slowing down seems okay. You don’t say to the stop sign, “What right have you to tell me what to do.” It’s simply a sign.<\/p>\n\n\n\n<p>Say, now, that you are entering another intersection. This time, however, there is a clearly marked, clearly visible police car parked near this intersection. I would venture to guess that you (and I) would be more careful to make sure that we stopped at that stop sigh.<\/p>\n\n\n\n<p>Do I know everything about God? Certainly not. Nor can I know everything about you, partly because I don’t have all the answers regarding my own life. Yet, I walk in a relationship with the living God, not because of anything that I have done, but because of the things that God has done. I, by no means feel worthy to write about the heart of God, but I believe that He has put this on my heart. So, it is by faith that I begin writing. And I am trusting God, though His Spirit, to guide me each step along the way as to what I should and should not write.<\/p>\n\n\n\n<p>No, I’m not a stop sign and this material is not designed to make or even to help you stop doing something. Rather, think of it as one of those signs that point you to the highway that you need to take, the gas station where you need to stop or to the hospital that you need to visit. As with any sign, we all need help getting to the place(s) that we need to go. I believe that God gives us signs — that all of creation is one big sign pointing to Him. I also believe that God gave us His written word, the Bible, to point us to Him. And that is what I will base my writing on.<\/p>\n\n\n\n<p>You may or may not agree with the things that I write. However, like the stop sign, I do not care what you may think of me. But the one in the police car may care what you do.<\/p>\n\n\n\n<p>Don’t get me wrong. God is not waiting for us to mess up so that He can punish us. The truth is that we all have a problem called sin and death. This sin, because of who we are and who God is, separates us from God. God could have said, “Oh, well, they get what they deserve.” But that is not the heart of God. God would not and could not simply let us perish. He loves us too much to let that happen.<\/p>\n\n\n\n<p>There is much that I will not write about. After many years of study and just plain listing to others, I am certainly ware of many of the different views on everything from creation to eschatology (the study of end times). My goal is not to show you that I am right. My goal is simply to let you know or, perhaps to remind you, that God loves you, whoever you are or however you may see yourself.<\/p>\n\n\n\n<p>John 3: 16 (KJV) tells us, “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”<\/p>\n\n\n\n<p>Oh, I still have questions. And there have certainly been times when I’ve had doubts — even about the love of God in my life. There have even been times when I felt as if I were on of God’s “Oops — how did that get through?” Trust me, my life is no mistake and neither is yours.<\/p>\n\n\n\n<p>I hope this writing is a blessing: a blessing for both you and for me. By this, I don’t mean that God will give us the riches that we desire in this life but that we will be blessed riches of a relationship with the living God — the only one who can give us eternal life. Don’t break out the hats for the pity-party just yet. God has a plan for each of us, for this life and beyond. God loves you and me; that’s reason to celebrate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Who am I to write about the heart of God? Who do I think I am? Oh, but it’s not really about me. It’s about God. You may think of it this way. You are entering an intersection and you see a stop sigh. You&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/excerpt-from-the-heart-of-god\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1122,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,51,71,35,47,14,29],"tags":[],"class_list":["post-1121","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-personal-growth","category-personal-stories","category-question","category-relational","category-spiritual","category-think-about-it"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1121","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1121"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1121\/revisions"}],"predecessor-version":[{"id":1123,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1121\/revisions\/1123"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1122"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}