{"id":1163,"date":"2024-07-15T12:35:26","date_gmt":"2024-07-15T12:35:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1163"},"modified":"2024-07-15T12:35:26","modified_gmt":"2024-07-15T12:35:26","slug":"some-positive-news","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/some-positive-news","title":{"rendered":"Some Positive News"},"content":{"rendered":"\n<p>Do you want some good news? I think it’s good, tough you are welcome to disagree.<\/p>\n\n\n\n<p>Deuteronomy 23: 35-36 (KJV) says, “To me belongeth vengeance and recompence; their foot shall slide in due time: for the day of their calamity is at hand, and the things that shall come upon them make haste. For the Lord shall judge his people, and repent himself for his servants, when he seeth that their power is gone, and there is none shut up, or left.”<\/p>\n\n\n\n<p>You know what this means? For me, it means I don’t need to judge others or worry about doing so. And, really, I have desire to judge others. It’s too hard to tell who is telling the truth and who is lying. It’s too hard to tell the motives for any given acton. It’s nearly impossible to walk in someone else’s shoes.<\/p>\n\n\n\n<p>No, I don’t know way I do many of the things that I do. So how can I expect myself to be able to understand why others do the things that they do? Answer: I cannot.<\/p>\n\n\n\n<p>Say, for example, I have two children. Say that the two get into a fight and, when confronted, each blames the other. It would be a mistake to choose one over the other, but that is the tendency. Instead, both should be equally punished. Right?<\/p>\n\n\n\n<p>Perhaps, or perhaps not. Maybe the best thing to do would be to help the two to find a way to work it out: to mediate a deal between the two. Far above what punishment could do, this could be a true life lesson.<\/p>\n\n\n\n<p>I don’t know about you, but I am all too quick to judge other’s motives or intent. And, when I do, it can have lasting and negative effects on me and on my relationships.<\/p>\n\n\n\n<p>There is, however, one thing that we can do. We can be open with each other. If something bothers us, we can say, this thing that you are doing makes me uncomfortable. It hurts me when you…..<\/p>\n\n\n\n<p>We should avoid saying things like, “You are a bad person,” and “I don’t like you.” These are things that probably aren’t true, or may be true for a short time. Really, “I don’t like you” is just a way of saying “I’m mad, or sad, or both.”<\/p>\n\n\n\n<p>Instead of judging, I can listen. I can ask questions and try to figure out what went wrong. I can also offer possible solutions. If a fix to the problem is found, great. If not, it may take more time. If no solution is found, maybe one person or the other just don’t want to admit that he or she may be wrong. But, again, it’s not possible for me to know with 100% certainty. Only God knows, and only God can judge the heart.<\/p>\n\n\n\n<p>“Dearly beloved, avenge not yourselves, but rather give place unto wrath: for it is written, ‘Vengeance is mine; I will repay, saith the Lord’” — Romans 12:19 (KJV)<\/p>\n\n\n\n<p>What do I take away from this? I can and should be more patient — with myself and with others. I don’t need to judge others or their motives. I don’t even really need to judge my own motives. Now, if I need help with a matter, I should find out the best person to talk to. If I need medical advise, I should talk to a doctor. If I need to know how to spell a work, I find that Google works well. If I’m part of a fight, I should realize that I am part of the problem. And when I come to this realization, I should stop, step back and ask, “What is the real problem?”<\/p>\n\n\n\n<p>What do you think? I think that this is good news. But you are welcome to disagree.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you want some good news? I think it’s good, tough you are welcome to disagree. Deuteronomy 23: 35-36 (KJV) says, “To me belongeth vengeance and recompence; their foot shall slide in due time: for the day of their calamity is at hand, and the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/some-positive-news\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1164,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[69,39,70,13,51,35,47,14],"tags":[33,8,7,5,3],"class_list":["post-1163","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-community","category-ideas","category-lifestyle","category-open-for-discussion","category-personal-growth","category-question","category-relational","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1163","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1163"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1163\/revisions"}],"predecessor-version":[{"id":1165,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1163\/revisions\/1165"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1164"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1163"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1163"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1163"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}