{"id":1172,"date":"2024-07-18T14:25:09","date_gmt":"2024-07-18T14:25:09","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1172"},"modified":"2024-07-18T14:25:09","modified_gmt":"2024-07-18T14:25:09","slug":"perfect-family-day","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/perfect-family-day","title":{"rendered":"Perfect Family Day"},"content":{"rendered":"\n<p>Today is Perfect Family Day. So, what does that mean? Guess what, I don’t think that such a thing exists. It’s kind of like the unicorn, or Bigfoot. Maybe someone has seen it. Maybe someone has even captured a picture of it. But it seems to only exist in the minds of individuals. I’ll get back to that, later.<\/p>\n\n\n\n<p>All of us are too imperfect to, as a family unit, make up a perfect family. We make mistakes, we hurt one another, we say and do things that we know deep down that we shouldn’t. We intentionally or unintentionally do things that hurt the ones that we love the most. How can we, let along a family, be perfect?<\/p>\n\n\n\n<p>Look at it this way. A puzzle isn’t made of square pieces, Each one has a unique image and shape so that it will fit in a precise place. An edge piece does not go in the middle of the puzzle, nor does a piece from the middle go on the edge. Mistakes don’t make us imperfect. And, when we hurt someone we love, when we realize what we’ve done, we can apologize. And we can try to not do the same thing, again.<\/p>\n\n\n\n<p>Seeing it another way, a rare steak may be perfect for me but not for you. Salad may be my perfect dinner, or it may be a burger. Your perfect dinner may be soup and a grill cheese. The thing is, we are all unique.<\/p>\n\n\n\n<p>Unlike the puzzle, God can put us together in ways that don’t fit at first. He may put us a marriage with someone we feel attracted to and, later, seems not to suit us. Yet, God sees marriage as a binding contract — until death. And that doesn’t mean until one or the other feels as if she is dying.<\/p>\n\n\n\n<p>Part of building a relationship is to realize that we don’t always get our way and being okay with that. Another part is having the willingness to let God shape us into the man or woman whom God wants us to be. It really is simple: love God, love others as ourselves. The hard part may be that I may not believe that God can love me. After all, I’m so imperfect. And, not realizing how much God does love me, I cannot fully love God and others.<\/p>\n\n\n\n<p>Another thing is that, if I disrespect God or his creation, I cannot fully love either. Lust, envy and spreading rumors or lies can all distort our views of others and hurt our relationship with a loving God. For a relationship is built from love and love comes from the hormones? No, it comes from the heart. But so does hate and jealousy: so, watch out for these things.<\/p>\n\n\n\n<p>There is evidence that the heart is part of the nervous system that can contain memories. Aside from that, there is muscle memory. Whether memories exist outside of the brain is not what matters. What matters is that love comes from every bit of our being. It comes in the warm embrace as well as the kind deed. It comes from seeing a mistake as an attempt to learn and not as something to be avoided all together.<\/p>\n\n\n\n<p>So, who is it that puts me into the relationship where I find myself? I believe that God does. Who decides when it is time to move on? Again, I believe that God does. Yet, all too often, I believe that I can take that role from God and put it on myself. Maybe you have done that too. Maybe it’s not too late to recognize our mistakes and to make reconciliation: to restore relationships once lost.<\/p>\n\n\n\n<p>Is there such a thing as a perfect family? From our vantage point, probably not. But I can’t see what God sees. And that is what truly matters.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today is Perfect Family Day. So, what does that mean? Guess what, I don’t think that such a thing exists. It’s kind of like the unicorn, or Bigfoot. Maybe someone has seen it. Maybe someone has even captured a picture of it. But it seems&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/perfect-family-day\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1173,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,41,24,47,14],"tags":[],"class_list":["post-1172","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-family","category-holidays","category-relational","category-spiritual"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1172","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1172"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1172\/revisions"}],"predecessor-version":[{"id":1174,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1172\/revisions\/1174"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1173"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1172"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1172"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1172"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}