{"id":1226,"date":"2024-08-01T14:24:59","date_gmt":"2024-08-01T14:24:59","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1226"},"modified":"2024-08-01T17:04:35","modified_gmt":"2024-08-01T17:04:35","slug":"foodie-news","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/foodie-news","title":{"rendered":"Foodie News"},"content":{"rendered":"\n<p>In general, this is what us up in the world of food, today. Prices are up and portions at least seem to be shrinking. It’s that good old inflation hard at work. It costs more to buy the food, so businesses are forced to either charge more for their product or make smaller portions. After all, less is healthier, right?<\/p>\n\n\n\n<p>Yet, people are beginning to catch on, and several are standing up and saying that they don’t want smaller portions. What I think that the restaurants should do is to offer different serving sizes and price them accordingly. No, most people won’t like the higher prices, but at least it does offer options, ones that might not otherwise might not be available.<\/p>\n\n\n\n<p>Many food restaurants already have various meal size options, from kid’s meals to full blown gut busters. Personally, when it comes to my fries, I usually get the small. Then I wonder why it costs nearly $2 for a hand full of fries.<\/p>\n\n\n\n<p>There are a fair number of people who hold to the theory that more is better. And if that handful of fries is a bargain at $2, then what about doubling the portion size for just one more dollar?<\/p>\n\n\n\n<p>As for me, I would rather eat a bowl of cereal at home than to spend $12 on a meal that I’ll probably take home to eat alone, anyway. If I had some company — someone to spend the time with — that would be a different story. For now, it’s just me.<\/p>\n\n\n\n<p>What do you think? Would you rather have larger portions and higher prices or would you rather the prices stay the same and portions get smaller. Because the sad truth, for now, is that prices are going to increase; inflation is here to stay — at least for a while. And, if we want to be heard, we have to speak, up and to the right people. It does no good for me to complain to my neighbor about the price of tea in China.<\/p>\n\n\n\n<p>Sometimes, it requires a letter to our congressman. Other times, we just need to get onto a businesses website and leave a comment. The choice is yours, and the choice is mine. Personally, I’m okay with the restaurants doing whatever they want. I’m staying home and cooking tonight.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In general, this is what us up in the world of food, today. Prices are up and portions at least seem to be shrinking. It’s that good old inflation hard at work. It costs more to buy the food, so businesses are forced to either&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/foodie-news\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1227,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,81],"tags":[3],"class_list":["post-1226","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-foodie-news","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1226","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1226"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1226\/revisions"}],"predecessor-version":[{"id":1229,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1226\/revisions\/1229"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1227"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1226"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1226"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1226"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}