{"id":124,"date":"2022-11-13T23:58:22","date_gmt":"2022-11-13T23:58:22","guid":{"rendered":"https:\/\/llgt.cafe\/?p=124"},"modified":"2022-11-13T23:58:22","modified_gmt":"2022-11-13T23:58:22","slug":"heaven","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/heaven","title":{"rendered":"Heaven"},"content":{"rendered":"\n<p>What is Heaven like? Aside from a few details found in the Bible, I’m not really sure. Hollywood has painted such a distorted image of what Heaven is like, with angels that sit around of fluffy clouds pretty much doing nothing all of the time.<\/p>\n\n\n\n<p>There are people who have died and have been revised, who tell stories of their journey to and in Heaven. I used to know one lady who had died and, though much prayer, was brought back. She wrote a book about it and I used to have her book. I don&#8217;t think I ever read it, though.<\/p>\n\n\n\n<p>The Bible tells us that there’s only one way to Heaven, and that’s though faith in Jesus: God’s son, who came to earth, lived a perfect, sinless life, died on the cross, and rose from the dead. Yes, there are other religions. These religions tell me that I have to do something to earn Heaven, like do enough good works or kill myself and others at the same time. But the Bible tells me that God is love and that I can never do enough good works to earn Heaven. That is why God sent his son to die that, by faith, I could have eternal life.<\/p>\n\n\n\n<p>Maybe you are like I was, not knowing that you need to put your faith in Jesus, or that you needed God to forgive your sins. I didn’t know. But when I found out that Jesus had not only come so that we could celebrate Christmas, that he came to die for sinners like, and that I could receive him into my life by faith, I did. That was over 42 years ago, and I still really don’t have a clear picture of what Heaven is like.<\/p>\n\n\n\n<p>Maybe you have too many questions to put your faith in Jesus right now. Did God really create the earth and everything in it in six days? What about the belief that says that we, and everything else came from millions of years of evolution? And, if God is so loving, why does he allow evil in the world? These are all valid questions. But the Bible tells us that if we die without putting our faith in Jesus, we will spend eternity separated from God and will likely never find the answers to our questions.<\/p>\n\n\n\n<p>Maybe, like me, you’ve put your faith in Jesus. Do you wonder what Heaven is like? I know that Jesus is there. And Jesus said that he would be preparing “mansions” for us and that, one day, he will return to take us home. Home: it’s a comforting word. I can hardly wait to finally be home, to be with Jesus.<\/p>\n\n\n\n<p>I may not know much about Heaven, but one day I will. I’ve heard that it’s beauty is unmatched by anything on this earth. I don’t know if we will float down the river of life, or whether or not our favorite dog will be there. I think that we might be surprised who else we find there as well as who is not. What do you think Heaven is like? I’d like to know.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Heaven like? Aside from a few details found in the Bible, I’m not really sure. Hollywood has painted such a distorted image of what Heaven is like, with angels that sit around of fluffy clouds pretty much doing nothing all of the time.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/heaven\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":125,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,35,14],"tags":[34,7,3],"class_list":["post-124","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-question","category-spiritual","tag-heaven","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/124","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=124"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/124\/revisions"}],"predecessor-version":[{"id":126,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/124\/revisions\/126"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/125"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=124"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=124"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=124"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}