{"id":1253,"date":"2024-08-09T14:57:40","date_gmt":"2024-08-09T14:57:40","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1253"},"modified":"2024-08-09T14:57:40","modified_gmt":"2024-08-09T14:57:40","slug":"time-to-bbq","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/time-to-bbq","title":{"rendered":"Time to BBQ"},"content":{"rendered":"\n<p>The weather is still warm everywhere except for a few places. Many places start back to school next week. It seems to me that this weekend would be a great time for a BBQ, or at least to grill something on a grill.<\/p>\n\n\n\n<p>I had a discussion with a friend who said something couldn’t be called BBQ unless it had BBQ sauce. I don’t agree. What do you think?<\/p>\n\n\n\n<p>Aside from that, there are several things that we can cook on a grill, whether we use gas or charcoal. Here are some of them:<\/p>\n\n\n\n<p>Chicken: it can be bone in or boneless. It can be seasoned however we like, marinaded overnight or seasoned right before it is put on the grill. It can also be partially cooked before it is put on the grill. One of my favorites is putting hickory wood chips in with charcoals.<\/p>\n\n\n\n<p>Hotdogs: you can use any kind of hotdog you like. And you can add just about anything you like to a hotdog, as long as it is chopped into tiny pieces. Chili and cheese is one of my favorites.<\/p>\n\n\n\n<p>Hamburgers or Cheeseburgers: it’s a good idea to avoid over flipping burgers, as they tend to fall apart easily. I like mine on the rare side with mayo, tomato and catsup. You can also toast the bun if you like.<\/p>\n\n\n\n<p>Steak: steak is a rare treat. Depending on the the cut, you may want to tenderize it with by pounding or using some sort of meat tenderizing marinade.<\/p>\n\n\n\n<p>Fish: Fish can be pretty amazing cooked on a grill. It can be tender and flaky if not overcooked, and depending on what kind of fish it is. While most fish should not be overcooked, there are some that probably taste better being a little on the crunch side and might be better deep fried.<\/p>\n\n\n\n<p>Shish-kabobs: a shish-kabob can be just about anything you want. A real shish-kabob probably means it has lamb or sheep meat, but it doesn’t have to. If you prefer, call it a kabob. Either way, you can use sausage, beef, shrimp or chicken. Onions and peppers are also popular. And, if you like, you can marinade them.<\/p>\n\n\n\n<p>I don’t think there is ever a bad time to BBQ, given that the weather is suitable. What do you think? Do you have a favorite meat to BBQ? Please let me know in the comment. Thanks and have a great weekend.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The weather is still warm everywhere except for a few places. Many places start back to school next week. It seems to me that this weekend would be a great time for a BBQ, or at least to grill something on a grill. I had&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/time-to-bbq\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1254,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43],"tags":[3],"class_list":["post-1253","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1253","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1253"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1253\/revisions"}],"predecessor-version":[{"id":1255,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1253\/revisions\/1255"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1254"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1253"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1253"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1253"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}