{"id":1271,"date":"2024-08-13T15:18:06","date_gmt":"2024-08-13T15:18:06","guid":{"rendered":"https:\/\/llgt.cafe\/?p=1271"},"modified":"2024-08-13T15:18:06","modified_gmt":"2024-08-13T15:18:06","slug":"two-ways","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/two-ways","title":{"rendered":"Two Ways"},"content":{"rendered":"\n<p>There is a saying that hard times can either make us better or bitter. That is, the difficulties that we face can make us stronger in character or make us angry and, perhaps, make us more isolated.<\/p>\n\n\n\n<p>There is another side to that. Hard times can either draw us to God or away from God. Whether we realize it or not, we are always moving in one direction or another: towards God or away from Him. And we either have a relationship with God or we don’t.<\/p>\n\n\n\n<p>The good news, the Gospel, tells us that it’s easy to begin a relationship with God. John 3:16 tells us, “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”<\/p>\n\n\n\n<p>It seems that everyone has difficulties at times, whether we believe in God or not, whether we have a relationship with God or not. Hard times are, it seems, just a part of life.<\/p>\n\n\n\n<p>I was fourteen when I began my relationship with the living God thought Jesus Christ and what he did and who he is: born of a virgin, lived a perfect life, died on a cross, a ransom for my sins, and rose again. Jesus us as much God as the Father and the Holy Spirit: three in one. It’s not something I can fully, 100% understand, but I’m okay with that.<\/p>\n\n\n\n<p>Some times, I look at the news, and I don’t understand the things that others are going through. The killing and such just seems beyond my comprehension. Wars just never seem to end and, when one does, there is another one around the corner. But for those who believe, for those who have a relationship with the living God, there is this promise: “And we know that all things work together for good to them that love God, to them who are the called according to his purpose.” — Romans 8:28 (KJV)<\/p>\n\n\n\n<p>I have to admit that it took me many years to figure out how some of the events that took place in my life could work for my good, but I’ve begun to figure it out. Either that, or I’ve just decided to accept it by faith.<\/p>\n\n\n\n<p>Which way are you headed, towards God or away from him? Do you have a relationship with God. If so, God’s Word promises that no one and nothing can take you away from him. I’m counting on that, because I’m still nowhere near perfect. But I am moving closer to God. And hopefully each day, with the help of the Holy Spirit, I’m becoming more and more like Jesus.<\/p>\n\n\n\n<p>Questions or comments: please put them in the comment section below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a saying that hard times can either make us better or bitter. That is, the difficulties that we face can make us stronger in character or make us angry and, perhaps, make us more isolated. There is another side to that. Hard times&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/two-ways\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1272,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,8,7,3],"class_list":["post-1271","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1271","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=1271"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1271\/revisions"}],"predecessor-version":[{"id":1273,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/1271\/revisions\/1273"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/1272"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=1271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=1271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=1271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}