{"id":129,"date":"2022-11-14T18:18:54","date_gmt":"2022-11-14T18:18:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=129"},"modified":"2022-11-14T18:18:54","modified_gmt":"2022-11-14T18:18:54","slug":"contentment","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/contentment","title":{"rendered":"Contentment"},"content":{"rendered":"\n<p>Why does it seem so hard to just be content? I was asking myself this the other day, and I think that I’ve some up with a few answers. I say a few because this feeling of discontent likely has multiple causes. This is what I came up with.<\/p>\n\n\n\n<p>Circumstances<br>It’s easy to let our circumstances drag us down. These are things that, to a large extent, we cannot control. They range from the weather to traffic, unexpected expenses and the death of someone that we love. We can prepare ourselves for certain things. We can have warm clothes for the winter, snow tires for the ice and snow, an emergency fund, and we can leave early to deal with traffic. But there are things that we can’t entirely prepare for and even the things that we can plan for can catch us off guard.<\/p>\n\n\n\n<p>The thing is that the Bible says in many ways that we shouldn’t base our feelings on our circumstances but on faith and on God’s Word written in the Bible. Circumstances change all the time, but God’s Word never changes; His Word never fails.<\/p>\n\n\n\n<p>We may face trials and tribulation, but the Bible tells us that such things make us stronger. We may loose loved ones, yet Christians have a hope of seeing other believers in Heaven. And a rebuke from God is proof that He loves us because He corrects those whom He loves.<\/p>\n\n\n\n<p>Expectations<br>Expectations are another big one. You think something bad is going to happen and when it does, boy, are you ready for it. Or, if you think something good is going to happen and you wait for it, and wait for it, and it seems like it may never happen, it’s easy to start getting a little frustrated, a little blue.<\/p>\n\n\n\n<p>Comparison<br>This one has long been known to cause discontent. We want something but never seem to be able to afford it. Or we get something, but it’s not as nice as someone else’s.<\/p>\n\n\n\n<p>There is also this feeling that we could different: we could have more, do more or even be more. It is because we often know ourselves bette than anyone else, we see the mistakes that we have made, the places where we could have done better, and the things that we really had hoped to do with our lives but never seemed to be able to get started.<\/p>\n\n\n\n<p>Knowing\/Not Knowing<br>There are times when we want to know something, so we may search for an answer. But when we find that answer, we may not like what we find out. Jeremiah was known as the weeping prophet because he saw what was coming and he mourned over the sins of his people.<\/p>\n\n\n\n<p>We can also know that something is coming, whether good or bad, but not know when it might come. Or, we can hear two or more sides to a story but not know for sure whose story is right.<\/p>\n\n\n\n<p>Misses Blessing and a Curse<br>I was driving through Spokane the other day when I saw two people in the front seat of a car flip off someone whose driving they obviously did not appreciate: a double flip with a half gainer. I give it a 4 or a scale of 1 to 10.<\/p>\n\n\n\n<p>I don’t think that we know how to bless each other, and we may not even know how to receive a blessing. A blessing could be as simple as a smile, but it could also be a kind word.<\/p>\n\n\n\n<p>Often, we are better at curing others: making fun of things that we don’t understand, calling others worthless, or telling others that they cannot do something without putting in an effort to try and help her do what it is that she wants to do. This is one area where I still need work.<\/p>\n\n\n\n<p>Separation<br>Even before social distancing became an every day habit, it seems that hugs had become a thing of the past. Hugs have gone from something that happened maybe once a week to something that happens maybe once a year at best. And the fear of spreading a virus has taken away even the hand shake (tough not entirely). The thing is that human contact, or the lack thereof, has a huge impact, not only our emotional health but our physical health as well.<\/p>\n\n\n\n<p>“Husbands, hug your wives.” — 1 Hallmark 1:2<\/p>\n\n\n\n<p>Conversations seem to be a dying skill, and laughter seems to have been put on the shelf. I still have at least one friend whom I look forward to spending time with but, most days, I hardly talk to anyone at work, there’s no one to talk to when I get home, and I sleep the rest of the day.<\/p>\n\n\n\n<p>Can I fix these issues, either some or all? No, not really. but just knowing and understanding the cause of my discontent has been a big help. My hope is that it will help you, too.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Why does it seem so hard to just be content? I was asking myself this the other day, and I think that I’ve some up with a few answers. I say a few because this feeling of discontent likely has multiple causes. This is what&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/contentment\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":130,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26],"tags":[3],"class_list":["post-129","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/129","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=129"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/129\/revisions"}],"predecessor-version":[{"id":131,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/129\/revisions\/131"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/130"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=129"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=129"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=129"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}