{"id":135,"date":"2022-11-16T17:52:26","date_gmt":"2022-11-16T17:52:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=135"},"modified":"2022-11-16T17:52:26","modified_gmt":"2022-11-16T17:52:26","slug":"it-aint-easy","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/it-aint-easy","title":{"rendered":"It Ain&#8217;t Easy"},"content":{"rendered":"\n<p>As we prepare for Thanksgiving Day, and think about the things that we are thankful for, perhaps we should take time to be thankful for all of the people in our lives. It may not be easy, but it will make our lives better.<\/p>\n\n\n\n<p>I know that there are people who rub us the wrong way. Their are personality clashes that can leave emotional scars. I’m not saying that we should hang around people who abuse us, either emotionally or physically. Nor am I saying that we should hang out with anyone and everyone, because there are certainly those who will bring us down. We should, however, realize that we are all made in the image of God, and He has called us to love, and not to judge.<\/p>\n\n\n\n<p>It’s all too easy to reduce ourselves, and others, to the things that we own, the way that we look, the jobs that we have, or the businesses that we own. We decide that we will respect others only when they’ve proven their worth, and we value them only for what they can do for us.<\/p>\n\n\n\n<p>As we think about all the things that we are thankful for, remember that there people who are alone, people with no homes, those who are suffering, either physically or emotionally. There are millions who are not free to choose how they want to live their lives: slaves to poverty, tyrannical governments, or actual slave. There are also countless men, women and children who are trafficked in sex trade. Those who would use anther human being in such a manner do not know God, and do not fear Him. They do not know that God’s anger and wrath will one day come upon them.<\/p>\n\n\n\n<p>Still, all life has value. All life should be respected. Over time, and more than once, we have lived contrary to this truth. Through wars and other forms of fighting and killing, we destroy others. Jesus said that if we hate our neighbor in our heart, we are already guilty of murder. Yet, our TVs and movie theaters are full of horrific scenes of murder and death. Athletes beat each other up for us to watch.<\/p>\n\n\n\n<p>This Thanksgiving, maybe we can be thankful not only for those we agree with, and not only those who meet our needs in some way, but also those who rub us the wrong way. It’s those who do so that can help round and smooth our own rough edges.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As we prepare for Thanksgiving Day, and think about the things that we are thankful for, perhaps we should take time to be thankful for all of the people in our lives. It may not be easy, but it will make our lives better. I&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/it-aint-easy\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":136,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14],"tags":[7,3],"class_list":["post-135","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-spiritual","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/135","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=135"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/135\/revisions"}],"predecessor-version":[{"id":137,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/135\/revisions\/137"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/136"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=135"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=135"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=135"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}