{"id":139,"date":"2022-11-17T19:10:32","date_gmt":"2022-11-17T19:10:32","guid":{"rendered":"https:\/\/llgt.cafe\/?p=139"},"modified":"2022-11-17T19:10:32","modified_gmt":"2022-11-17T19:10:32","slug":"jesus-is-different","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/jesus-is-different","title":{"rendered":"Jesus is Different"},"content":{"rendered":"\n<p>God created us to be able to choose, to make our own decisions. And our ability to make choices includes whether or not we will believe what God says and whether or not we will believe in the existence of a God at all.<\/p>\n\n\n\n<p>There are a lot of gods, and there are a lot — which is somewhat of an understatement — of religions that will help us find those gods. We can debate whether or not there is one true religion. I’m just going to say that, when it comes to founders of religions, Jesus is different.<\/p>\n\n\n\n<p>First, no other religious leader was proclaimed from birth (see Luke 2:8-15). In fact, a Messiah had been predicted long before Jesus’ birth. In fact he whole Old Testament is full of predictions of the birth, the life and the death of Jesus. And Jesus fulfilled every one of them.<\/p>\n\n\n\n<p>Yes, Jesus was a great teacher. And he taught like no other teacher at the time (see Matthew 7:29. His words were loving and his words were true. But they were also cutting, exposing the lies of the religious leaders, for for this, they hated Jesus.<\/p>\n\n\n\n<p>Jesus taught love, and he lived it. Jesus taught, “You have heard that it was said, ‘You shall love your neighbor and hate your enemy.’ But I say to you, love your enemies, bless those who curse you, do good to those who hate you, and pray for those who spitefully use you and persecute you,” — Matthew 5: 43-44 (KJV) But Jesus lived what he said, as he hung on the cross, “Then said Jesus, Father, forgive them; for they know not what they do.” — Luke 23:34 (KJV)<\/p>\n\n\n\n<p>Jesus wasn’t like the others around him. He welcomed little children (see Mark 10:13-16). He did not treat women as other men did, but treated them with compassion and respect. And he welcomed those who were considered to be outcasts — unworthy — by other people’s standards (see Luke 15:2).<\/p>\n\n\n\n<p>But Jesus wasn’t just a great teacher, for he was and is God. And for claiming to be equal with God, he was crucified (see Matthew 10:40, John 5:18, John 15:23, among others). As a man, Jesus was able to represent his creation. As God, Jesus was able to live a perfect life and to die on a cross, paying our sin debt.<\/p>\n\n\n\n<p>God not only gave us his written Word. When I put my faith in the Lord, Jesus, God put his Spirit within me, to lead me and to guide me in this life. It’s this relationship that I have with God, though his Holy Spirit, that makes me different. And it makes others who believe in Jesus different, but it leaves Jesus’ followers with more than just teachings and sayings. It gives us a relationship with God the Father, and a clear hope of things to come.<\/p>\n\n\n\n<p>One last thing; Jesus is coming back. No other religious leader can say this. Jesus himself warned that others would come saying that they were Jesus (see Matthew 24:5). But when Jesus returns, everyone will know. One day, everyone will bow their knee to Jesus (see Philippians 2:10).<\/p>\n\n\n\n<p>Yes, God created us with the ability to choose. We can believe what God says — about who we are and about who he is — or we can reject what God has said. Which will you choose?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>God created us to be able to choose, to make our own decisions. And our ability to make choices includes whether or not we will believe what God says and whether or not we will believe in the existence of a God at all. There&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/jesus-is-different\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":140,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,8,7,5,3],"class_list":["post-139","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/139","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=139"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/139\/revisions"}],"predecessor-version":[{"id":141,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/139\/revisions\/141"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/140"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=139"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=139"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=139"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}