{"id":142,"date":"2022-11-18T17:58:51","date_gmt":"2022-11-18T17:58:51","guid":{"rendered":"https:\/\/llgt.cafe\/?p=142"},"modified":"2022-11-18T17:58:51","modified_gmt":"2022-11-18T17:58:51","slug":"keep-going-keep-growing","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/keep-going-keep-growing","title":{"rendered":"Keep Going, Keep Growing"},"content":{"rendered":"\n<p>When we learn something, we take in knowledge either through study or by having someone teach us. Learning is meant, in some way to change what we do, what we know, how we do, or how well we do something. We can, for example, learn a new language, learn about places in other parts of the world, or learn the history of our won country.<\/p>\n\n\n\n<p>Learning, like exercise, isn’t always fun, and it’s not always easy. It may involve subjects that we are not interested in. And we may even find ourselves trying and failing at what we are trying to learn. Yet, like exercise, learning is a choice. And the only way that we can completely avoid the possibility of failure is to do nothing.<\/p>\n\n\n\n<p>Learning is meant to have some impact on our lives. Not only does it give us a stronger and healthier brain, it should have a positive impact on our lives. That isn’t to say that everything that is taught is worth learning, but the things that are worth learning should make some sort of change in our lives.<\/p>\n\n\n\n<p>In high school and college, much of what we learn is measured only in our ability to successfully pass a test. In college or in a trade school, we may learn a particular skill — anything form home making to computer programming, to practicing medicine — that we can take and either find a job or start our own business. But even the best high schools and colleges cannot teach us everything that we need to survive and thrive in an ever-changing world.<\/p>\n\n\n\n<p>Rather than seeing learning as a sprint, we should see it as a marathon. We shouldn’t think that once we have finished high school or even college that we can stop learning and coast along on the knowledge that we have already gained. Instead, we should see it as a marathon, or an ongoing race. We complete one mile, not so that we can stop and rest, but so that we can begin the next mile.<\/p>\n\n\n\n<p>Learning may or may not make us better than anyone else at something, but it should make us better at something, today, than we were yesterday. Whether we learn though reading, listening, watching, or doing, we should always seek to be better than we were, yesterday. Even if we make mistakes, or fail along the way. Because, in a way, failure can be one of life’s best teachers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we learn something, we take in knowledge either through study or by having someone teach us. Learning is meant, in some way to change what we do, what we know, how we do, or how well we do something. We can, for example, learn&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/keep-going-keep-growing\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":143,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[36,3,37],"class_list":["post-142","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-learning","tag-llgt","tag-study"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/142","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=142"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/142\/revisions"}],"predecessor-version":[{"id":144,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/142\/revisions\/144"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/143"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=142"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}