{"id":145,"date":"2022-11-19T17:54:51","date_gmt":"2022-11-19T17:54:51","guid":{"rendered":"https:\/\/llgt.cafe\/?p=145"},"modified":"2022-11-19T17:54:51","modified_gmt":"2022-11-19T17:54:51","slug":"financial-decisions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/financial-decisions","title":{"rendered":"Financial Decisions"},"content":{"rendered":"\n<p>Our emotions probably affect more of our decisions than we realize. But when it comes to our money, our emotions may not always be the best source of financial wisdom. In spite of all of the advertising and product placement that lures us to make that unexpected purchase, emotional decisions often leave out a lot of the information needed to make decisions that are in our best interest, and may even flat out lie.<\/p>\n\n\n\n<p>Emotional decisions don’t take into consideration any future impact of our choices. They lead us to buy things on credit, where we could wait and buy them with cash, often at a savings. They lead us to buy now, instead of shopping around to find the best price, or even to buy things that we don’t necessarily need, instead of investing the same money towards our future selves.<\/p>\n\n\n\n<p>Emotions also tell us that buying a certain item will make us happier, or somehow make our lives better. Some times it will, but more often than not, it is a feeling that doesn’t last, and goes away completely when we see someone with one that is better or newer than ours.<\/p>\n\n\n\n<p>How can we work with our emotions when it comes to financial decisions? I don’t think we will ever 100% make every decision without some emotional input. But there are some options that may help.<\/p>\n\n\n\n<p>First, set a limit to what you will spend on impulse purchases. It could be as little as a few dollars. A friend told me that she sets hers at $10. Anything over that amount gets put on a waiting list. If that item is still on the list after a month, it gets a green light.<\/p>\n\n\n\n<p>Second, make two lists. On one side, put possible benefits of having that thing that you want to buy. In the other list, write down possible drawbacks. These two lists may help you make the best choice.<\/p>\n\n\n\n<p>Third, remember to keep a budget. The simplest form of a budget is an envelope system. With this system, you cash each check, and place the money into envelopes designated for such things as rent, food, travel expenses and so on. If an envelope is empty, there is no more money for that expense. Whatever system you use, budgets are a helpful way of controlling spending.<\/p>\n\n\n\n<p>Finally, use cash. It’s much easier to think of cash as something real than it is credit, or even debit. It’s easy to forget the small purchases that we make when we don’t use cash. Carrying cash makes it easy: if the money isn’t there, we can’t spend it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our emotions probably affect more of our decisions than we realize. But when it comes to our money, our emotions may not always be the best source of financial wisdom. In spite of all of the advertising and product placement that lures us to make&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/financial-decisions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":146,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,38],"tags":[20,3],"class_list":["post-145","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-money","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/145","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=145"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/145\/revisions"}],"predecessor-version":[{"id":147,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/145\/revisions\/147"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/146"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=145"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=145"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}