{"id":162,"date":"2022-11-20T20:29:56","date_gmt":"2022-11-20T20:29:56","guid":{"rendered":"https:\/\/llgt.cafe\/?p=162"},"modified":"2022-11-20T20:29:56","modified_gmt":"2022-11-20T20:29:56","slug":"selling-online","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/selling-online","title":{"rendered":"Selling Online"},"content":{"rendered":"\n<p>There are several ways to start and run an online store these days. It can be run as part of a business, or on it’s own. You can sell one item, or hundreds of items. Below are just a few options that you may use for opening your own online store.<\/p>\n\n\n\n<p>Places to set up shop<br>There are a number of places to set up an online store. You can select one of these or, if you’re more adventurous, you can sell on your own website.<\/p>\n\n\n\n<p>eBay: a well know auction sight. It charges to list each item (some times it offers free listings), and charges a percentage of the final sales prices. Online stores are also available for a fee.<\/p>\n\n\n\n<p>Amazon: is the larges of all online retailers. It also offers online stores, for a fee, or you can sell individual items, also for a fee. One advantage to selling on Amazon is that, if you have a item ready to sell, is that you send your item to them, with the proper labels, and they store, sell it, collecting the money, and ship your item for you through their popular program, Fulfilled by Amazon. The disadvantage is that they take a large portion of the profits.<\/p>\n\n\n\n<p>Etsy: is popular for artists and other creatives. Creating a store is free, and the cost to list each items is low. There is also a fee collected by Etsy for each sale. Etsy doesn’t fulfill orders; it’s the responsibility of the seller to ship items that are sold.<\/p>\n\n\n\n<p>Shopify: is more of a go between between. The way I have mine set up is that I design products on Printify (and online printing shop), who takes a portion of the sales based on their cost and their profit margin. I cannot change their cost, but I can shop around for the best prices. I do set my price, and the percentage that I make. I list my items on Shopify, who charge a monthly fee (with a short free trial period). They also offer a number of apps. I have one for setting up affiliates, which offers free and paid services. I then list my items on my Facebook page, either directly, or as a link to my webpage.<\/p>\n\n\n\n<p>Facebook and Instagram: these can be used as a stand alone marketing strategy. I’ve seen people sell clothing on Instagram, and I’ve seen numerous items advertised on Facebook. Usually these adds take you to their website. There is a fee, and it’s based on a budget that you set, and the number of days that you want to advertise.<\/p>\n\n\n\n<p>Ways to get things to sell<br>Make them: This is a way for people to sell crafts that they make. This is best if you already have something that you can make and enjoy creating. It may not be a good idea if it is an item that is hard to make, takes a lot of time to make, or can’t be sold for enough money to justify making and selling whatever it is that you want to sell.<\/p>\n\n\n\n<p>Buy them: There are several options. One way to get started is just to go to yard sales. If you can find a bargain, you may just be able to sell it on eBay. The better you are at finding unique items, the better you will do. Thrift stores are another option, if you have a good eye at what people are looking for. I heard of a couple that makes a few hundred thousand dollars a year finding deeply discounted health and beauty items and selling them on Amazon.<\/p>\n\n\n\n<p>Websites like Alibaba are also good sources of items to sell online. Usually, these items are made overseas, and it may take an investment of your time and money before you can get started. For best results, you will need to contact and choose at least three companies to work with.<\/p>\n\n\n\n<p>Out of those three companies, you will need to collect samples (which you will have to pay for) and choose the best one. Once this company produces your item, it will have to be shipped to the United States, and that can cost as much as having the items made, itself. Your item can then be sent either to you, or to one of Amazon’s warehouses, where they will take care of selling the item for you; all you have to do is create a listing on your Amazon store that wows buyers. Some sellers have made millions of dollars selling items that they got through Alibaba and sold in an Amazon store, while others have lost a great deal of money.<\/p>\n\n\n\n<p>Print on demand: After looking at several options, I decided to go with Printify (I get no money or any compensation for saying this). For me, they had the best services and offered the best prices on their merchandise. Print on demand, however, cannot match the speed with which Amazon can ship items: often within a day or two. But print on demand eliminates the need to purchase inventory in advance. And for someone who wants to sell something like T-shirts (as I am doing), it eliminates the need to have stock of every color and every size.<\/p>\n\n\n\n<p>There are also several advantages of setting up an online store. If done correctly, these stores can be run automatically, even while you sleep. If you know what your market is looking for, and are connected to “your people”, you are less likely to loose money. It’s so much easier and cost so much less expensive to set up an online store than a traditional “brick and mortar” type store. Also, if everything is done online, it can open up opportunities for travel because, as long as you have a connection to the internet, you can run your online store.<\/p>\n\n\n\n<p>What do you think? Do you have anything to add? We would like to hear from you. As always, thanks for sharing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are several ways to start and run an online store these days. It can be run as part of a business, or on it’s own. You can sell one item, or hundreds of items. Below are just a few options that you may use&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/selling-online\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":163,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[39,40],"tags":[3],"class_list":["post-162","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-ideas","category-making-money","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/162","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=162"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/162\/revisions"}],"predecessor-version":[{"id":164,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/162\/revisions\/164"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/163"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=162"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=162"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=162"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}