{"id":165,"date":"2022-11-21T15:54:23","date_gmt":"2022-11-21T15:54:23","guid":{"rendered":"https:\/\/llgt.cafe\/?p=165"},"modified":"2022-11-21T15:54:23","modified_gmt":"2022-11-21T15:54:23","slug":"what-a-name-says","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-a-name-says","title":{"rendered":"What a Name Says"},"content":{"rendered":"\n<p>What is God like? It can be hard for a finite being to understand the infinite, but in the 56 plus years I’ve been around, I have at least some idea. Looking at the world around us, it’s easy to see the creativity of God. The Bible speaks of God’s holiness and of his loving nature. Psalm 2:4 says that God laughs, but I don’t think that’s talking about his sense of humor, and I’m pretty sure God has one.<\/p>\n\n\n\n<p>Perhaps one of the best ways to know God’s character is to look at the names of God. Below are 21 names that give us at least a small glimpse into who God is.<br><strong>Abba<\/strong><br>An Aramaic word for God, the English equivalent would be &#8220;Daddy&#8221; or &#8220;Father.&#8221; It is a more personal and intimate way of addressing God, perhaps too intimate for some, but Jesus often referred to God by this name.<\/p>\n\n\n\n<p><strong>Alpha and Omega<\/strong><br>This refers to the first and last letters of the Greek alphabet. In English terms, this would be A to Z, and speaks of God having always been in existence.<\/p>\n\n\n\n<p><strong>Attiyq Youm<\/strong><br>This is a word meaning “the ancient of days”. At one point during Jesus’ trial, Jesus stated that “before Abraham was, I am.” Not only was Jesus saying that he had been around before the time of Abraham, but he was making himself equal with God.<\/p>\n\n\n\n<p><strong>Christos<\/strong><br>This term means The Anointed One. Today, we might say the chosen one. God is the one sent by God, himself being God, to take on flesh so that he could pay the penalty for our sins. “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:16<\/p>\n\n\n\n<p><strong>El Chuwl<\/strong><br>The God Who Gave You Birth: this name could not only refer to every person who has ever existed, but also to the nation of Israel.<\/p>\n\n\n\n<p>E<strong>l Deah<\/strong><br>This name means God of Knowledge, and refers to the fact that God is omniscient, or all knowing, knowing even the thoughts of man. It’s said that even the smartest people know somewhere around 20% of what is to be known. God truly does know if all.<\/p>\n\n\n\n<p><strong>El Elyon<\/strong><br>Referring to God as The God Most High, this name for God reminds us that there is no one above God, and there was no one before him.<\/p>\n\n\n\n<p><strong>El Oman<\/strong><br>This name for God means The Everlasting God. Even The Everlasting Gobstopper came to an end, but God doesn’t.<\/p>\n\n\n\n<p><strong>El Roi<\/strong><br>If you think big brother is watching, consider the name El Oman, The God Who Sees. God sees everything.<\/p>\n\n\n\n<p><strong>El Shaddai<\/strong><br>More than a song by Amy Grant, this name means God Almighty, and refers to the omnipotent, or all powerful quality of God. The “My dad is bigger than your dad” doesn’t even hold a candle to the name El Shaddai.<\/p>\n\n\n\n<p><strong>Elohim<\/strong><br>This name for God means The Creator. God not only made all of us, he also made everything else. No one created God, and there was nothing that existed before him.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is God like? It can be hard for a finite being to understand the infinite, but in the 56 plus years I’ve been around, I have at least some idea. Looking at the world around us, it’s easy to see the creativity of God.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-a-name-says\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":166,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14],"tags":[8,7,3],"class_list":["post-165","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/165","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=165"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/165\/revisions"}],"predecessor-version":[{"id":167,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/165\/revisions\/167"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/166"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=165"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=165"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}