{"id":168,"date":"2022-11-22T17:43:05","date_gmt":"2022-11-22T17:43:05","guid":{"rendered":"https:\/\/llgt.cafe\/?p=168"},"modified":"2022-11-22T17:43:05","modified_gmt":"2022-11-22T17:43:05","slug":"family-stores-month","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/family-stores-month","title":{"rendered":"Family Stores Month"},"content":{"rendered":"\n<p>November is Family Stories Month. There are several different ways that you can celebrate, if you choose to do so.<\/p>\n\n\n\n<p>This Thanksgiving, get together around the dining room table and have each person share one of his or her favorite stories. It can be something that you did, or something that someone else did. Try to make it a story that won’t embarrass someone else but one that will bring warm memories and holiday cheer, instead.<\/p>\n\n\n\n<p>Tell of your favorite holiday tradition, such as an annual family vacation or how one of your relatives gave you the same gift every year because you kept leaving it at their house.<\/p>\n\n\n\n<p>If you don’t live close to your family and you won’t be able to visit with them this month, you can exchange stories through letters. It’s easy enough to sit down and write out or type a letter. If you prefer, you can call, text or email each other. And there are a host of ways to have groups of people in different locations get together online.<\/p>\n\n\n\n<p>Try not to spend this time alone. There are far too many people who would enjoy your company, whether in person or otherwise. You may have to give up some of your time to be with others, or you may need to be the one to reach out to someone else who needs someone to spend time with.<\/p>\n\n\n\n<p>You and\/or someone else in your family can even put together some sort of scrapbook, book or magazine with stories, photos and maybe a family recipe or two. And there are ways that one or more people can work from different places to put one of these together, too.<\/p>\n\n\n\n<p>Stories can be shared in person, on Facebook (if you trust your Facebook friends) or through a Skype call or FaceTime call. Your stories can be told orally, written out, recorded as audio or in video. You may even write to the home bound, to soldiers, the homeless or prisoners this year so that they know that they haven’t been forgotten.<\/p>\n\n\n\n<p>The stories that we tell and the things that we remember tell us a lot about ourselves. It’s our stories that not only make up our past but is the foundation on which our future is built. Want to give yourself a better future? Start by telling good stories. Instead of telling others how you dog left you and you spent all of your money, fine a positive story to share. Remember, the life you change, the future you shape, could be your own.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>November is Family Stories Month. There are several different ways that you can celebrate, if you choose to do so. This Thanksgiving, get together around the dining room table and have each person share one of his or her favorite stories. It can be something&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/family-stores-month\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":169,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,24],"tags":[3],"class_list":["post-168","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/168","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=168"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/168\/revisions"}],"predecessor-version":[{"id":170,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/168\/revisions\/170"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/169"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=168"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=168"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=168"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}