{"id":171,"date":"2022-11-23T18:23:06","date_gmt":"2022-11-23T18:23:06","guid":{"rendered":"https:\/\/llgt.cafe\/?p=171"},"modified":"2022-11-23T18:23:06","modified_gmt":"2022-11-23T18:23:06","slug":"photography-101","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/photography-101","title":{"rendered":"Photography 101"},"content":{"rendered":"\n<p><strong>Try this<\/strong><br>Take some lemon juice, a cotton swab or paintbrush and a piece of paper. Draw or write on the piece of paper with the brush and lemon juice. After the paper has dried, go over the paper with a hot iron and see what happens. Note, children should have adult supervision with the iron.<\/p>\n\n\n\n<p><strong>Cameras<\/strong><br>There are many different cameras — film and digital, large, medium and 35 mm format, point and shoot, instant and DSLR — but all of them have the same basic components: a lens to let the light in, a shutter, film or an image sensor, and a camera body to hold it all together.<\/p>\n\n\n\n<p><strong>Lenses<\/strong><br>The lens is what focuses the image onto the film or, in the case of digital, the image sensor. A camera lens is made up of a collection of one or more lenses. In the case of a pinhole camera, the tiny hole in the front of the camera acts as a lens. The camera lens is what determines the quality of the image. The focal length of the lens is what determines the area of an image that the camera sees, and the aperture determines how much light is let in, as well as how much of the image will be in focus. Some lenses also have the camera shutter built into the lens; this is mostly true of medium and large format cameras. The information below is based on 35 mm film cameras, which are most often used as a standard for comparing the focal length of various lenses.<\/p>\n\n\n\n<p><strong>Fisheye<\/strong><br>A fisheye lens is any lens with a focal length of 16mm or less, and has a view of about 180 degrees. The main characteristic of the fisheye lens is the round image it produces, and the amount of distortion it produces.<\/p>\n\n\n\n<p><strong>Wide Angle<\/strong><br>A wide angle Lens would be any lens less than 45mm, but greater than 16mm. Lenses in the 17 to 20 mm may also be referred to as super wide angle lenses. These lenses have an angle of view generally between 120 degrees and 40 degrees. The wide angle lens still produces distortion in the images, but it is far less than that produced by the fisheye lens. The most commonly used is the 35mm lens.<\/p>\n\n\n\n<p><strong>Normal Lens<\/strong><br>The normal, or standard lens, usually refers to the 50mm, with an angle of view of 46 degrees, or the 55 mm lens, produces an image most like what the human eye produces. The normal lens may produce a little distortion, mostly around the edges of the image, but it is far less than the wide angle lens. The 5o mm lens is only the normal lens for the 35 mm film standard, or full frame digital cameras. Cameras with larger or smaller film, or with larger or smaller image sensors, would use different focal length lenses for their normal lens.The normal lens on a medium format camera, for example, is an 80mm lens. Some of the advantages of a normal lens are the small size, and light weight, the large aperture — usually f1:8 — and the cost compared to other lenses.<\/p>\n\n\n\n<p><strong>Telephoto<\/strong><br>The Telephoto is any lens with a focal length greater than 55mm, while super telephoto lenses are those lenses with a focal length of 400mm or higher. Telephoto and super telephoto lenses are meant to bring a subject in closer. The 75mm lens, has an angle of view of 34 degrees, while the 600mm has an angle of view of less than 5 degrees. Telephoto lenses in the lower range, 75mm to 120mm, are often used for portraits, because of their ability to bring a subject closer, while rendering much of the background out of focus, while larger telephoto lenses of often used to capture sporting activities or images of animals in the wild.<\/p>\n\n\n\n<p><strong>Zoom<\/strong><br>Zoom lenses cover a wide range of focal lengths. Some examples would be 10-18mm, 18-55mm, and 55-200mm. Many of the DSLR (Digital SLR) Cameras and nearly all of the point and shoot cameras are sold with zoom lenses.<\/p>\n\n\n\n<p><strong>Specialty Lenses<\/strong><br>Other lenses, also known as specialty lenses, include macro and tilt shift lenses. The macro lens is designed to get up-close pictures of very tiny objects, like flowers or insects, while the tilt shift lens shifts the plane at which the images is in focus, shifting it so that one side of the image may be in focus, while the other side is out of focus. The tilt shift lens also has the ability to have objects at different distances in focus at the same time or, as in the case of architectural photography, change the perceived angle of parallel lines.<\/p>\n\n\n\n<p><strong>Filters<\/strong><br>Filters go on the end of the lease or sometimes inside the lens. Filters can serve several purposes, from protecting the glass i the front of the lens to changing removing certain things from black and white images. Filters can create special affects, and they can greatly reduce the amount of light that is let in the lens, allowing for longer exposures.<\/p>\n\n\n\n<p>You can use a physical filter but just about anything that can be done with a filter can be done on a computer with photo editing software.<\/p>\n\n\n\n<p><strong>Shutter<\/strong><br>The shutter of a camera determines the amount of time an image is exposed. There are three main types of shutter: a leaf shutter, a curtain shutter, and an electronic shutter. The leaf shutter acts much like the aperture on most cameras only, it closes all of the way, opening only when the shutter release is pushed. The leaf shutter is often found in cameras where the shutter is built into the lens. One advantage of the leaf shutter is that it doesn’t have the limitations that a curtain shutter has when it comes to flash photography. Leaf shutters are, however, limited to how fast they can operate, having a maximum speed of 1\/500 of a second.<\/p>\n\n\n\n<p><strong>Camera Body<\/strong><br>The camera body is what houses the film or image sensor. In the case of the point and shoot, the camera and lens are one unit. The SLR (Single Lens Reflex) as well as the DSLR have interchangeable lenses. Medium and large format cameras as well as some other cameras also have removable, or interchangeable lenses. In most cases, the camera body also houses the shutter, a light meter, and dials for the settings. The camera body may also have a built in flash as well as an LDC or Liquid Crystal Display. Digital cameras also have a buffer for the memory, an image processor, and some form of memory, either internal memory, or an external memory card.<\/p>\n\n\n\n<p><strong>Camera Settings<\/strong><br>There are four main camera settings found on nearly every SLR or DSLR, as well as many point and shoot cameras.<br>Manuel (M) lets the user set both the aperture and the shutter speed.<br>Program (P) is a form of automatic, but allows for some adjustments in the settings, such as whether or not the flash fires.<br>Shutter Priority (S) allows the user to select a shutter speed, while the camera sets an aperture.<br>Aperture Priority (A) allows the user to select an aperture, while the camera sets a shutter speed.<\/p>\n\n\n\n<p><strong>ISO or Film Speed<\/strong><br>One other term that needs to be mentioned is the ISO or film speed. ISO, short for International Standards Organization, set standardized numbers for the sensitivity of film or images sensors to light. In the case of film, the lower the number, the smaller the grain, and the more light is required. Conversely, the higher the number, the less light is needed, however, larger grains produce a grander image. A similar situation occurs with the digital camera. The more light that is available, and the lower the ISO used, the sharper the image will be.<\/p>\n\n\n\n<p><strong>Give and Take<\/strong><br>The ISO, shutter speed and the aperture all act together to determine the outcome of the image. Double the ISO, from 100 to 200 for example, and the shutter speed can also be double, from 1\/125 of a second to 1\/250. Closing the aperture from f5.6 to f8 can have the opposite effect, reducing the shutter speed. Change one of the settings, and it changes the other settings.<\/p>\n\n\n\n<p><strong>Pixels and Megapixels<\/strong><br>Digital cameras are rated by the number of pixels or millions of pixels (megapixels) that an image sensor contains. Though, it’s true that cameras with a higher number of megapixels produces a higher quality image, it’s also true that a larger image sensor produces a higher quality image.<\/p>\n\n\n\n<p><strong>Contrast<\/strong><br>Contrast describes the variance in light and dark. An image with high contrast is one that has bright areas as well as dark areas, whereas, an image that is low in contrast might be mostly grey or muddled colors.<\/p>\n\n\n\n<p><strong>Sharpness<\/strong><br>Sharpness refers to the the lines between subjects. The separation can be clear, or it can be blurred. Part of an image’s sharpness can be due to the lens, while part of it can be related to the ISO. A slow shutter speed can also reduce sharpness.<\/p>\n\n\n\n<p><strong>Latent Image<\/strong><br>A latent image refers to an image that has been taken, but remains undeveloped. The image can be on film, or on photo paper.<\/p>\n\n\n\n<p><strong>Prints and Images<\/strong><br>Prints generally refer to a hard copy of a picture, while images may be physical or digital. A print can be seen, while a digital image can be seen or unseen. Most often digital images are store on a computer’s internal hard drive or on an external drive, and are visible only on some sort of screen.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Try thisTake some lemon juice, a cotton swab or paintbrush and a piece of paper. Draw or write on the piece of paper with the brush and lemon juice. After the paper has dried, go over the paper with a hot iron and see what&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/photography-101\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":172,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28,31],"tags":[3],"class_list":["post-171","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","category-did-you-know","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/171","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=171"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/171\/revisions"}],"predecessor-version":[{"id":173,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/171\/revisions\/173"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/172"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=171"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=171"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=171"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}