{"id":174,"date":"2022-11-24T18:37:36","date_gmt":"2022-11-24T18:37:36","guid":{"rendered":"https:\/\/llgt.cafe\/?p=174"},"modified":"2022-11-24T18:37:36","modified_gmt":"2022-11-24T18:37:36","slug":"collecting-recipes","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/collecting-recipes","title":{"rendered":"Collecting Recipes"},"content":{"rendered":"\n<p>These days, there are more ways than ever to find and collect recipes. We can collect them, or find them as needed. Below are some ways you may collect recipes.<\/p>\n\n\n\n<p><strong>Cookbooks<\/strong><br>There are always new cookbooks coming out. Some from our favorite chefs or our favorite cooking show. Some of them specialize in a particular diet, while others may focus on one region of the country. Best thing is, cookbooks never go out of date. You may find some recipes have ingredients that are harder to find where you live, but you can usually find a substitute for these ingredients. If you have enough recipes, you may consider putting together your own cookbook. They can be printed in bulk, but there are also websites that will offer to print one at a time.<\/p>\n\n\n\n<p><strong>Magazines<\/strong><br>Several magazines include recipes for their readers. You can find these magazines in many stores, you can subscribe to them and have them delivered to your door, or you can read them, free, at your nearest library. Magazines seem to have as much advertising as they do anything else and, as with anything else, they continue to go up in price, but you may just find a recipe that you want to try out.<\/p>\n\n\n\n<p><strong>Note-cards<\/strong><br>Putting recipes on note-cards and putting them into a fining box is a great way to collect recipes. You can copy them from any source you like, or reproduce recipes that have have been passes down through the generations. Not cards are handy because they don’t take up a lot of room, and you don’t have to worry about having a bunch of recipes that you will probably never use. They can also be protected by covering them with clear plastic, or laminating them.<\/p>\n\n\n\n<p><strong>Notebooks<\/strong><br>A notebook works, too, and is a cheap way to copy your favorite recipes. A spiral notebook might work best, so that the pages lay flat, and the notebook doesn’t keep closing. You can write recipes by hand, and may even choose to cut and paste photos from magazines or from other sources.<\/p>\n\n\n\n<p><strong>Binders<\/strong><br>Binders work like notebook, except that you can easily add or take away recipes. And you can take recipes out of the binder when you want to use them. You can also put pages in plastic page covers. You can cut out who pages from magazines or print recipes on your printer.<\/p>\n\n\n\n<p><strong>Journals<\/strong><br>You can use a blank journal to write your recipes. You can use line or blank pages. Moleskine makes a journal especially designed for collecting recipes, and there are many others available. These journals are usually pretty nice, but they may be harder to keep clean when you are cooking.<\/p>\n\n\n\n<p><strong>Websites<\/strong><br>There are a number of websites where you can find recipes. They are free, and you can write them down or print them from a computer. Allrecipes, at allrecipes.com is one of my favorite websites. It allows me to change the number of servings being made and adjusts the recipe accordingly. You can go right to the website to start searching for recipes. Usually, however, I just start with Google.<\/p>\n\n\n\n<p><strong>Apps<\/strong><br>There are several apps to choose from when it comes to recipes. Some of them have recipes in them, while others allow you to add recipes, either by typing them in or by downloading them. In addition to giving you all the information about the recipe, many of these apps will also help you create a shopping list. Many of these apps are free to download, while others are fairly inexpensive, and most are less than the cost of a cookbook.<\/p>\n\n\n\n<p>Do you collect recipes? What is your favorite way to collect them? Please let us know. As always, thanks for sharing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>These days, there are more ways than ever to find and collect recipes. We can collect them, or find them as needed. Below are some ways you may collect recipes. CookbooksThere are always new cookbooks coming out. Some from our favorite chefs or our favorite&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/collecting-recipes\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":175,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[42,43],"tags":[3],"class_list":["post-174","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-collecting","category-food","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/174","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=174"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/174\/revisions"}],"predecessor-version":[{"id":176,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/174\/revisions\/176"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/175"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=174"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=174"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=174"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}