{"id":181,"date":"2022-11-26T19:12:04","date_gmt":"2022-11-26T19:12:04","guid":{"rendered":"https:\/\/llgt.cafe\/?p=181"},"modified":"2022-11-26T19:12:18","modified_gmt":"2022-11-26T19:12:18","slug":"what-does-it-mean","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-does-it-mean","title":{"rendered":"What Does it Mean?"},"content":{"rendered":"\n<p>Being a Christian means different things to different people. To some, it means grown up in a “Christian nation.” It means not being an atheist, a Muslim, a hinder or one of many other religions. To some, it means being a good persons, loving and accepting.<\/p>\n\n\n\n<p>I became a Christian just over 42 years ago and, at the time, I really didn’t know much about my new found faith. Actually, I don’t believe that my faith is something that I found but was something that was given to me. I wasn’t looking for God, but God came after me.<\/p>\n\n\n\n<p>What does it mean to be a Christian? Being a Christian is as overused and as misunderstood as the word love. “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:16 (KJV)<\/p>\n\n\n\n<p>To me, being a Christian means a few things. It means that I recognize that my sin separates me from a loving God and that this sin brings death. God is life, love and everything that is good and separation from God means separation from all of these things.<\/p>\n\n\n\n<p>To me, being a Christian means trusting God’s word, that he is who he says he is and that what he says is true. God says that he love me; I believe him. God says that he loved me enough to send his son to die on the cross so that I might have eternal life; I believe him. God says that he will work all things to the good of those who believe; I believe him. I don’t always understand or believe as strongly as I would like to, but I believe.<\/p>\n\n\n\n<p>God didn’t “pick me” because I was stronger or smarter or more popular than anyone else. In fact, I lack in many of these areas. If fact, the Bible says that he so loved the world and that “whosoever believeth” can have eternal life.<\/p>\n\n\n\n<p>I don’t think it’s so much that God accepts some and rejects others as it is that some just don’t feel the need for God. We tend to see just the things that are in front of us and, if we have food, shelter, friends, intelligence and plenty of money, who needs God? But we all need God. We’re all sinners in need of a savior.<\/p>\n\n\n\n<p>God doesn’t say that we can earn eternal life through good works. The Bible does say that only God is good. We tend to judge ourselves by how we feel at the time, by our own standards, or by comparing ourselves to others. But that’s not how God judges us and God’s option is the only one that really matters.<\/p>\n\n\n\n<p>One problem is that we only see the present moment. And we don’t see or know all things. We judge others when only God can know the heart of a man. We may think that we know everything that we need to know, but we don’t. The only thing that we can do is the best we know how to do at the time. It’s as true for you as it is for me.<\/p>\n\n\n\n<p>God gives us ten commandments, two of which are above all the rest: love God and love others. When I was a child, I thought that my parents didn’t love me if they didn’t let me have my way. But I eventually grew out of that. Today, there are still people, adults even, who still feel this way: that being loving is just accepting anything and everything. But, again, we are going by God’s standards and not our own.<\/p>\n\n\n\n<p>The Bible says that there will be hard times in this life, and I believe it. But it also says that there will be rewards for those who put their faith in God and the son of God. I wish I could say that this life was going to be easy, but it’s not. There are going to be things that we just don’t understand, times when we don’t have answers and times when it seems like nothing is going right. But God promises that, in time, it will all come together. It may be in this lifetime and it may not. Believing in God and trusting his word — loving him — that is what it means to be a Christian.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Being a Christian means different things to different people. To some, it means grown up in a “Christian nation.” It means not being an atheist, a Muslim, a hinder or one of many other religions. To some, it means being a good persons, loving and&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-does-it-mean\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":182,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[8,7,5,3],"class_list":["post-181","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/181","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=181"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/181\/revisions"}],"predecessor-version":[{"id":184,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/181\/revisions\/184"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/182"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}