{"id":196,"date":"2022-11-27T18:55:55","date_gmt":"2022-11-27T18:55:55","guid":{"rendered":"https:\/\/llgt.cafe\/?p=196"},"modified":"2022-11-27T18:55:55","modified_gmt":"2022-11-27T18:55:55","slug":"happy-thoughts","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/happy-thoughts","title":{"rendered":"Happy Thoughts"},"content":{"rendered":"\n<p>Happy thoughts<\/p>\n\n\n\n<p>It’s strange. Two people can experience the same event and yet come away with different views of what happened. I saw a photo of an Instagram where the younger of two sisters was crying. It was her the older sisters birthday and I think the younger sister was upset because she felt left out of the gift receiving.<\/p>\n\n\n\n<p>The thing is, we have a choice of how we see things: our past and the events of our lives. We even have a choice in how we view our future. Our past may be done and gone, but we can allow it to haunt us, or we can allow it to enrich us and teach us. Our past has the ability to build us up or tear us down. And we can choose to see our future as bright or feel that we have no future at all.<\/p>\n\n\n\n<p>Unfortunately, it’s all to easy to thing that things would be better if (fill in the blank). If we had this, if we didn’t have that, if I got married or if I won the lottery, things would be better. Yet, better really does start with us. It is indeed, an inside job.<\/p>\n\n\n\n<p>One of my struggles is to find happy thoughts. Unfortunately, it’s a lot easier to remember all of the bad things, the disappointments, the times that we didn’t get what we wanted and the times that things didn’t turn out as we would have liked.<\/p>\n\n\n\n<p>It’s kind of the half full, half empty question. And whether we choose to believe it or not, we can rally find something good in just about every situation.<\/p>\n\n\n\n<p>I don’t know exactly how many thoughts we have every day, but the things that we think about really are our choice. We can not only choose the things that we think about what what we think about the things that we think about. And it’s these things that we think about that drive our actions and fuel our emotions.<\/p>\n\n\n\n<p>It’s nice to have past experiences that easily lend to happy thoughts, but that doesn’t always happen. Life isn’t always easy, and we don’t always see the positive in things. There are times when it can just be hard to find happy thoughts.<\/p>\n\n\n\n<p>Some people keep gratitude journals. It can be helpful when it comes to creating a library of happy thoughts. Other people focus on doing the things that make them happy, while avoiding the things that they dislike. Still, other people work on the things that they think about.<\/p>\n\n\n\n<p>One of my favorite happy thoughts is the promise of Heaven found in the Bible. I don’t care so much about street(s) of gold. What I’m looking forward to is being in the presence of the love of God: a love that will never end.<\/p>\n\n\n\n<p>What are your happy thoughts? Do you have any any happy thoughts? Do you tend to see the perfection of an object or person, or do you tend to see the one little flaw. Believe it or not, the choice is ours. And the things that we think about do influence how we feel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Happy thoughts It’s strange. Two people can experience the same event and yet come away with different views of what happened. I saw a photo of an Instagram where the younger of two sisters was crying. It was her the older sisters birthday and I&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/happy-thoughts\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":197,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26],"tags":[3],"class_list":["post-196","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/196","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=196"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/196\/revisions"}],"predecessor-version":[{"id":198,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/196\/revisions\/198"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/197"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=196"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=196"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=196"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}