{"id":202,"date":"2022-11-29T17:46:00","date_gmt":"2022-11-29T17:46:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=202"},"modified":"2022-11-29T17:46:00","modified_gmt":"2022-11-29T17:46:00","slug":"the-real-question","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-real-question","title":{"rendered":"The Real Question"},"content":{"rendered":"\n<p>What do you want to be when you grown up? It’s a good question, and it’s one that I have continued to ask myself throughout many of the past 56 years.<\/p>\n\n\n\n<p>It’s great to dream about the things that we could do with our lives. Unfortunately, there are very few who have a clear vision of what they want to become, and even fewer who actually reach the the goal that they set out for.<\/p>\n\n\n\n<p>Take professional football, for example. There are likely millions who play football in high school, hoping to be picked up by a Division 1 college team. They may put all of their time into becoming the best football player. Yet, fewer than 4 percent of all Division 1 players are likely to make it into the NFL. And if you are good enough to get in, there is no guarantee that you will keep playing for more than a few years.<\/p>\n\n\n\n<p>Though it was never my dream to play in the NFL, I did have hopes of being professional photographer, perhaps working for a newspaper or a magazine like “National Geographic” or “Sports Illustrated”. But Journalism has changed over the years. There are fewer and fewer newspapers that have full time staff photographers. And instead of photography, I found it easier to get into food service.<\/p>\n\n\n\n<p>There are people who know what they want to do with their lives. They put all of their attention on their goal. They go after their goal, and they don’t let anything or anyone get in their way and, eventually, they reach their goal. Their are others who don’t quite know what they want to do. For those who don’t have a clear goal, life becomes a game of chance: of trial and error.<\/p>\n\n\n\n<p>We will all face challenges, no mater what we decided to do with our lives. If you don’t have any challenges, it may be because you aren’t doing anything. If you don’t try, if you never step outside of your comfort zone, you are less likely to fail, but you aren’t going to get anywhere.<\/p>\n\n\n\n<p>The real question may not be what you or I want to be when we grow up, but now long are we willing to go after what we really want without giving up. In the words of Jason Nesmith (Tim Allen) from the 1999 movie “Galaxy Quest”, “Never give up; never surrender.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What do you want to be when you grown up? It’s a good question, and it’s one that I have continued to ask myself throughout many of the past 56 years. It’s great to dream about the things that we could do with our lives.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-real-question\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":203,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44],"tags":[3],"class_list":["post-202","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/202","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=202"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/202\/revisions"}],"predecessor-version":[{"id":204,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/202\/revisions\/204"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/203"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=202"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=202"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}