{"id":208,"date":"2022-12-01T18:10:57","date_gmt":"2022-12-01T18:10:57","guid":{"rendered":"https:\/\/llgt.cafe\/?p=208"},"modified":"2022-12-01T18:10:57","modified_gmt":"2022-12-01T18:10:57","slug":"six-physical-fitness-tips-from-kung-fu-panda","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/six-physical-fitness-tips-from-kung-fu-panda","title":{"rendered":"Six Physical Fitness Tips from &#8220;Kung Fu Panda&#8221;"},"content":{"rendered":"\n<p>One of my favorite movies is Kung Fu Panda, a DreamWorks Animation movie, released in 2008, about a panda named Po who dreams of being a kung fu master. And I believe there are things that this movies can teach us about physical fitness.<\/p>\n\n\n\n<p>First, set a goal. In the movie, Po, voiced by Jack Black, wants to be a kung fu mater. And in the opening scene, he has a dream that he is able to defeat an army of bad guys with his awesome kung fu skills, and the help of five other kung fu masters known as the “furious five.” Do you want to be a king fu master, swim in the olympics, or have a body like Arnold Schwarzenegger? Whatever your dream, make it something that is big enough get you started and keep you going.<\/p>\n\n\n\n<p>Second, figure out what motivates you. This is different from setting a goal. It’s finding your “why”. You could say, “I want to be stronger”, or “I want to be healthier,” or, “I want to be able to do certain things when I get older.” In the movie, Po’s mentor, Shifu, discovers that Po is a highly motivated eater, and will do just about anything to get to food, including very difficult kung fu moves. Shifu then uses this new found knowledge to teach Po. Whatever your goal is, your reason needs to be strong enough to get you started, and keep you going. It’s also easier to stick to a goal if this is something that you want to do rather than something that you think someone else wants you to do.<\/p>\n\n\n\n<p>Third, get started. Po starts his journey when he leaves his father’s restaurant and climbs the stairs to the Jade Palace. Start with these questions: is there any specialized equipment or clothing that you need to buy? Will you need to join a gym? If so, go out and buy it; do what you need to do to get started. If funds are low, work with what you have.<\/p>\n\n\n\n<p>Fourth, find a mentor. In the movie, once Po is chosen as the dragon warrior, Shifu becomes his mentor. It may be much easier to stick to someone if you commit to a mentor or a coach. This mentor can not only keep you motivated, but can push you to limits beyond what you have imagined. A mentor may also help you understand your limits, which may be and important part of the prevention of personal injury.<\/p>\n\n\n\n<p>Fifth, build your team. Another option is to add two your team. You may not need a mentor. Having someone else to participate in physical activity, such as running or jogging, can not only help keep you motivated, but can help build stronger relationships. In the movie, Po not only has a mentor, but he also has the furious five.<\/p>\n\n\n\n<p>Sixth, find your enemy. Maybe you aren’t as healthy as you want to be, or maybe you think that you won’t be picked on as much if you are stronger. In the movie, Po is forced to fight Tai Lung, a former student of Shifu who wants to take Po’s place as dragon warrior, and destroy his the neighboring village. Defining your enemy, and working to defeat it can be a powerful motivator when it comes to reaching your physical goal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of my favorite movies is Kung Fu Panda, a DreamWorks Animation movie, released in 2008, about a panda named Po who dreams of being a kung fu master. And I believe there are things that this movies can teach us about physical fitness. First,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/six-physical-fitness-tips-from-kung-fu-panda\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":209,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16,45],"tags":[3],"class_list":["post-208","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/208","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=208"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/208\/revisions"}],"predecessor-version":[{"id":210,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/208\/revisions\/210"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/209"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=208"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=208"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=208"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}