{"id":211,"date":"2022-12-02T19:15:13","date_gmt":"2022-12-02T19:15:13","guid":{"rendered":"https:\/\/llgt.cafe\/?p=211"},"modified":"2022-12-02T19:15:13","modified_gmt":"2022-12-02T19:15:13","slug":"its-my-choice","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/its-my-choice","title":{"rendered":"It&#8217;s My Choice"},"content":{"rendered":"\n<p>As a photographer, there’s nothing I enjoy more than going out and taking pictures, looking for just the right moment, or that single flower, nearly lost in a background of snow and ice.<\/p>\n\n\n\n<p>As a person, I often look for the best in others. If you try, it’s not too hard. Some times, it’s harder than others. Some people are just looking to push others away and, whether they realize it or not, even they have admirable qualities.<\/p>\n\n\n\n<p>I choose to see the best because that’s what I like, and it’s a part of who I am. I like Breightling watches, and Mercedes Benz, not because I can afford either, but because they are, in my opinion, some of the best. I choose to see the best in others, because, contrary to popular opinion, a first impression is not always right. I’ve seen people who gave a negative first impression and turned out to be pretty nice and I’ve seen people who made a positive first impressions who later acted like total jerks.<\/p>\n\n\n\n<p>I believe in first, second and third chances. And you know what matters most in my choice to see the best: I choose.<\/p>\n\n\n\n<p>I don’t let others, popular opinion, television, news medial or even social media tell me that to think. I don’t let the any of these tell me what to think, what to fear, who to like or dislike, who to trust or mistrust. They can have their input but, in the end, I choose. As my friends might tell me, I don’t even let the weather or a forecast of “nasty” keep me from going out and taking pictures.<\/p>\n\n\n\n<p>Yes, I look for, and often find the best. My problem is that I know myself a little too well. I know every mistake I make, every sinful thought that I think, and every time that I fail. I know the person that I want to be and I know that I ain&#8217;t that guy. Who is it hardest to see the best in? Me.<\/p>\n\n\n\n<p>It’s easy to see the worst in ourselves. And how does it often come out? We see it most in others. My sister taught me that the quality that we least like in others is likely the quality that we least like in ourselves. It’s something to think about when we accuse someone else of being rude, impatient or bitter.<\/p>\n\n\n\n<p>I’ve been quite fortunate lately. I’ve been able to spend time with at least one person who sees the best in me. And it’s helping me too see some of the best in me, too. Don’t get me wrong, I’m still not the man that I want to be, but at least I can see that there’s some good inside of me, even if it’s not me but the indwelling Holy Spirit.<\/p>\n\n\n\n<p>What do you choose to see? I heard a story about two men who were waling trough town. One was, I’ll guess, from that town. The other was a native American. In the conversation, the native American spoke of the things that his people saw or heard as compared with the people of the other man. To illustrate, he dropped a handful of coins on the ground and, immediately, several people turned around. After that illustration, the native American man asked his friend if he heard the cricket. His friend could not. But, as he began to listen, he could. The moral of the story is that we focus, not on everything, but only the thins that matter to us: the things that we train ourselves to focus on. Are we letting others tell us what’s important, or do we make that choice, ourselves?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a photographer, there’s nothing I enjoy more than going out and taking pictures, looking for just the right moment, or that single flower, nearly lost in a background of snow and ice. As a person, I often look for the best in others. If&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/its-my-choice\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":212,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26],"tags":[3],"class_list":["post-211","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/211","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=211"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/211\/revisions"}],"predecessor-version":[{"id":213,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/211\/revisions\/213"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/212"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=211"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=211"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=211"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}