{"id":215,"date":"2022-12-03T19:03:36","date_gmt":"2022-12-03T19:03:36","guid":{"rendered":"https:\/\/llgt.cafe\/?p=215"},"modified":"2022-12-03T19:03:36","modified_gmt":"2022-12-03T19:03:36","slug":"good-rules-to-follow","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/good-rules-to-follow","title":{"rendered":"Good Rules to Follow"},"content":{"rendered":"\n<p>When it comes to our emotions, there are a couple of rules that we ought to follow. The first is probably easier and it’s this: don’t take up another persons complaint. This isn’t to say that if someone is having a problem that you shouldn’t try to help, but if you know someone who has something against another person, you shouldn’t take up the other person’s complaint as if it were your own.<\/p>\n\n\n\n<p>I’m not talking about when someone is harassing or bullying someone that you care about. And it’s just fine to listen to someone to help him or her work through what the core problems might be and to talk about any possible solutions, but becoming angry at someone for what they did to someone else does no good.<\/p>\n\n\n\n<p>The other rule is that we should not let others have total control over our emotions. A friend put it this way: others can make me happier, but they cannot take away my happiness. It’s a good way to look at those around us, and it’s a good idea for our circumstances as well. We need to have a base level of happiness that comes from within, something that won’t go away if our circumstances or someone else tries to take it away.<\/p>\n\n\n\n<p>It’s no surprise that, because of the control necessary to train in kung fu that the martial arts teach a high level of control, not only of the body but also the mind. And, if you like, you can train in the martial arts, or you can become a monk in order to learn to control your emotion. You can also just decide to follow these two rules. But remember that it can take time to make these rules a part of your life.<\/p>\n\n\n\n<p>Doing these things is kind of like exercising a muscle. The more we practice these skills, the better we will become at following them. For years, I was content with my surroundings — friends and family, and even my job. And thought there were times when I felt trapped, I wasn’t in any hurry to change either. Then life happened and I was forced to make changes in my life.<\/p>\n\n\n\n<p>I’ll admit, it wasn’t easy, building a new life. And after two years of settling in to my new lifestyle, live happened, again. This time, however, I was kind of ready for it. I say kind of because being out of work for nearly three weeks was kind of hard, but it wasn’t unbearable. And now that I’m working at my new job, I&#8217;m okay with my circumstances.<\/p>\n\n\n\n<p>One thing that I’ve seen is that we can be happy in the worst of circumstances as we can be miserable in the best of circumstances. It’s not our circumstances that make us happy or miserable but how we choose to see the details within our circumstances.<\/p>\n\n\n\n<p>Maybe you’ve grown tired of seeing the same view day after day, month after month and year after year. You can choose to see the world around you through new eyes. It’s your choice. You can do it.<\/p>\n\n\n\n<p>It may take a little more work to choose your own emotions but, in the end, the results are well worth the extra effort that it takes. But don’t take my word for it. Try it, you’ll like it. And if you don’t, you can ask for a full refund.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to our emotions, there are a couple of rules that we ought to follow. The first is probably easier and it’s this: don’t take up another persons complaint. This isn’t to say that if someone is having a problem that you shouldn’t&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/good-rules-to-follow\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":216,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29,45],"tags":[3],"class_list":["post-215","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/215","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=215"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/215\/revisions"}],"predecessor-version":[{"id":217,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/215\/revisions\/217"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/216"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=215"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=215"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=215"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}