{"id":218,"date":"2022-12-04T20:07:29","date_gmt":"2022-12-04T20:07:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=218"},"modified":"2022-12-04T20:07:29","modified_gmt":"2022-12-04T20:07:29","slug":"great-worth","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/great-worth","title":{"rendered":"Great Worth"},"content":{"rendered":"\n<p>What is of greater value than money? It’s not gold, silver or even platinum. It’s not rubies or diamonds. It’s not our houses or our cars, our careers or our status in society.<\/p>\n\n\n\n<p>So what’s the answer. There are a few.<\/p>\n\n\n\n<p><strong>Time<\/strong><br>Time, along with all of the rest of the items on this list, is something that we cannot buy. No amount of money can buy us more time, and no amount of money can make us younger or take us back in time. Once spent, time is gone. Solomon said that we ought to do everything in moderation. Use your time wisely, but make sure that you have fun along the way.<\/p>\n\n\n\n<p><strong>Health<\/strong><br>Even Sam Walton and Steve Jobs did not have enough money to keep death at bay forever. And the same is true for the richest men on the planet today. It’s true for all of us. The Bible tells us that it is appointed unto man to die, once and only once. Anyone who has not yet died, at one point will. It is a result of sin, and cannot be changed. We have many opportunities to keep our health, but few to get it back once it is lost. Some may get their lives back after a short period of physical death. Lazarus was dead for three days, as was Jesus. Lazarus died again soon after. Jesus received a glorified body. Take care of your health. It’s of greater value than we truly understand, until it’s gone.<\/p>\n\n\n\n<p><strong>Relationships<\/strong><br>I heard a joke that said: “if a 65 year old man has a 22 year old wife, how much money does he have.” So, to an extent, we can buy relationships. If not relationships, we can at least buy companionship. Yet when it comes to the deeper relationships, like the one that out to be between a husband and a wife, parent and child and close friends, these we cannot buy. Perhaps most importantly, we cannot buy a relationship with the living God. It is a free gift offered to all men and women, paid for by Jesus Christ and received by faith. Nothing that we can do or possess can get us into Heaven. As the old hymn says, Jesus paid it all.<\/p>\n\n\n\n<p><strong>Reputation<\/strong><br>“A good name is rather to be chosen than great riches, and loving favour rather than silver and gold.” — Proverbs 22:1 (KJV) I dare say that not even a good credit rating is better than a good name or, in other words, a good reputation. It too, is something that you cannot buy. It comes not only with the respect of others but with self respect, and you cannot buy it, you have to earn it.<\/p>\n\n\n\n<p>We can buy an education, but cannot buy wisdom. We can buy popularity but cannot buy respect. We can even buy votes, but cannot buy servitude, loyalty or integrity. We can buy people, but we cannot buy love, at least not Biblical love. To an extent, we can buy outer beauty, but we cannot buy outer beauty or character. We can buy momentary happiness, but we cannot buy a lasting joy. And, most importantly, we cannot buy eternal life.<\/p>\n\n\n\n<p>What is the value of money? It’s the value that we place on it. In reality, it’s the value of the dollar when compared with an ounce of gold. We tend to think that it’s the value of the gold that changes, but it’s really the value of the dollar. We exchange or money for those things that we think are of equal or greater value than the money that we spent. We give it away in hopes of doing good for ourselves and others. We spend days and weeks trying to capture it, often to release it in moments.<\/p>\n\n\n\n<p>Yes, we ought to save. Yes, we ought to invest. But remember that the things that we can obtain in this life often don’t last into eternity. It’s something to think about as we go through this life, and as we make our day to day decisions. In reality, God is the true owner, anyway. We’re just stewards of what God has given us.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is of greater value than money? It’s not gold, silver or even platinum. It’s not rubies or diamonds. It’s not our houses or our cars, our careers or our status in society. So what’s the answer. There are a few. TimeTime, along with all&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/great-worth\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":219,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38],"tags":[3],"class_list":["post-218","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-money","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/218","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=218"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/218\/revisions"}],"predecessor-version":[{"id":220,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/218\/revisions\/220"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/219"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=218"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=218"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=218"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}