{"id":223,"date":"2022-12-05T18:06:29","date_gmt":"2022-12-05T18:06:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=223"},"modified":"2022-12-05T18:06:29","modified_gmt":"2022-12-05T18:06:29","slug":"god-wins","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/god-wins","title":{"rendered":"God Wins"},"content":{"rendered":"\n<p>If you look at the news, it might be easy to think that “the bad guy” is winning. I used quotes, because it’s not always easy to tell who the bad guy is. Like the 1996 movie, “Mars Attacks,” where the aliens announce that they have come in piece just before opening fire, enemies don’t always announce themselves as such.<\/p>\n\n\n\n<p>The Bible makes it clear who our enemy is and, just as important, who it is not, stating in Ephesians 6:12 (KJV), “ For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.”<\/p>\n\n\n\n<p>Ephesians 6:13-18 (KJV) tells us how we ought to defend ourselves and even fight against this enemy, saying, “Wherefore take unto you the whole armour of God, that ye may be able to withstand in the evil day, and having done all, to stand. Stand therefore, having your loins girt about with truth, and having on the breastplate of righteousness; And your feet shod with the preparation of the gospel of peace; Above all, taking the shield of faith, wherewith ye shall be able to quench all the fiery darts of the wicked. And take the helmet of salvation, and the sword of the Spirit, which is the word of God: Praying always with all prayer and supplication in the Spirit, and watching thereunto with all perseverance and supplication for all saints.”<\/p>\n\n\n\n<p>Note that the only offensive weapon is the word of God. And though some may find it offensive, the Bible really is our only hope for going up against our real enemy.<\/p>\n\n\n\n<p>The bad news is that, for a while, the bad guy is going to win. The book of Revelation starts off by paining a pretty scary picture of what is going to happen over a seven year period called the tribulation, with something called the great tribulation beginning at the halfway mark. And though there are a number of opinions on how and when the tribulations starts, it is clear how it ends. And this is the good news; in the end, God wins. And for those who put their faith in the unfailing love of God and the blood that Jesus shed at the cross, our ultimate victory is also assured.<\/p>\n\n\n\n<p>Now that we know who the opponents are, and we know who will be the winer when all is said and done, one question remains: whose team are you on?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you look at the news, it might be easy to think that “the bad guy” is winning. I used quotes, because it’s not always easy to tell who the bad guy is. Like the 1996 movie, “Mars Attacks,” where the aliens announce that they&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/god-wins\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":222,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[8,5,3],"class_list":["post-223","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/223","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=223"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/223\/revisions"}],"predecessor-version":[{"id":224,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/223\/revisions\/224"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/222"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}