{"id":225,"date":"2022-12-06T18:43:59","date_gmt":"2022-12-06T18:43:59","guid":{"rendered":"https:\/\/llgt.cafe\/?p=225"},"modified":"2022-12-06T18:43:59","modified_gmt":"2022-12-06T18:43:59","slug":"is-it-true","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/is-it-true","title":{"rendered":"Is it True?"},"content":{"rendered":"\n<p>“Those who cannot remember the past are condemned to repeat it.” — George Santayana<\/p>\n\n\n\n<p>Is it true? If so, what is it that our past has to teach us? What, if anything, do days like National Pearl Harbor Remembrance Day, 9\/11 and Memorial Day have to teach us?<\/p>\n\n\n\n<p>First, God is sovereign, the supreme ruler over all of his creation. Having free will, we can either believe this or reject it. Instead of believing what the Bible tells us, we can follow our own path. Yet, over and over, our path will lead to destruction.<\/p>\n\n\n\n<p>Second, the things that were will happen again. Because God knows all things, he knows that we tend to repeat our mistakes. “The thing that hath been, it is that which shall be; and that which is done is that which shall be done: and there is no new thing under the sun.”<br>— Ecclesiastes 1:9 (KJV)<\/p>\n\n\n\n<p>Jonah was sent to Nineveh to say that God was about to destroy its inhabitants. When the repented, Jonah prayed this prayer: “And he prayed unto the LORD, and said, I pray thee, O LORD, was not this my saying, when I was yet in my country? Therefore I fled before unto Tarshish: for I knew that thou art a gracious God, and merciful, slow to anger, and of great kindness, and repentest thee of the evil.” — Jonah 4:2 (KJV)<\/p>\n\n\n\n<p>God’s wrath can be avoided but, as the Bible tells us, we have to seek him while he may be found. There are times when God will turn a deft ear and will not hear the prayers of his people.<\/p>\n\n\n\n<p>We may think that God is cruel for setting limits on our lives. But imagine roads without traffic signals or a country without laws. How many of us are good at self governing?<\/p>\n\n\n\n<p>Finally, God is loving. But it would not be loving to let evil go on indefinitely. What counts as evil? It starts with having other gods besides the one true God, but includes disrespect for parents and wanting things that belong to someone else.<\/p>\n\n\n\n<p>I’ll end with this thought: “if my people, which are called by my name, shall humble themselves, and pray, and seek my face, and turn from their wicked ways; then will I hear from heaven, and will forgive their sin, and will heal their land.” — 2 Chronicles 7:14 (KJV)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Those who cannot remember the past are condemned to repeat it.” — George Santayana Is it true? If so, what is it that our past has to teach us? What, if anything, do days like National Pearl Harbor Remembrance Day, 9\/11 and Memorial Day have&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/is-it-true\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":226,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29],"tags":[8,5,3],"class_list":["post-225","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/225","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=225"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/225\/revisions"}],"predecessor-version":[{"id":227,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/225\/revisions\/227"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/226"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=225"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=225"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=225"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}