{"id":232,"date":"2022-12-08T18:40:30","date_gmt":"2022-12-08T18:40:30","guid":{"rendered":"https:\/\/llgt.cafe\/?p=232"},"modified":"2022-12-08T18:40:30","modified_gmt":"2022-12-08T18:40:30","slug":"free-educational-resources","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/free-educational-resources","title":{"rendered":"Free Educational Resources"},"content":{"rendered":"\n<p>There are so many resources when it comes to learning these days: in print, in person, audio and video, analog and digital. There are also many reasons for wanting to learn: from a fascination with a new and exciting subject to working for a promotion at your current job, to starting your own business. Below are some of the resources that you can use to learn just about anything you want to learn and, best of all, they are free.<\/p>\n\n\n\n<p>YouTube probably covers the greatest number of subjects. You can learn everything from astronomy, baking and gardening to everything you need to know to start your own podcast. You may have to watch a few videos, but they are short.<\/p>\n\n\n\n<p>One caution is that some of these videos, though free, are trying to sell you something. Videos that claim to have information that can make you a lot of money may give you some free information, and may go on and on about how knowledgeable they are, but you have to buy their course or book to get what you are really after.<\/p>\n\n\n\n<p>Another resource is iTunes U, which offers a number of subjects for different levels of learning, from middle school to top level colleges. There are fewer subjects offered in iTunes U, but it is still worth checking out.<\/p>\n\n\n\n<p>Podcasts can also be very helpful when it comes to learning different subjects, and you don’t need an Apple device to download podcasts. Podcasts also cover a number of topics, but may be limited to audio. Podcasts often feature one or more hosts, and at least one guest who is usually an expert in his or her field. You may find a few to hundreds of episodes on any podcast, and they range from just a few minutes to over an hour or two.<\/p>\n\n\n\n<p>Finally, perhaps saving the best for last, is your local library, which is filled with thousands of free resources that you can read or listen to or watch to study whatever subject that you want to. A problem with libraries is that many of them are closed to public access, so you may want to call to see if yours is open. Also, libraries offer limited hours. And depending on where you live, your library may either be huge or very small.<\/p>\n\n\n\n<p>I believe that, no matter our age, we should never stop learning. And thanks to the vast number of free educational resources, we never have to.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are so many resources when it comes to learning these days: in print, in person, audio and video, analog and digital. There are also many reasons for wanting to learn: from a fascination with a new and exciting subject to working for a promotion&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/free-educational-resources\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":233,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[3],"class_list":["post-232","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/232","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=232"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/232\/revisions"}],"predecessor-version":[{"id":234,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/232\/revisions\/234"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/233"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=232"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=232"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=232"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}