{"id":238,"date":"2022-12-10T18:04:54","date_gmt":"2022-12-10T18:04:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=238"},"modified":"2022-12-10T18:04:54","modified_gmt":"2022-12-10T18:04:54","slug":"getting-a-busy-signal","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/getting-a-busy-signal","title":{"rendered":"Getting a Busy Signal"},"content":{"rendered":"\n<p>Is it still true that we are all very busy? With trends working towards fewer people doing more, I thing that staying busy has moved beyond the point where it could be considered bragging to say that we were staying busy.<\/p>\n\n\n\n<p>But is there a cost to continually staying busy? The Bible says that God rested on the seventh day, and much of the Bible talks about how we should rest on one day and “keep it holy.” I’m not going to argue when we should take time to rest. For the Jews, it would be Friday at sunset to Saturday at sunset. For many Christians, it would be Sunday, but for some, it would be Saturday. And to keep something holy, that just means to set it aside for a special purpose.<\/p>\n\n\n\n<p>If we ignore this commandment, and we do have that option, and don’t take time to rest, we risk depleting our energy. We can go on for some time without taking time to rest and relax, but at some point our bodies will make us take that time, either though sickness or disease.<\/p>\n\n\n\n<p>The stress of continually staying busy can also effect us emotionally, either by the hormones that stress produces or by the lack of social interaction that comes along with not having any free time. We could be married and have children and still not have time to spend with those we love.<\/p>\n\n\n\n<p>Another way that being busy all the time can affect our health is through our diet. Having to eat out all of the time because there’s no time to cook, having to eat our meals too quickly because there’s no time to sit down to enjoy a meal, or having to microwave our food, which may destroy most of our food’s nutrients, because there’s no time to use conventional cooking methods can all have a negative impact on our health.<\/p>\n\n\n\n<p>One other possible side effect is that our relationships suffer. Our families suffer and our friendships suffer. Is it any wonder that depression continues to be a problem and that suicide rates continue to increase.<\/p>\n\n\n\n<p>It is truly an understatement to say that I think God knew what he was doing when he said that we should take one day a week to rest. There is one other point that I would like to bring up. For now, I am in a place where there are several people who are homeless. It’s not LA or San Francisco to be sure, but it is a problem. One might think that they sit around all day doing nothing, but I think that these people are in a 24\/7 fight for their lives, with no day of rest: battling the elements as well as other dangers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is it still true that we are all very busy? With trends working towards fewer people doing more, I thing that staying busy has moved beyond the point where it could be considered bragging to say that we were staying busy. But is there a&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/getting-a-busy-signal\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":239,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16,29],"tags":[3],"class_list":["post-238","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/238","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=238"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/238\/revisions"}],"predecessor-version":[{"id":240,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/238\/revisions\/240"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/239"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=238"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=238"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=238"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}