{"id":242,"date":"2022-12-11T20:37:19","date_gmt":"2022-12-11T20:37:19","guid":{"rendered":"https:\/\/llgt.cafe\/?p=242"},"modified":"2022-12-11T20:37:19","modified_gmt":"2022-12-11T20:37:19","slug":"keep-it-simple","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/keep-it-simple","title":{"rendered":"Keep it Simple"},"content":{"rendered":"\n<p>I believe that a relationship with God should be simple. it is, after all, something that even a child can understand. Unfortunately, there are many who try to complicate it by making it about themselves instead of about God. By making it about their own beliefs or their own actions, they turn their attention off of what God has already done to what they can do.<\/p>\n\n\n\n<p>When I became a Christina and made Jesus Lord of my life, it was because of two friends who shared with me a booklet called The Four Spiritual Laws. These laws teach us that God loves us, that we are separated from God by sin, a gap that we cannot overcome ourselves, that God sent Jesus to die and to pay for our sin, and that the only thing we must do is to receive the gift of eternal life by faith.<\/p>\n\n\n\n<p>Say that you don’t believe in the New Testament of the Bible. The old testament — the book of Isiah, for example — also points to Jesus as Messiah, Savior of the world. There really isn’t that much that you need to understand to trust in Jesus as Savior and make him Lord of your life.<\/p>\n\n\n\n<p>What does it mean to make Jesus Lord of your life? For me, it means that I am no longer in control of my life. It means that I put my trust in the one who created and who owns all things. ll doesn’t mean that I’m perfect or that I do everything right, but it takes my hope off of the things that I can accomplish and puts it on what Jesus was able to do at the cross and by raising from the dead.<\/p>\n\n\n\n<p>When we compare our own righteousness to the righteousness of God, it could be like comparing the mud pie of a two year old to a pie that your grandmother had made.<\/p>\n\n\n\n<p>God’s desire is that we set aside our old, broken toys and accept his best, by faith. It’s not something you can see; you just have to trust. The world, on the other hand, is constantly showing us it’s version of the best and telling us just what we need.<\/p>\n\n\n\n<p>God tells us not to worry about the food we will eat or the clothes that we will wear because he knows our needs and takes care of them for us. The world is constantly telling us that we won’t measure up, that we won’t be safe or accepted, unless we use their product, and it’s just a lie. Yet, with any lie, if you tell it enough, it will be accepted as truth.<\/p>\n\n\n\n<p>Faith really is very simple. God planned it that way. But we do have to do something with the faith that we are given. We can accept what God says, we can reject what God says, or we can choose not to decide, which is just another say of rejecting what God says. Romans 12:3 tells us that God has given each of us a measure of faith. It is up to us to decide what to do with it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I believe that a relationship with God should be simple. it is, after all, something that even a child can understand. Unfortunately, there are many who try to complicate it by making it about themselves instead of about God. By making it about their own&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/keep-it-simple\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":243,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[8,7,3],"class_list":["post-242","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/242","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=242"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/242\/revisions"}],"predecessor-version":[{"id":244,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/242\/revisions\/244"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/243"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=242"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=242"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=242"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}