{"id":252,"date":"2022-12-14T17:35:15","date_gmt":"2022-12-14T17:35:15","guid":{"rendered":"https:\/\/llgt.cafe\/?p=252"},"modified":"2022-12-14T17:35:15","modified_gmt":"2022-12-14T17:35:15","slug":"honestly","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/honestly","title":{"rendered":"Honestly"},"content":{"rendered":"\n<p>Can we be honest with our friends? Can our friends be honest with us? Can we be honest with ourselves?<\/p>\n\n\n\n<p>It’s not easy telling someone somewhat that may hurt his feelings. It’s certainly not easy being on the receiving end of bad news, or even to get negative feedback. And it can be just as hard to deliver it. When we get bad news, it’s up to us to decide what to process it and to decide what we will do with it.<\/p>\n\n\n\n<p>The problem is that, often, our feelings are involved. When I’m at work, it’s easier for me to accept when someone tells me that I’m doing something wrong, or that there’s a better way to do it. That other person may have done the same thing longer than I have, and I want to do the best I can at whatever it is that I’m doing. Outside of work, however, it may not be as easy to accept criticism.<\/p>\n\n\n\n<p>Perhaps part of the problem is that negative comments may be an indication that there is something that we need to change. Yet, we tend to resist change. It’s a lot easier to call the other person a big jerk and move on. Another option is to deny that the other person could be right. What makes things more difficult is that both parties may be incapable of seeing that they could be wrong.<\/p>\n\n\n\n<p>It’s not always clear who is right, or whose way is best. Yet, in order to build true friendship, there must be elements of honesty and trust: trust that the other person will be honest with you, and trust that their honesty isn’t meant to come at your expense.<\/p>\n\n\n\n<p>Of all the people we know, the one person it may be the hardest to be honest with may be ourselves. Like not being able to see the forest for the trees, we may become blind to our own faults, not seeing the things that we do that can be self-destructive.<\/p>\n\n\n\n<p>On top of all of this, none of us are capable of seeing or knowing everything. Consider Job, who, after suffering horrible loss, received poor advise from his wife and friends, being just as unaware of what was actually going on as job was.<\/p>\n\n\n\n<p>Perhaps the real question is can we count on our friends when things get tough? Can we turn to our friends when we don’t know where else to turn? Do we know each other well enough to know when something is wrong, even when nothing is said?<\/p>\n\n\n\n<p>It’s not always easy to know what we are supposed to do, and it’s even harder when our emotions are involved. But it sure is nice when we have a friend to turn to: someone to help us along the way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Can we be honest with our friends? Can our friends be honest with us? Can we be honest with ourselves? It’s not easy telling someone somewhat that may hurt his feelings. It’s certainly not easy being on the receiving end of bad news, or even&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/honestly\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":253,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,46,35,29],"tags":[3],"class_list":["post-252","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-friends","category-question","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/252","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=252"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/252\/revisions"}],"predecessor-version":[{"id":254,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/252\/revisions\/254"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/253"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=252"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=252"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=252"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}