{"id":255,"date":"2022-12-15T17:55:52","date_gmt":"2022-12-15T17:55:52","guid":{"rendered":"https:\/\/llgt.cafe\/?p=255"},"modified":"2022-12-15T17:56:43","modified_gmt":"2022-12-15T17:56:43","slug":"business-works","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/business-works","title":{"rendered":"Business Works"},"content":{"rendered":"\n<p>Type in “business” and do a search on Google, and you’ll come up with about 15,930,000,000 results.<\/p>\n\n\n\n<p>Business is a web of individuals including the person who turns a dream into reality, the people who help finance this dream, all of the suppliers who supply things from parts to packing materials, the workers who make products, the customers who buy these products, and all of the people who are affected by the use of this product. And it all just seems to work.<\/p>\n\n\n\n<p>It works for those who go after their dream. It works for those who know what they want and do what they love. It works for those who keep track of every little detail, and don’t let anything go unchecked.<\/p>\n\n\n\n<p>It works for those who build a name and a reputation along with a quality product. It works for those who build strong relationships with suppliers. It works for those who understand the needs of their customers and communicates with their customers how they stand out from the crowd.<\/p>\n\n\n\n<p>Business is about the business schools, those who try and fail, those who learn and teach others from what they learned, and those who jump on the story when a company fails, and those who are affected, whether a company succeeds or fails.<\/p>\n\n\n\n<p>Businesses affect works, families, investors, schools, churches, customers and other businesses. Businesses that work and grow bring money to a community: they bring life communities.&nbsp; Business that fail, steal, or fail to use resources properly take away from their communities.<\/p>\n\n\n\n<p>It works for countless businesses who are willing to make the changes necessary to stay around. It worked for Wells Fargo, who started out with the Pony Express. It worked for Coca-Cola who took advantage of the mistake of New Coke. It didn’t work for countless retail store, factories and online businesses who failed to adapt.<\/p>\n\n\n\n<p>Business works though cooperation, whether it employs one or thousands. Businesses are torn apart, not by competition, but by a failure to adapt. Their torn apart from within by those who start or spread rumors. They are torn apart by those who loose sight of the vision of why they are there to begin with.<\/p>\n\n\n\n<p>Perhaps, worse than a business that fails is a business that dies as a dream with the one who dreamed it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Type in “business” and do a search on Google, and you’ll come up with about 15,930,000,000 results. Business is a web of individuals including the person who turns a dream into reality, the people who help finance this dream, all of the suppliers who supply&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/business-works\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":256,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[3],"class_list":["post-255","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-business","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/255","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=255"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/255\/revisions"}],"predecessor-version":[{"id":258,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/255\/revisions\/258"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/256"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=255"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=255"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=255"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}