{"id":265,"date":"2022-12-18T19:01:14","date_gmt":"2022-12-18T19:01:14","guid":{"rendered":"https:\/\/llgt.cafe\/?p=265"},"modified":"2022-12-18T19:01:14","modified_gmt":"2022-12-18T19:01:14","slug":"have-you-tried-these-fruits","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/have-you-tried-these-fruits","title":{"rendered":"Have You Tried These Fruits?"},"content":{"rendered":"\n<p>Fruit can be a wonderful way to add variety to our lives and to our diets. They can add all sorts of flavor, a variety of nutrients, and may help with overall health, as long as there are no allergies.<\/p>\n\n\n\n<p>When it comes to types of fruits, they fall into seven major categories. And each of these categories contains several types of fruit. Below is a list of these categories, and some of the fruits that fall within each of these categories.<\/p>\n\n\n\n<p><strong>Apples and pears<\/strong><br>These fruits very in size, firmness, texture, sweetness and in use. They have a core in the middle and can be eaten cooked or raw. There are approximately 2,500 variety of apples grown in the united states, with only about 100 grown commercially, while there are as many as 7,500 varieties grown worldwide. Varieties of apples include: Breeze, Cripps Pink, Fuji, Golden Delicious, Honeycrip, Jazz, Kiku, Opal, Pacific Rose, Sugar Bee and Rose. Varieties of pear include: Anjou (red and green), Bartlett, Bosc, Concorde, Comice, Forelle, Seckel and Starkrimson.<\/p>\n\n\n\n<p><strong>Berries<\/strong><br>Berries are small and sweet to tart. They can be eaten raw, in jams or jellies. They can be eaten alone or in deserts, like muffins, pies or tarts. They can also be turned into juices and other beverages. Varieties of berries include the following: Acai, Barberry, Blackberry, Blueberry, Boysenberry, Chokeberry, Cloudberry, Cranberry, Currant, Dewberry, Elderberry, Mulberry, Goji Berry, Gooseberry, Huckleberry, Juneberry, Lingonberry, Raspberry, Salmonberry and Strawberry.<\/p>\n\n\n\n<p><strong>Citrus<\/strong><br>Citrus can be sweet to tangy or sour, and should be juicy. It can be eaten raw, in jams and jellies, dried or made into juices or other beverages. Varieties include: grapefruit, kumquat, lemon, lime, orange, mandarin, tangerine and satsuma.<\/p>\n\n\n\n<p><strong>Melons<\/strong><br>Melons often have a lot of seeds, often in the core of the fruit, though there are “seedless watermelons”. They are often juice and range from sweet to bitter. They are mostly eaten raw, alone or in salads. Varieties include: Autumn Sweet Melon, Bailan Melon, Bitter Melon, Canary Melon, Cantaloupe, Charentais Melon, Crenshaw Melon, Cucumber, Gac Melon, Galia Melon, Hami Melon, Honey Globe, Honeydew Melon, Horned Melon, Kantola Melon, Korean Melon, Sugar Melon,Watermelon and Winter Melon.<\/p>\n\n\n\n<p><strong>Stone fruit<\/strong><br>Stone fruits range from sweet to tart, and can be eaten raw, in pies, dried, or in jams or jellies. Varies include the following: apricot, cherry, nectarine, peach and plum.<\/p>\n\n\n\n<p>Tomatoes and avocados<br>Tomatoes range from sweet to tart and come in a wide variety. They can be eaten right out of their “shell,” or peeled and pitted. They can be eaten raw, in salads, on sandwiches, on burgers, in different forms in soups, or as a sauce. There are also a variety of salads, and they can be eaten raw, or in salads, as dips, or on sandwiches.<\/p>\n\n\n\n<p><strong>Tropical and exotic<\/strong><br>These fruits may be sweet and or sour. Many of them are high in antioxidants. They are probably considered exotic because they don’t grow in the United States. Some of them may seem strange looking, particularly if they are unfamiliar, and many of them look prickly. They can be eaten raw, and many at leas some of them can be made into a juice. These fruits include the following: Ackee, Buddha’s Hand, Carambola, Chom Chom, Durian, Kiwano, Noni Fruit, Pitaya, Rambutan, Urucu and Yangmei.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Fruit can be a wonderful way to add variety to our lives and to our diets. They can add all sorts of flavor, a variety of nutrients, and may help with overall health, as long as there are no allergies. When it comes to types&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/have-you-tried-these-fruits\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":266,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,43,27,16,39],"tags":[3],"class_list":["post-265","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-food","category-fun-facts","category-health","category-ideas","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/265","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=265"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/265\/revisions"}],"predecessor-version":[{"id":267,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/265\/revisions\/267"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/266"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=265"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=265"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=265"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}