{"id":269,"date":"2022-12-19T16:32:05","date_gmt":"2022-12-19T16:32:05","guid":{"rendered":"https:\/\/llgt.cafe\/?p=269"},"modified":"2022-12-19T16:32:05","modified_gmt":"2022-12-19T16:32:05","slug":"is-passion-enough","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/is-passion-enough","title":{"rendered":"Is Passion Enough?"},"content":{"rendered":"\n<p>Is it possible to follow your passion? Could we all just leave the grind of the 9 to 5, or whatever schedule we work, to just do what we love, and be able to make a living at it? Perhaps. It all depends on us, because there is no one answer.<\/p>\n\n\n\n<p>One person’s passion may be nature. Could that person make a living as a wildlife photographer? How about a biologist, or a science teacher at a local high school?<\/p>\n\n\n\n<p>Another person may have a passion for video games. Could that person be one of the bloggers who writes about a particular video game or creates unique video content on YouTube? Could that person even create new and exciting games that others might play?<\/p>\n\n\n\n<p>Still, another person wants to be a stay at home mom, raising her children, who are her passion. Could that person be the next Martha Stewart? Could she create her own successful online business so that she could stay home?<\/p>\n\n\n\n<p>I believe the answer to each of these questions could be “Yes”. But it depends on the person who is seeking his or her passion and, to some extent, the amount of support he or she has from others.<\/p>\n\n\n\n<p>Passion is a great thing. It can get us excited and get us started. Yet, it’s determination that will keep us going after the passion has worn off. It may be our own determination, and it may be the determination that someone else offers to us, either in the form kind words, or a verbal kick in the back side.<\/p>\n\n\n\n<p>Passion may give us the energy to get out of bed, but it’s determination that won’t let us stop when things become difficult. It’s determination that helps us find the unconventional answer to our problem, and it’s determination that helps us answer our most formidable critics (even if we are our own harshest critic).<\/p>\n\n\n\n<p>Determination could be confused with stubbornness. Being stubborn is more like Einstein’s definition of insanity, dong the same thing over and over, expecting a different result. Determination, however, knows when it’s time to let go of a particular path and try a new one.<\/p>\n\n\n\n<p>There are some who know from an early age what they are and are not called to do. The may battle incredible odds to get where they believe they are supposed to be. Yet, I suspect there are times along the way when even they have doubts. It can take a lot of determination to get us from point A to point B, and even more if we are unclear just where point B is.<\/p>\n\n\n\n<p>It’s great to have passion. Yet, as some point, we need to be realistic. The thing that we are passionate about, it may remain a hobby for us. It may even be something that we can do as volunteer work. Or, we may just find a way, not only to make a living, but live the live that we want to live.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is it possible to follow your passion? Could we all just leave the grind of the 9 to 5, or whatever schedule we work, to just do what we love, and be able to make a living at it? Perhaps. It all depends on us,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/is-passion-enough\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":270,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,28,15,25,41,35,29],"tags":[3],"class_list":["post-269","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-creativity","category-emotional","category-faith","category-family","category-question","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/269","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=269"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/269\/revisions"}],"predecessor-version":[{"id":271,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/269\/revisions\/271"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/270"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=269"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=269"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=269"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}