{"id":27,"date":"2022-10-27T15:34:54","date_gmt":"2022-10-27T15:34:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=27"},"modified":"2022-10-27T15:34:54","modified_gmt":"2022-10-27T15:34:54","slug":"my-story","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/my-story","title":{"rendered":"My Story"},"content":{"rendered":"\n<p>Hi, my name is Ralph, and I’m owner of LLGT. I would like to tell you a little about myself. I was born in Fayetteville, Arkansas — the youngest of five — the same place I now call home.<\/p>\n\n\n\n<p>So much has happened over the past fifty-six plus years. So much has changed. Fayetteville has gone from from less than twenty thousand people to having a population of nearly 100,000. Much of what I remember, growing up, no longer exists.<\/p>\n\n\n\n<p>No doubt the most important event in my life came when, at the age of 14, I was introduced to the Lord Jesus. At the time, all I really knew about was the baby Jesus, and he fit in there somewhere with Santa. It was then that I learned that I was a sinner (which seemed pretty obvious) but that God had sent his son to die for my sins.<\/p>\n\n\n\n<p>“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:16 (KJV)<\/p>\n\n\n\n<p>In the more than 42 years since then, I’ve had the opportunity to see the many, many different beliefs that others have and, though my faith is still being shaped, I believe that my eternity is secured.<\/p>\n\n\n\n<p>In my lifetime, I have wanted to be many things, from a cartoonist to an inventor, a writer, a photojournalist, an entrepreneur and much more. So far, I’ve been a photographer (part time and mostly ammeter), a cook, a writer, a sales associate and, most recently, assembler and manufacturer.<\/p>\n\n\n\n<p>God has allowed me to travel parts of this world and to photograph wherever I have been. But more important than the pictures that I’ve taken are the people that I’ve met along the way, and the friendships that I’ve built.<\/p>\n\n\n\n<p>When we surrender our lives to God, when he becomes part of our lives and his Holy Spirit indwells us, he changes us. We are brought from death to life, our relationship with the living God is restored, and God restores our sight.<br>.<br>“One thing I know, that, whereas I was blind, now I see.” — John 9:25<\/p>\n\n\n\n<p>Over the years, I have faced many of life’s hardships with the Lord a my side. My mother died in 1987. My wife, Sandy, died in March 2012, of cancer, after less than seven weeks of marriage. And parts of my life have been more stressful than it seemed I could bear. But Jesus has always been by my side.<\/p>\n\n\n\n<p>I’m still learning and still growing as a person and in my faith in Jesus. I still have a long way to go. I don’t know exactly what my future hold, but I know who holds my future. For now, I live one day at a time, and I look for every opportunity to love and serve others. When I look at my own life, I see so many imperfections. But I believe that, when God sees me, what he has is the same love that he has for his own son.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Hi, my name is Ralph, and I’m owner of LLGT. I would like to tell you a little about myself. I was born in Fayetteville, Arkansas — the youngest of five — the same place I now call home. So much has happened over the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/my-story\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":28,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[8,7,3,6],"class_list":["post-27","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-uncategorized","tag-god","tag-jesus","tag-llgt","tag-my-story"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/27","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=27"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/27\/revisions"}],"predecessor-version":[{"id":29,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/27\/revisions\/29"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/28"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=27"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=27"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=27"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}