{"id":275,"date":"2022-12-21T17:39:50","date_gmt":"2022-12-21T17:39:50","guid":{"rendered":"https:\/\/llgt.cafe\/?p=275"},"modified":"2022-12-21T17:39:50","modified_gmt":"2022-12-21T17:39:50","slug":"roadblocks-to-learning","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/roadblocks-to-learning","title":{"rendered":"Roadblocks to Learning"},"content":{"rendered":"\n<p>There is so much that we have available to us in the way of educational resources. Unfortunately, there are a few things that can stop us along the way. Yet, even if we come across a road block, there are things that might help us move forward.<\/p>\n\n\n\n<p><strong>Distractions<\/strong><br>Distractions are one of the main things that can keep us from learning. It could be the TV, the computer, your phone with it’s social media, or something else. It could be something that you enjoy doing, like playing video games, or it could be keeping up on the latest and worst news of the day.<\/p>\n\n\n\n<p>In this case, it’s important to remember matters most. It’s easy to do the things that are easy or that we enjoy doing. If learning is important to you, you will need to make a conscious effort to spend time learning, or even practicing a particular skill. Put it on your calendar, or schedule it at the same time every day\/week. If it’s a new habit, start small, and make sure you reward yourself for your accomplishment.<\/p>\n\n\n\n<p><strong>Time Lag<\/strong><br>Some times we don’t learn as well as we ought because there may be a lag between the time that we do something and when we see the results of that action. This is likely why the saying that those who fail to learn from their past are doomed to repeat it is so true. Many things in this life and, in the world in general, occur in cycle. Unfortunately, it can be hard to see these cycle, and even harder to see the correlation between one thing, or one even, and another.<\/p>\n\n\n\n<p>Journaling may help, at least with shorter cycles: weeks, days, months and maybe even year long cycles. Unfortunately, life and history can fall into 80, 100, and even 1,000 year cycles, and these can be much harder to follow.<\/p>\n\n\n\n<p><strong>Schooling<\/strong><br>Some times the very study of something can hinder our leaning and growing in that area. Often, I found, those who graduate from cooking school, often have the hardest time finding a job in food service. One might have such high hopes when entering cooking school. It’s easy to think that, because you’ve spent so much time and money on your education that you deserve to be paid more. Unfortunately, an education may just the foundation for learning.<\/p>\n\n\n\n<p>One solution is to realize that you don’t know everything. Stay eager to continue learning and practicing whatever it is that you are doing. Learning without practicing is of little use. Practicing without learning will only get you so far.<\/p>\n\n\n\n<p><strong>Fear of Failure<\/strong><br>It’s true, learning something new often involves failing. Depending on how you were brought up, failure can either be a really bad thing, something to be avoided at all cost, or just a normal part of the learning process. Failure is something that can either propel you forward, or stop you in your tracks.<\/p>\n\n\n\n<p>It’s important to realize that we all make mistakes or fail in one way or another. But the more we work at something, the better we will get at it, and the fewer mistakes we will make. The important thins is that, when we do fail or make a mistake, that we learn something from it. Rather than torturing ourselves, we can turn it into something positive.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is so much that we have available to us in the way of educational resources. Unfortunately, there are a few things that can stop us along the way. Yet, even if we come across a road block, there are things that might help us&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/roadblocks-to-learning\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":276,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[36,3],"class_list":["post-275","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-learning","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/275","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=275"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/275\/revisions"}],"predecessor-version":[{"id":277,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/275\/revisions\/277"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/276"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=275"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=275"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=275"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}