{"id":278,"date":"2022-12-22T22:38:06","date_gmt":"2022-12-22T22:38:06","guid":{"rendered":"https:\/\/llgt.cafe\/?p=278"},"modified":"2022-12-22T22:38:06","modified_gmt":"2022-12-22T22:38:06","slug":"an-action-word","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/an-action-word","title":{"rendered":"An Action Word"},"content":{"rendered":"\n<p>First Corinthians 13 tells of the value and the importance of love. It seems that no matter what we do, no matter what we are able to achieve, if we don’t have love, we are nothing. This chapter also goes on to say what love does and does not do.<\/p>\n\n\n\n<p>What it doesn’t say directly is that love is an action word. Love requires interaction. This may mean spending time with someone, calling them on the phone, or sending a letter or email. Also, if we see a someone in need we should do something to help.<\/p>\n\n\n\n<p>Luke 10:25-37 tells a story of a man who was robbed and beaten on his journey from Jerusalem to Jericho, “leaving him half dead.”<\/p>\n\n\n\n<p>“And by chance there came down a certain priest that way: and when he saw him, he passed by on the other side.And likewise a Levite, when he was at the place, came and looked on him, and passed by on the other side.But a certain Samaritan, as he journeyed, came where he was: and when he saw him, he had compassion on him.” — Luke 10: 31-33 (KJV)<\/p>\n\n\n\n<p>Now the Samaritans were considered by the Jews to be half breads and the Jews and Samaritans rarely had any interactions with each other. But, having compassion on the man, the Samaritan took care of him, bandaging him up and paid for his stay in a room where he could recover.<\/p>\n\n\n\n<p>Perhaps we feel overwhelmed by our own needs, or we feel helpless when it comes to all the needs that we see. Maybe we are too busy looking for distractions that keep us from seeing the needs of others, when some times the greatest need may just be to have someone to spend time with.<\/p>\n\n\n\n<p>Yet, the time we spend with others, and the things that we do for others is only half of the picture; we also need to spend time with God. We need some sort of group worship, and we need to spend time alone with God, in prayer and reading his word.<\/p>\n\n\n\n<p>God created us, and only God knows how we out to live our lives. Not only does spending time with God help us to grow, but it also blesses us.<\/p>\n\n\n\n<p>“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. — John 3:16 (KJV)<\/p>\n\n\n\n<p>By placing our faith in the completed work of Jesus on the cross, we can have a relationship with the living God, and eternal life. But it shouldn’t end with a one time prayer. Our relationship with God needs to continue, and it needs to grow.<\/p>\n\n\n\n<p>Love may be a feeling, but it is also an action word. It is not something that we can keep to ourselves. God is love. Go, take God’s love and share it wherever you can.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>First Corinthians 13 tells of the value and the importance of love. It seems that no matter what we do, no matter what we are able to achieve, if we don’t have love, we are nothing. This chapter also goes on to say what love&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/an-action-word\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":279,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,47,14],"tags":[33,8,7,5,3],"class_list":["post-278","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-relational","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/278","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=278"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/278\/revisions"}],"predecessor-version":[{"id":280,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/278\/revisions\/280"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/279"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=278"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=278"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=278"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}