{"id":281,"date":"2022-12-23T19:37:55","date_gmt":"2022-12-23T19:37:55","guid":{"rendered":"https:\/\/llgt.cafe\/?p=281"},"modified":"2022-12-23T19:37:55","modified_gmt":"2022-12-23T19:37:55","slug":"what-i-fear-most","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-i-fear-most","title":{"rendered":"What I Fear Most"},"content":{"rendered":"\n<p>It’s not easy to figure out what I fear most. Snakes and grizzly bear probably top that list. I cannot say that I feel a fear of missing out because I think I’ve been there and done that. I feel no need to do the other things. Jumping out of an airplane and standing on the edge of a thousand foot cliff don’t interest me.<\/p>\n\n\n\n<p>I used to have this feeling — something I would imagine — that a grizzly bear would come up from behind, as I got ready for bed, tap me on the shoulder and say, “Excuse me.” No, it never happened, thankfully. That kind of thing only happens in cartoons.<\/p>\n\n\n\n<p>One of my friends in Idaho was an uncle and guardian to some wonderful children. They could scare me, running behind moving vehicles or towards busy highways.<\/p>\n\n\n\n<p>Having other people watch me as I try to work — like when I was in cooking school — used to scare me. But I think I’ve gotten used to it, maybe.<\/p>\n\n\n\n<p>I rented a movie. And, for me, it’s been very difficult to watch. It doesn’t show a shark attack (sharks are on my list, too) or zombies. It has a widow, a house cleaner from London, who just wants to buy a dress. It may have a happy ending, but I can only seem to watch about 15 minutes at a time.<\/p>\n\n\n\n<p>I’ve felt some emotions in the past. Love is great, but I can remember feeling great sorrow as well. I’ve been hopeful, but I’ve also known confusion, uncertainty and, perhaps, depression. But I’ve survived them all.<\/p>\n\n\n\n<p>Now, having survived something doesn’t mean that I don’t fear it. Often, I’ve had a feeling that something that I really wanted wasn’t going to work out. Usually, these fears are unfounded. And I’ve learned that God really is in charge of this world. If God doesn&#8217;t allow something, it’s most likely because it’s not good for me: that it&#8217;s not part of God’s plan for my life. I may not understand, but I don’t have to. I just have to trust.<\/p>\n\n\n\n<p>Oh, I still have fears: hurting someone that I love tops that list. I still struggle with certain emotions. That’s why I tend to stick to watching cartoons: ones that are 20 minutes or less are great. The ones that can put me to sleep in under 5 minutes are better.<\/p>\n\n\n\n<p>First John 4:18 (KJV) tells us, “There is no fear in love; but perfect love casteth out fear: because fear hath torment. He that feareth is not made perfect in love.”<\/p>\n\n\n\n<p>Yes, I still have fears — mostly in areas of my life where my faith is still weak. But I try to focus on what I know, that God loves me and that His plans are good.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s not easy to figure out what I fear most. Snakes and grizzly bear probably top that list. I cannot say that I feel a fear of missing out because I think I’ve been there and done that. I feel no need to do the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-i-fear-most\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":282,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14],"tags":[8,5,3],"class_list":["post-281","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/281","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=281"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/281\/revisions"}],"predecessor-version":[{"id":283,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/281\/revisions\/283"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/282"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=281"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=281"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=281"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}