{"id":287,"date":"2022-12-25T17:52:51","date_gmt":"2022-12-25T17:52:51","guid":{"rendered":"https:\/\/llgt.cafe\/?p=287"},"modified":"2022-12-25T17:52:51","modified_gmt":"2022-12-25T17:52:51","slug":"merry-christmas","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/merry-christmas","title":{"rendered":"Merry Christmas"},"content":{"rendered":"\n<p>It doesn’t matter whether or not Jesus was born in December. I doubt that he was. And he wasn’t visited by three kings as songs might suggest. We know more about Jesus’ early life though the movies, songs and tradition than can actually be verified in the Bible.<\/p>\n\n\n\n<p>We actually know more about Jesus’ last three years. There are more details of Jesus’ birth and crucifixion in the Old Testament than in the New. Luke 2:1-14 (KJV) tells us this:<\/p>\n\n\n\n<p>&#8220;<strong>And it came to pass in those days, that there went out a decree from Caesar Augustus that all the world should be taxed.<br>(And this taxing was first made when Cyrenius was governor of Syria.)<br>And all went to be taxed, every one into his own city.<br>And Joseph also went up from Galilee, out of the city of Nazareth, into Judaea, unto the city of David, which is called Bethlehem; (because he was of the house and lineage of David:)<br>To be taxed with Mary his espoused wife, being great with child.<br>And so it was, that, while they were there, the days were accomplished that she should be delivered.<br>And she brought forth her firstborn son, and wrapped him in swaddling clothes, and laid him in a manger; because there was no room for them in the inn.<br>And there were in the same country shepherds abiding in the field, keeping watch over their flock by night.<br>And, lo, the angel of the Lord came upon them, and the glory of the Lord shone round about them: and they were sore afraid.<br>And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people.<br>For unto you is born this day in the city of David a Saviour, which is Christ the Lord.<br>And this shall be a sign unto you; Ye shall find the babe wrapped in swaddling clothes, lying in a manger.<br>And suddenly there was with the angel a multitude of the heavenly host praising God, and saying,<br>Glory to God in the highest, and on earth peace, good will toward men.<br>Luke 17: 7 tells us that there is greater rejoicing in Heaven for one who repents, more than 99 who don’t need to repent. What is repentance. It is a change of mind: to go from unbelief to belief in the work of Jesus on the cross. It’s his death, burial and resurrection — his blood — that has the power to redeem us from sin.<\/strong>&#8220;<\/p>\n\n\n\n<p><br>I hope that you and your family have a safe, merry Christmas. I hope you know God’s love. If you’re still trying to earn your way to Heaven, you can ask God to forgive you and he will — because of what Jesus, the Son of God, did, and is still doing. The one who was and is and is to come really does love us more than we can understand.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It doesn’t matter whether or not Jesus was born in December. I doubt that he was. And he wasn’t visited by three kings as songs might suggest. We know more about Jesus’ early life though the movies, songs and tradition than can actually be verified&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/merry-christmas\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":288,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,24,14],"tags":[33,8,7,5,3],"class_list":["post-287","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-holidays","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/287","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=287"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/287\/revisions"}],"predecessor-version":[{"id":289,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/287\/revisions\/289"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/288"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=287"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=287"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=287"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}