{"id":290,"date":"2022-12-26T20:27:01","date_gmt":"2022-12-26T20:27:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=290"},"modified":"2022-12-26T20:27:01","modified_gmt":"2022-12-26T20:27:01","slug":"spiritual-goals-for-the-new-year","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/spiritual-goals-for-the-new-year","title":{"rendered":"Spiritual Goals for the New Year"},"content":{"rendered":"\n<p>How often do you think about the spiritual part of your life? Is it something that you do every day, is it something that is limited to one or maybe two days a week, or is it something that happens, at most, once or twice a year?<br>Our spiritual life is one place where we can set goals. Whether we want to get closer to God, to know more about Him, or we are just trying to figure out life, there are things we can do to build or faith or our understanding of who God is and what He wants for us.<\/p>\n\n\n\n<p>I don’t claim to know everything about every religion, or even to know everything about the Bible, but having been a follower of Jesus for nearly 40 years, I’ve picked up a few things. Below are a few things that might help you in the New Year.<\/p>\n\n\n\n<p>First, we can read God’s Word, the Bible. In the Bible, it tells about the how God created man (male and female), and place them in the Garden of Eden. It tells how man sinned, but how God sent his son, Jesus, to redeem creation by dying on the cross. It tells how Jesus rose from the dead, defeating sin and death, to sit at the right hand of God the Father.<\/p>\n\n\n\n<p>While there are many other teachings that talk about how one may have eternal life, these books teach that it is my own goodness, my own works that will get me into heaven. The Bible, though it could be argued, teaches that it is by God’s work, and not anything that I could do, the he offers salvation, through faith in Jesus.<\/p>\n\n\n\n<p>A good place to start reading the Bible might be the Gospel of John. There are countless Bible studies available, as well as one year Bible’s, and one of these might be a good way of studying, and becoming with, the Bible. There are also audio Bible’s (my personal favorite), as well as online resources.<\/p>\n\n\n\n<p>Second, we could make it a goal to find a church, or other group of people that we can study the Bible with. A good, healthy church, should be based on the Word of God and have sold teaching. God’s Word is powerful, and it has the ability to change lives. Unfortunately, it seems that there are churches that either teach that we are saved by our own works, or own good deeds, or by following certain rules, rather than by the blood of Jesus. And there are other churches that won’t even mention a need for a savior, but will only tell us how to be “good” people.<\/p>\n\n\n\n<p>Third, we can set a goal to spend more time in prayer. We can set a certain time, or a certain place to stop and pray. We can keep a prayer list, a list of people and needs, even wants, that we can prayer for. We can also keep a journal, listing our prayers and any answers to prayers. We may even leave the wants and needs behind and use this as a time to be tankful for what we already have, or we may just use this time to worship the living God. It’s our choice.<\/p>\n\n\n\n<p>Some people plan to share their faith with others through the year. Sharing our faith isn’t meant to be a sort of pounding others over the head with our understanding of the truth. Nor is it something that we should do out of obligation. It is something that we should do out of our love for others, because we care where they spend eternity.<\/p>\n\n\n\n<p>One other thing we can plan is we can plan to give to the church. It’s in our finances, our giving to the church, that we show what is important to us. It not only shows us where our faith is, but it helps us build our faith, because everything we have really belongs to God, anyway. I’ll admit, I fail in this area far too often, but I do enjoy it when I am able to give back and help build the church.<\/p>\n\n\n\n<p>For me, my spiritual life is deeply personal. But that shouldn’t keep me from talking about it with others. I know I can never force my beliefs on others, nor would I ever want to. There are religions that will force their beliefs on others, but that’s not who I am. For me, it’s more about a relationship with the living God than about anything that I may or may not do. It’s because God so loved the world, so live me, that I can love Him. And it’s through a growing knowledge of God’s love that I can love others.n<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How often do you think about the spiritual part of your life? Is it something that you do every day, is it something that is limited to one or maybe two days a week, or is it something that happens, at most, once or twice&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/spiritual-goals-for-the-new-year\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":291,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[24,35,14,29],"tags":[33,3],"class_list":["post-290","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-holidays","category-question","category-spiritual","category-think-about-it","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/290","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=290"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/290\/revisions"}],"predecessor-version":[{"id":292,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/290\/revisions\/292"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/291"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=290"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=290"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=290"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}