{"id":293,"date":"2022-12-27T08:53:20","date_gmt":"2022-12-27T08:53:20","guid":{"rendered":"https:\/\/llgt.cafe\/?p=293"},"modified":"2022-12-27T08:53:20","modified_gmt":"2022-12-27T08:53:20","slug":"financial-goals-for-the-new-year","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/financial-goals-for-the-new-year","title":{"rendered":"Financial Goals for the New Year"},"content":{"rendered":"\n<p>One area where we can set goals for the New Year is in the area of finances. We can follow the SMART (specific, measurable, achievable, relevant, and timed) method of setting goals and, while the measurable part of it may come easy, the others may be a little harder.<\/p>\n\n\n\n<p>This is because circumstances can change. Wages can go up or down, cost of living can change, things happen that we can’t predict. But even the unknown should’t keep us from setting goals when it comes to our finances.<\/p>\n\n\n\n<p>One goal that should be top of the list, if it isn’t already, is having an emergency fund. This ranges from $1,000 to three months living expenses. This one is so important because it can help with achieving any other financial goal, like getting out of debt, or saving to buy a new car.<\/p>\n\n\n\n<p>Another goal that everyone should consider, if you haven’t already, is creating a livable budget. And even if you have one, it might be a good time to review it. There are several budget styles to choose from, whether it be based on dollar amounts, or on percentages. And whether you pay yourself first, or set aside a certain percentage, there should be some money that goes to the future you.<\/p>\n\n\n\n<p><strong>Below are other examples of the financial goals you can set for next year.<br>Save %10 of each pay check to put into savings or other investments.<br>Save $300 each month to put towards a new car.<br>Find at least one area where I can invest my money.<br>Find a financial\/tax advisor.<br>Add one extra stream of income.<br>Consider where you might be able to give money away, and how much.<br>Pay down debts, or even pay them off.<br>Save for a large purchase.<br>Save for a vacation.<br>Start saving for next Christmas.<br>Put money aside for your own education or for that of your children.<br>Start your own business, or set aside money to use while you get you business up and running.<\/strong><\/p>\n\n\n\n<p>Having a financial plan, and reviewing it regularly can help reduce stress in your life as well as in the lives of your family. In addition, writing down your goals will greatly increase your chances of reaching them.<\/p>\n\n\n\n<p>Though, you may not want to share your financial goals with others, you may want to have someone you trust check on you from time to time, to make sure you are making progress toward your goals.<\/p>\n\n\n\n<p>Remember, when it comes to investments and finances in general, there are risks. One piece of advise that I can offer is that, before you invest in anything, or trust anyone with your money, do your homework.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One area where we can set goals for the New Year is in the area of finances. We can follow the SMART (specific, measurable, achievable, relevant, and timed) method of setting goals and, while the measurable part of it may come easy, the others may&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/financial-goals-for-the-new-year\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":294,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38],"tags":[20,3],"class_list":["post-293","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-money","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/293","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=293"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/293\/revisions"}],"predecessor-version":[{"id":295,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/293\/revisions\/295"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/294"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=293"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=293"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}