{"id":297,"date":"2022-12-28T10:48:53","date_gmt":"2022-12-28T10:48:53","guid":{"rendered":"https:\/\/llgt.cafe\/?p=297"},"modified":"2022-12-28T10:48:53","modified_gmt":"2022-12-28T10:48:53","slug":"career-goals-for-the-new-year","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/career-goals-for-the-new-year","title":{"rendered":"Career Goals for the New Year"},"content":{"rendered":"\n<p>With 2023 just days away, there’s still time to set career goals for the New Year. One way to get started is to take a piece of paper and just start brainstorming. Take two or three minutes and just write down everything that comes to mind. Write down everything that you might like to do, career-wise, in the next year.<\/p>\n\n\n\n<p>Once you have a list, run it through the SMART filter. Goals should be specific, measurable, achievable, relevant, and timed. (The words used with this acronym can very depending on the needs of the specific goal.)<\/p>\n\n\n\n<p>Specific: goals should not be too broad.<br>Measurable: there should be a way to measure progress or to know if a goal has been met.<br>Achievable: goals should be within reach. You may want to pick something that stretches your abilities, but not something that is out of reach.<br>Relevant: this should be something that fits into your overall goals and lifestyle.<br>Timed: this can be one day, one month, or one year. If it’s a long term goal, something that will take longer than a year, it may be something you start doing within a certain time frame. The amount of time given to any goal should be reasonable, but not so long that you delay setting other goals that could be set.<\/p>\n\n\n\n<p><strong>Below are some examples of goals that follow the SMART goal setting method.<br>Within one month, I will begin taking online classes in computer programming.<br>Within one month, I will begin looking for a new job, and I will have a new job within three months<br>Within six months, I will increase my earnings by 5%.<br>Within three months, I will open my landscaping business.<br>Within two months, I will find a mentor to help be become a better (fill in the blank).<\/strong><\/p>\n\n\n\n<p>Examples of career related goals include becoming more productive, more proactive, more effective, better educated, or making more money. We can set a goal to gain a new skill, find a place to intern, move up in our existing job or look to change career fields. We can also decide that it’s time to start our own business.<\/p>\n\n\n\n<p>Whatever our goal is, it’s best to write it out. If we have several goals that we want to work on, it would be a good idea to prioritize them, and work on just one or two at a time. Putting our goals on paper can help us make sure that they are following the SMART (or some other) method, and can serve as a reminder of what we intend to do, helping to keep us on track.<\/p>\n\n\n\n<p>For larger goals, consider breaking it down into daily or weekly goals. And consider rewarding yourself when goals are completed.<\/p>\n\n\n\n<p>There are some who say that we should share our goals with others, while there is evidence that sharing our goals can reduce the chance that we will actually complete them. If you decide to share your goals with someone else, make sure that it is someone who will encourage you, or can at least hold you accountable.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With 2023 just days away, there’s still time to set career goals for the New Year. One way to get started is to take a piece of paper and just start brainstorming. Take two or three minutes and just write down everything that comes to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/career-goals-for-the-new-year\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":298,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,24,39],"tags":[3],"class_list":["post-297","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-holidays","category-ideas","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/297","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=297"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/297\/revisions"}],"predecessor-version":[{"id":299,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/297\/revisions\/299"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/298"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=297"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=297"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=297"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}