{"id":300,"date":"2022-12-29T11:09:35","date_gmt":"2022-12-29T11:09:35","guid":{"rendered":"https:\/\/llgt.cafe\/?p=300"},"modified":"2022-12-29T11:09:35","modified_gmt":"2022-12-29T11:09:35","slug":"fitness-goals-for-the-new-year","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/fitness-goals-for-the-new-year","title":{"rendered":"Fitness Goals for the New Year"},"content":{"rendered":"\n<p>Physical goals often top one’s list of New Year’s resolutions. And when it comes to our health and the goals that we set, there are a number of options to choose from.<\/p>\n\n\n\n<p>Now, I’m not going to say that we are going to start exercising because it is something that we will enjoy doing, though there are those who truly enjoy a morning run. Personally, I prefer a more leisurely walk, with plenty of time to stop and take pictures along the way. But running and walking are not the only options to choose from.<\/p>\n\n\n\n<p>First, we can choose from a goal based on a certain physical activity, a change in our diet, or one targeted at a possible result of either. For example, we could set a goal ride a bicycle at least 10 miles a week. We could decide we are going to walk or swim at least three times a week. We could decide that we will lift weights five days a week. We could also decide that we want to loose 10 pounds in the next year.<\/p>\n\n\n\n<p>In setting our goals, we may need to meet with a health professional, or find a weight trainer, depending on our own unique needs. We may join a gym, or find a group of people whom we can meet with, who will join us in whatever we choose to do, and encourage us along the way. It may take some planning to get us to where we can do the thing that we set to do. In other words, we may not be able to decide that on the first day of the year, we are going to throw on our running shoes and start running and that, in doing so, we will still be running on a regular basis at the end of the year.<\/p>\n\n\n\n<p>Physical goals should still meet the SMART goal setting method, meaning they should be<br>specific, measurable, achievable, relevant, and timed. Yet, it is likely that we will also need outside help with this goal — either a professional of some sort, or just one or more people who can encourage us along the way — helping us to keep going when we want to quit.<\/p>\n\n\n\n<p>We will also need a strong enough “Why” when it comes to any goal of this sort, whether it be to exercise more, loose weight, or try a new diet. Because changes in these areas often don’t come easily, and we naturally resist such changes, we need to know why we are attempting to make these changes. It should be a reason that we believe strongly in, and it should be for us, and not for someone else.<\/p>\n\n\n\n<p>One final consideration is that, if we are setting our goal based on a result that we hope to see, it could take time to reach that goal. Therefore, it may help to break larger goals into smaller goal. For example, instead of setting a goal to loose 10 pound over the next year, we may decide that we will aim at loosing one pound a month.<\/p>\n\n\n\n<p>And whichever goal we set, it’s a good idea to find some way to reward ourselves along the way, as long as it doesn’t go against our goal. Occasionally rewards can help encourage us, and help keep us going month after month.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Physical goals often top one’s list of New Year’s resolutions. And when it comes to our health and the goals that we set, there are a number of options to choose from. Now, I’m not going to say that we are going to start exercising&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/fitness-goals-for-the-new-year\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":301,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[48],"tags":[49,22,3],"class_list":["post-300","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fitness","tag-fitness","tag-health","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/300","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=300"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/300\/revisions"}],"predecessor-version":[{"id":302,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/300\/revisions\/302"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/301"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=300"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=300"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=300"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}