{"id":306,"date":"2022-12-31T14:12:43","date_gmt":"2022-12-31T14:12:43","guid":{"rendered":"https:\/\/llgt.cafe\/?p=306"},"modified":"2022-12-31T14:12:43","modified_gmt":"2022-12-31T14:12:43","slug":"relationship-goals-for-the-new-year","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/relationship-goals-for-the-new-year","title":{"rendered":"Relationship Goals for the New Year"},"content":{"rendered":"\n<p>Perhaps, the relationships that we build, those friends we find or those who move away, make planning in this area more difficult than in other areas of our lives. Yet there are things that we can do to open up the possibility of making new friends, and there are things that we can do to straighten the bonds that we already have.<\/p>\n\n\n\n<p>There are clubs that we can join, meetings that we can attend. There are Facebook groups that we can join, and dating sights that we can sign up for. There are many ways that we can use to meet new people. It’s not a question of whether or not we can find a way to meet new people but, given our own personality, and our own wants, will we make a conscious effort to start new relationship?<\/p>\n\n\n\n<p>And just as we can put an effort to find new friends, we can put time and energy into keeping the friendships that we already have. With all the things that we have going on, this may be one of the hardest goals to set. Even if we can have a set time to meet with friends, schedules change: things change.<\/p>\n\n\n\n<p>Aside from looking for groups to join, or ways that we can meet with old friends, there are other goals we can set. We can make it a goal to work on our own communication skills, with books like “The 5 Love Languages,” by Gary Chapman. There are so many books on relationships to choose from.<\/p>\n\n\n\n<p>We can study the art of listening, really listening, and plan to put it into practice. We can figure out what questions we need to be asking ourselves and others. We can ask ourselves if we are the kind of person that others might want to call friend.<\/p>\n\n\n\n<p>Whatever we do, whatever we plan, we can never predict the final outcome, but we can try to figure out what we want and aim in that direction. We can also look at where we are going and make course changes. Setting goals for the New Year should just be the beginning. One objective for setting any goal should be to review both the goal and any progress.<\/p>\n\n\n\n<p>Whatever you choose to do, whatever you hope to do, or dream of doing, I hope the best for you. May God bless you and your family. Let us know what you think. As always, thanks for sharing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Perhaps, the relationships that we build, those friends we find or those who move away, make planning in this area more difficult than in other areas of our lives. Yet there are things that we can do to open up the possibility of making new&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/relationship-goals-for-the-new-year\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":307,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,46,39,47,29,45],"tags":[3],"class_list":["post-306","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-friends","category-ideas","category-relational","category-think-about-it","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/306","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=306"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/306\/revisions"}],"predecessor-version":[{"id":308,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/306\/revisions\/308"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/307"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=306"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=306"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=306"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}