{"id":316,"date":"2023-01-03T16:00:33","date_gmt":"2023-01-03T16:00:33","guid":{"rendered":"https:\/\/llgt.cafe\/?p=316"},"modified":"2023-01-03T16:00:33","modified_gmt":"2023-01-03T16:00:33","slug":"tools-for-lifes-journey","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/tools-for-lifes-journey","title":{"rendered":"Tools for Life&#8217;s Journey"},"content":{"rendered":"\n<p>It can be easy to just cruise though life without purpose and without direction. Yet, there are some things that we can take a closer look at that, though they do not guarantee our success, can help us get to where we one day hope to be.<\/p>\n\n\n\n<p><strong>Memories<\/strong><br>Memories can shape our lives in many ways. Post Traumatic Stress Disorder (PTSD) can make life very difficult, while positive memories can help us. Yet, growing up in a perfect environment is no guarantee of a happy life at any point in the future, because we have the ability to choose what we focus on in both the past and in the present.<\/p>\n\n\n\n<p>One quote I remember best is “I’m third.” It means that, whenever I’m faced with a choice to put my needs or the needs of another first, I’ll put the needs of others first, even if it costs me my life. Jesus did this when he willing went to the cross so that you and I might have eternal life.<\/p>\n\n\n\n<p>Memories can come from any of the five senses, or from a lack of one of them. When I travel somewhere new, I collect information to figure out what I call “the flavor” of an area. Memories can be the things that we hear and see. But in order for a memory to have lasting impact, it has to be emotionally charged or seen\/heard repeatedly.<\/p>\n\n\n\n<p><strong>Purpose and Identity<\/strong><br>Do you know your purpose? Since I became a follower of Jesus, my purpose has been to become more like Jesus. I don’t do this alone, but with the help of the Holy Spirit.<\/p>\n\n\n\n<p>We usually have just one purpose, but we can have multiple identities. We may be a parent, child, sibling, work in a certain filed, student, teacher and so on. And our identity can change with time. Also, we may choose our identity or it may be assigned to us by circumstances, family or friends.<\/p>\n\n\n\n<p>It may help to write down both your purpose and the roles you see yourself in. Choose your purples carefully. It, too, may change over time, but take time to think about it.<\/p>\n\n\n\n<p><strong>Daily Routine<\/strong><br>I find it helps to write down the things that I want to do every day, at lest the things that I want to remember to do every day. I don’t need to, for example, need to remind myself to check my email or Instagram.<\/p>\n\n\n\n<p>Posting to LLGT has become part of my daily routine. It’s on my list of things to do, but I can remember to do this without looking at my list. Wiring is important to me and part of my emotional health. You may find that a morning jog is what you most look forward to, while I see anything faster than a leisurely walk as a form of self torture.<\/p>\n\n\n\n<p>If you want to create a list of daily to-dos, you have complete control over what you put on that list. If there is something that you don’t think you can do, put it anyway. Where there is a will, there is a way. And it never hurts to ask for help if we need it.<\/p>\n\n\n\n<p><strong>Input and Output<\/strong><br>I cannot control what I did yesterday — the things that I heard, saw, said or did — and I cannot control tomorrow, but I can control what I do right now. I can control what I think about, what I listen to and what I put in front of me. I can choose whether I speak or listen, and I can choose how I interpret the information that I take in.<\/p>\n\n\n\n<p>We have at least some control over the input in our lives: what we listen to, the entertainment we choose and the people we spend time with either affect or lives in a positive or a negative way. And they can affect us without us even realizing it.<\/p>\n\n\n\n<p>The best part is that we can choose how we interpret the events of our lives. And we don’t have to stick with the old lens that we used to see the world through. We can, if we choose, decide that we will find our own rose colored glasses.<\/p>\n\n\n\n<p>I had a professor tell me that I couldn’t write. Dr. James Dobson had a similar story. The important thing to remember is that “You can’t do (fill in the blank) is only someone’s evaluation given present circumstances and does not have to have an impact on our present or on our future.<\/p>\n\n\n\n<p><strong>Take Inventory<\/strong><br>Who am I? How do I see myself, now and in the future? Where do I see myself in <em>_<\/em> years? Who are the people in my life? What skills do I have? What skills am I willing to learn? What am I willing to do, and what am I willing to give up in order to get to where I want to be?<\/p>\n\n\n\n<p>These are just some of the questions that we can ask ourselves. Unfortunately, it’s not likely that anyone else is going to ask us the most important questions. And, if you are like me, you may not be aware that we should, at some point our lives, be asking ourselves these questions.<\/p>\n\n\n\n<p>I had some friends offer me financial advise when I was younger. It would have been great advise, had I taken it. Unfortunately, it was only offered as advise. I had to find the “why” that would help me to make this advise a part of my life. And I still struggle with finding a balance between saving for and investing in my future.<\/p>\n\n\n\n<p>You, alone, know what you have. You may not yet realize how your choice of friends and how you spend your time may affect your life tomorrow, but it is something to think about.<\/p>\n\n\n\n<p><strong>Start Small<\/strong><br>I’m starting to learn that I don’t have to begin the year with a New Year’s resolution to read for an hour, to do 100 pushups or to write 10-20 pages per day. I can commit to doing 1 pushup, to walk, even if it’s to the refrigerator, or to journal, though I may just write a few words. The thing is that I don’t have to go big or go home. I can start small and, over time, I will build a habit.<\/p>\n\n\n\n<p>Personally, I don’t want to wake up at 6 in the morning and head out the door for a run. When I get out of bed, one of the first things I do is to turn on the electric kettle to make a cup of coffee: instant coffee, liquid stevia, hot water and lots of milk.<\/p>\n\n\n\n<p>The best part is that you get to choose what habits you want to build. You get to decide the what and the when and whether or not you will adapt to the wants and needs of others.<\/p>\n\n\n\n<p><strong>Start Today<\/strong><br>Decide what you want. Find the resources you need and begin working on your team: those who are willing and able to help you get to where you want to go. Also, you may find yourself on someone else’s team, helping her get to where she wants to go.<\/p>\n\n\n\n<p>Why start today? Because today is the only time you can actually do anything. You may regret yesterday and you may dream about tomorrow, but you can only take action today: right her and right now.<\/p>\n\n\n\n<p>It’s up to you — it’s up to me — to say “stop this roller coaster” and to decide were we hope to go with our lives. Others may help us along the way, but there’s no guarantee that anyone will. Perhaps, growing up, we have a good example of how we should live. Yet, that doesn’t mean that we will make the right choices in our lives.<\/p>\n\n\n\n<p>Take this quote from the movie <em>Kung Fu Panda<\/em>, “Yesterday is history, tomorrow is a mystery, but today is a gift. That is why it is called the present.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It can be easy to just cruise though life without purpose and without direction. Yet, there are some things that we can take a closer look at that, though they do not guarantee our success, can help us get to where we one day hope&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/tools-for-lifes-journey\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":317,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29,45],"tags":[7,3],"class_list":["post-316","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","category-tips","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/316","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=316"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/316\/revisions"}],"predecessor-version":[{"id":318,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/316\/revisions\/318"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/317"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=316"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=316"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=316"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}