{"id":319,"date":"2023-01-04T18:46:44","date_gmt":"2023-01-04T18:46:44","guid":{"rendered":"https:\/\/llgt.cafe\/?p=319"},"modified":"2023-01-04T18:46:44","modified_gmt":"2023-01-04T18:46:44","slug":"building-a-financial-toolkit","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/building-a-financial-toolkit","title":{"rendered":"Building a Financial Toolkit"},"content":{"rendered":"\n<p>When it comes to our finances, there are four things that most determine how well we will do. And, though unexpected events can have a temporary impact on our finances, how well we do these four things will have a much greater impact over time.<\/p>\n\n\n\n<p><strong>Thinking<\/strong><br>The first is our thoughts. What do we think about money and the things that money can buy? Do we see money as the root of all evil? Do we think that there’s never enough? Do we resent people who seem to have so much money that they could never spend it all?<\/p>\n\n\n\n<p>Our thoughts about money will determine to a large extent how we use our money, as well as if or how we invest. Warren Buffet, a multi billionaire, sees money as something that is hard to get, but even harder to replace. If for example, you loose a dollar today, it may take a $1.20 to replace it tomorrow.<\/p>\n\n\n\n<p>Credit cards, car loans and student loans have taught us to spend money that we will not earn until well into the future, drastically cutting into our finances and our ability to invest in our future. Living with debt is like living with a handicap, and to get out of debt, we first must change our thoughts about debt.<\/p>\n\n\n\n<p><strong>Planning<\/strong><br>Our ability to plan, as well as how well we stick to our plan can also have a major impact on our finances. It’s been said that a failure to plan is to plan for failure. Creating a budget is just the beginning. In order to properly plan, we have to know what our short and long term goals are, we have to set deadlines, and we much know that these goals are realistic.<\/p>\n\n\n\n<p>If we know that we want to save for a new car, it should be easier to say no to those daily $4 cups of coffee. If we know that we need an emergency fund, and we have a plan to set aside the money by a given time, and we include it in our budget, saving the money will be much easier.<\/p>\n\n\n\n<p>Budgeting means no only planning how we will spend our money, but also how we will save and invest our money. It means giving priority to our needs, and putting our wants on a waiting list. It also means knowing where your money is going, and looking at places where we can make cuts. Planning isn’t always easy but, in the long run, it is well worth it.<\/p>\n\n\n\n<p><strong>Habits<\/strong><br>We may not realize the impact our habits can have on our finances because our habits can be things that we do without even realizing it. Tithing, giving to your local church or to some other organization, can become a habit, but so can gambling. Spending money on entertainment can become a habit, but so can finding free resources, such as borrowing movies from the library.<\/p>\n\n\n\n<p>Perhaps the best thing we can do when we find ourselves spending is to ask ourselves if there is another way. If you need or want a cup of coffee each morning, can you find a way to make it at home for less money than it costs to buy it on the way to work? Maybe you will need to wake up a few minutes early to have time to make your own coffee, and maybe you will need to buy the things that it will take to make that perfect cup of coffee. Maybe you will decide that the extra effort isn’t worth it, but perhaps you can find a cheaper cup of coffee that is just as good.<\/p>\n\n\n\n<p>A good habit to get into is to keep track of what you spend. You can write it down when you buy something, or you can take pictures of your receipts. Make it a habit to look for the best price on items that you are buying. Remember to start in the bargain section and check out thrift stores. Also, make it a habit to plan purchases ahead of time, looking for things like clothing or gifts when they are going on clearance.<\/p>\n\n\n\n<p><strong>Self control<\/strong><br>Finally, if we are going to make any of this work, we must have self control. We must have self control over our thoughts, our planning and our habits. It takes self control to do all of the things that we need to do and to avoid the things that we need to avoid. If we lack self control, it is likely, over time, to affect nearly every area of our lives.<\/p>\n\n\n\n<p>It’s not enough to decide that we want to eliminate a habit from our lives, we need to replace it with something else. If we merely eliminate a habit, we are likely to create a void and, if we don’t fill it with something else, that old habit may just creep back in to our lives.<\/p>\n\n\n\n<p>Self control could mean doing the things that we need to do to reach our goals, but it cold also mean avoiding the things that keep us from our goals. It’s not often the big events that have a greater impact on our finances, but the little things that we do or fail to do every day that have the greatest impact.<\/p>\n\n\n\n<p>We can make a difference in our finances. We can change our thoughts, we can begin to plan, changing our habits and work on our self control. If you don’t do it for yourself, someone else will.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When it comes to our finances, there are four things that most determine how well we will do. And, though unexpected events can have a temporary impact on our finances, how well we do these four things will have a much greater impact over time.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/building-a-financial-toolkit\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":320,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38],"tags":[3],"class_list":["post-319","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-money","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/319","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=319"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/319\/revisions"}],"predecessor-version":[{"id":321,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/319\/revisions\/321"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/320"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=319"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=319"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=319"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}