{"id":326,"date":"2023-01-06T18:00:54","date_gmt":"2023-01-06T18:00:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=326"},"modified":"2023-01-06T18:00:54","modified_gmt":"2023-01-06T18:00:54","slug":"dream-jobs","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/dream-jobs","title":{"rendered":"Dream Jobs"},"content":{"rendered":"\n<p>There are at a few careers that still exist only in the imaginations of children and story tellers — at least, as far as we know. But what if, and which would you chose?<\/p>\n\n\n\n<p>Time traveler<br>If you could go back in time or forward in time, which would you choose? If you could travel back in time, you could try to fix some of the mistakes that you have made in the past. But then you might not have learned some of the lessons that you learned along the way.<\/p>\n\n\n\n<p>You could go back and invest in some of the things that have made others into millionaires, like Bitcoin or Google. Or you could travel back in time with the winning lottery numbers.<\/p>\n\n\n\n<p>You might travel way back in time to explore worlds that no longer exist, with animals that are long extinct, or visit the Greek or Roman empires. You might even run into someone like Moses, or King David.<\/p>\n\n\n\n<p>Maybe you are curious to see what the future holds. You could see if things get better or worse, if we are more technologically advanced, or if we go back to things like horse and carriage. You might travel into the future and land yourself in an Amish community and think that all of the world is like that, when the rest of the world could be traveling around in hove crafts.<\/p>\n\n\n\n<p>Intergalactic traveler<br>What if, instead of time travel, you could travel to other worlds. Think of the photo album that you could put together. Once you visited Mars, Jupiter and Saturn, where would you want to go next?<\/p>\n\n\n\n<p>Other questions might need to be answered, like how you might travel. Would you travel in a ship, or would you use some technology to transport from one place to another? You could replicate your brain in a computer and send it out into the vast universe, but it wouldn’t be the same as going, yourself.<\/p>\n\n\n\n<p>Superhero<br>Superheroes don’t get to choose their power, but they get to do some pretty amazing things, from flying around the world in minutes and without having to pass though airport security to rescuing people in parolees danger.<\/p>\n\n\n\n<p>Like most of the rest of us, superheroes have to keep their personal lives separate from their work lives. And their true friends tend to be more limited, while there seems to be no limit to the number of enemies they can have.<\/p>\n\n\n\n<p>And, superheroes don’t make a salary. They don’t rely on the kindness of strangers; they just seem to make it, somehow. And at least one superhero lives very well. And the best part is that, in the end, they always win.<\/p>\n\n\n\n<p>There are other things that you could do. Maybe you could become invisible. Some may feel like they’ve already achieved this. Perhaps you could become a giant: twelve foot, twenty foot, or even a hundred foot tall. Or you might want to be so small that you could drive around in a vehicle the size of a Hot Wheels car.  <\/p>\n\n\n\n<p>We may not have superpowers, but we all have the power to help others: to help make other&#8217;s day just a little better.   A simple smile or a warm welcome can go further than we realize.  And, best of all, it doesn&#8217;t cost anything.  <\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are at a few careers that still exist only in the imaginations of children and story tellers — at least, as far as we know. But what if, and which would you chose? Time travelerIf you could go back in time or forward in&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/dream-jobs\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":327,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44],"tags":[3],"class_list":["post-326","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/326","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=326"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/326\/revisions"}],"predecessor-version":[{"id":328,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/326\/revisions\/328"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/327"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=326"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=326"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=326"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}