{"id":329,"date":"2023-01-07T18:01:03","date_gmt":"2023-01-07T18:01:03","guid":{"rendered":"https:\/\/llgt.cafe\/?p=329"},"modified":"2023-01-07T18:01:03","modified_gmt":"2023-01-07T18:01:03","slug":"lessons-from-proverbs-2","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/lessons-from-proverbs-2","title":{"rendered":"Lessons from Proverbs"},"content":{"rendered":"\n<p>According to the book of Proverbs, there are at least eight things that we need to learn and, if we have children, we need to teach them. These things, when applied to our lives, can not only help us stay out of trouble, but can help us live happy and successful lives.<\/p>\n\n\n\n<p><strong>Fear God<\/strong><br>Proverbs 9:10 (KJV) says, “The fear of the Lord is the beginning of wisdom: and the knowledge of the holy is understanding.” It’s one thing to fear our parents or some other authority in our lives, but quite another to fear a God who sees all. More importantly, God is able to judge not only our actions, but our thoughts.<\/p>\n\n\n\n<p><strong>Guard your mind<\/strong><br>Proverbs 4:23 tells us the importance of guarding our mind. We may not take action on all of our thoughts, but all of our actions do begin with a thought. Some times these thoughts can become so instilled in our minds that they become unconscious habits. Good or bad, these habits can be very difficult to break.<\/p>\n\n\n\n<p><strong>Obey your parents<\/strong><br>Whether we grow up in a traditional family or not, we all have someone that we answer to: an older sibling, a spouse, a boss, or customers. The issue is that, if we think we know everything, it is going to be hard to learn anything. And, again, it’s an issue of accountability. If we aren’t accountable to anyone for our actions, we are less likely to do what is right.<\/p>\n\n\n\n<p><strong>Choose your friends carefully<\/strong><br>One thing that I learned in the military was that I should do the right thing even when others were not. Likewise, we should not always follow the mob mentality, doing things just because everyone else is doing it.<\/p>\n\n\n\n<p>It’s said that we are the sum of our three closest friends. That means if our friends are high income earners, we are more likely to be earning more money. It’s no guarantee, but it is something to keep in mind.<\/p>\n\n\n\n<p><strong>Watch your language<\/strong><br>This not only includes avoiding certain four letter words, but also some of the other words that we might use. Do our words tell ourselves and others that we can do certain things, or do they imply that they are too hard, somehow out of our reach. And are we thankful for what we have or do we spend all of our time complaining.<\/p>\n\n\n\n<p><strong>Practice self control<\/strong><br>This could be self control in our diet, our spending, our organizational skills, or just about anything. Self control is likely to show up in all areas of our life, as is a lack of self control.<\/p>\n\n\n\n<p><strong>Learn to work hard<\/strong><br>It’s said that if you do what you love, you will never work a day in your life. This may be true, but that doesn’t mean that those who do what they love don’t put in long hours, or have to do things that they may not like doing. It does mean that you can be counted on to complete a job, and to do it right. It means that you are not only a self starter, but are able to complete certain tasks without constant supervision.<\/p>\n\n\n\n<p><strong>Learn to manage your money<\/strong><br>Money is one of the major topics of the Bible, as it is mentioned more than 800 times. Our money is a tool that can make us more of what we already are, or can act as a reflection of who we are. it is, however, a poor master, so it is important that we learn to master our money skills.<\/p>\n\n\n\n<p>One more thing: no matter how well we practice any of these things, we can always improve.  Growth is a process.  It doesn&#8217;t happen overnight.  Also, applying these eight things to your life does not guarantee that you won’t have any troubles in this life, but it can help reduce some of the problems that could have been avoided. Yes, we can learn from our own mistakes, and we can learn from the mistakes of others, but it’s nice to know that there are things that we can learn without having to learn the hard way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to the book of Proverbs, there are at least eight things that we need to learn and, if we have children, we need to teach them. These things, when applied to our lives, can not only help us stay out of trouble, but can&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/lessons-from-proverbs-2\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":330,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[51,14,29],"tags":[33,3],"class_list":["post-329","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-personal-growth","category-spiritual","category-think-about-it","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/329","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=329"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/329\/revisions"}],"predecessor-version":[{"id":331,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/329\/revisions\/331"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/330"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=329"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=329"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=329"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}