{"id":332,"date":"2023-01-08T18:56:31","date_gmt":"2023-01-08T18:56:31","guid":{"rendered":"https:\/\/llgt.cafe\/?p=332"},"modified":"2023-01-08T18:56:31","modified_gmt":"2023-01-08T18:56:31","slug":"the-value-of-time","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-value-of-time","title":{"rendered":"The Value of Time"},"content":{"rendered":"\n<p>Most likely, you&#8217;ve herd the saying, “Time equals money.” And though we can trade our time for money, we can never buy more time. Money may give us the ability to buy the thins that we want and need, but time can give us the freedom to enjoy or lives.<\/p>\n\n\n\n<p>As with many things, during these times, we have options. And while many options are being taken away, there are some choices that can never be taken away. One thing that can never, or should never be taken away is our ability to think.<\/p>\n\n\n\n<p>Unfortunately, it’s all too easy to leave the decision of what to think and how to think to others: friends, relatives, local and national media as well as our local, state and federal government. Even the church can try to tell us how to think, and that’s not always a good thing.<\/p>\n\n\n\n<p>Now, many of us are stuck at home, nowhere to go except for maybe a quick trip to the store. Though we look forward to all of this coming to an end and, hopefully, returning to some sense of normality, perhaps we should look at this time as some sort of gift.<\/p>\n\n\n\n<p>It’s not a well defined gift, like a book or a gift card for your favorite restaurant. It’s more like a cash gift, where your options are much more open. Given $100, you could buy months worth of chocolate, alcohol to numb your mind, or a weeks worth of frozen pizza. You could give it away, to a friend, or some sort of charity. You could also invest this money, hoping to turn it into more money for your future.<\/p>\n\n\n\n<p>Like this gift, our time has value, and it is up to us to decide what to do with it. But no matter what we do with our time, whether we waste it, give it away, or invest it into our future, we can never get it back. This time we have, we will never have, again.<\/p>\n\n\n\n<p>It’s up to us to decide how we will use this time. We can just try to get by, one day at a time. We can use this time to let our fears and worries grow. Or we can use this time to seek after God, the one who has given us the time that we have on this earth.<\/p>\n\n\n\n<p>Some times, I write or type out my prayers. If you want to start praying but are sure how to start, you could begin with this: “God, if you are real, let me know.” You could pray, “God, forgive me. I know that I am a sinner. Thank you for sending your Son to die on a cross so that I might have life.” It could be something like, “Thank you God for this time that I can spend alone with you. Help me to use this time wisely, that it might be a blessing for me and for others.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most likely, you&#8217;ve herd the saying, “Time equals money.” And though we can trade our time for money, we can never buy more time. Money may give us the ability to buy the thins that we want and need, but time can give us the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-value-of-time\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":333,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[14,29],"tags":[8,7,3],"class_list":["post-332","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-spiritual","category-think-about-it","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/332","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=332"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/332\/revisions"}],"predecessor-version":[{"id":334,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/332\/revisions\/334"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/333"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=332"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=332"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=332"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}