{"id":335,"date":"2023-01-09T16:23:58","date_gmt":"2023-01-09T16:23:58","guid":{"rendered":"https:\/\/llgt.cafe\/?p=335"},"modified":"2023-01-09T16:23:58","modified_gmt":"2023-01-09T16:23:58","slug":"art-appreciation","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/art-appreciation","title":{"rendered":"Art Appreciation"},"content":{"rendered":"\n<p>However you express your creative self, there is one thing that you should realize, if you have not already: not everyone is going to like, appreciate, or feel the same way about your work as you do.<\/p>\n\n\n\n<p>This is true whether you draw, paint, sculpt, take pictures, write, cook, or do anything else that takes an element of creativity. Any time you do something that is “different”, there is likely to be someone who doesn’t like it. Even if it’s just that you are happy doing what you like, or that you are successful at what you do, there will be someone who points out what you are doing it all wrong, or that they don’t like.<\/p>\n\n\n\n<p>There are also going to be people who just don’t understand what you are trying to do. it wouldn’t be hard for me to find someone who is obsessed with some of the latest video games, but to find someone who understands my passion for taking pictures or for camera gear, that is a challenge. For most, it beyond their comprehension that I could spend time posting or looking at other people’s pictures in Instagram. They cannot imagine spending $500 or more on a camera or lens.<\/p>\n\n\n\n<p>When it comes to cooking, I’ve learned that, if I cook for more than one person, there is a good chance that there will be something that someone doesn’t like. I can eat just about anything. But when it comes to the music that I choose to listen to, I am very particular.<\/p>\n\n\n\n<p>The reality is that we should do whatever it is that we do because we enjoy doing something. If it’s writing, then write, if it’s drawing, then draw. It would be nice if everyone liked and praised you for your works of art, but it may not happen, and that’s okay. As long as you’re not breaking any laws, doing anything immoral or hurting anyone, and it’s something that you enjoy, then keep going; don’t quit just because someone else doesn’t understand or appreciate your work.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>However you express your creative self, there is one thing that you should realize, if you have not already: not everyone is going to like, appreciate, or feel the same way about your work as you do. This is true whether you draw, paint, sculpt,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/art-appreciation\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":336,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[3],"class_list":["post-335","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/335","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=335"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/335\/revisions"}],"predecessor-version":[{"id":337,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/335\/revisions\/337"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/336"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=335"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=335"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=335"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}