{"id":338,"date":"2023-01-10T17:22:51","date_gmt":"2023-01-10T17:22:51","guid":{"rendered":"https:\/\/llgt.cafe\/?p=338"},"modified":"2023-01-10T17:22:51","modified_gmt":"2023-01-10T17:22:51","slug":"my-heroes","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/my-heroes","title":{"rendered":"My Heroes"},"content":{"rendered":"\n<p>I probably began cooking when I was in junior high school, when I took a class in home economics. According to my brother, it was something I just did, something that he wasn’t allowed to do, and he saw this as something that gave me an advantage when it came to being able to cook. When I went into the Air Force, I wanted to do something that I would enjoy doing, but also something that I could use when I finished my military service.<\/p>\n\n\n\n<p>Most of my jobs have been in food service. About twenty years ago, I went to culinary school. It gave me a stronger foundation and, with more practice, I’ve become an even better cook. I don’t consider myself to be a chef. At one time, I was in charge of a kitchen, a food kitchen once a week, but these days, I don’t work in food service. I’m not in charge of a kitchen.<\/p>\n\n\n\n<p>I enjoy cooking now and then, but enjoy a well cooked burger from Woofie’s of Spokane, or a piece of pizza from Rocky Rococo just as much. If I prefer my own cooking, it is because I know that it is probably healthier than I can get from dining out, and I can prepare that hamburger exactly the way I like it. Just today, I ordered a burger in a drive through. When I got home, it seems that the person who cooked the burger ignored my instructions and made the burger the way that he wanted it.<\/p>\n\n\n\n<p>I am well familiar with many of the best known chefs: Thomas Keller, Gordon Ramsey, and Paul Perdone just to name a few, but I’ve never really had any chefs as a hero. My heroes have almost always been photographers.<\/p>\n\n\n\n<p>I remember my dad taking pictures with his medium format film camera. I don’t remember what kind it was, but it had an accordion style lens, and it was possible to accidentally double expose the film. I remember cutting my dad’s negatives, trying to help, and finding out that your don’t cut out individual frames unless it’s slide film, and the frames are going to be mounted.<\/p>\n\n\n\n<p>I remember watching slide shows at my dad’s work: probably biology related, as my dad has a masters in biology and worked for the US Fish and Wildlife Service. I remember my sister getting her first camera, a 35mm camera of some sort with a 50mm lens. Later, my mom took an art photography class at the University of Arkansas, and that’s when I started taking pictures.<\/p>\n\n\n\n<p>My hears were mostly photojournalists, and I had hopes of getting into photojournalism. I tried for one job, but was too young, and wasn’t able to drive. I did have several pictures published while in high school and college, and did some work for the local newspaper, but couldn’t get hired on because my photographic style wasn’t what they were looking for.<\/p>\n\n\n\n<p>When I went into the military, I wasn’t able to get in as a photographer, so I chose food service. I’ve photographed at least half a dozen weddings over the years, but did most of the weddings for free. I was paid for one wedding with some well used camera gear, which I later sold on eBay.<\/p>\n\n\n\n<p>My heroes<br>There are a few masters of photography that most people are aware of: Ansel Adams is one of them. Perhaps lesser know, Henri Cartier-Bresson is another. These were pioneers in photography who took, not only some of the best photographs, but captured some images of the first images of their kind.<\/p>\n\n\n\n<p>Ernst Haas<br>Ernst Haas (March 2, 1921 – September 12, 1986) was one of my first heroes. An Austrian-American, Haas bridged the gap between photojournalism and the use of photography as a medium for expression and creativity. In addition to his coverage of events around the globe after World War II, Haas was an early innovator in color photography. Haas’ work appeared in magazines like “Life” and “Vogue” and, his own book, The Creation (1971) was one of the most successful photography books ever, selling 350,000 copies.<\/p>\n\n\n\n<p>Dorothea Lang<br>Dorothea Lange (May 26, 1895 – October 11, 1965) is another hero of mine. An American documentary photographer and photojournalist, she was best known for her depression-era work for the Farm Security Administration. Lange&#8217;s photographs not only helped change government policies, but helped bring help to some of those most in need.<\/p>\n\n\n\n<p>David Burnett<br>David Burnett (born 1946) is an American magazine photojournalist based in Washington, D.C. I first saw his work in a copy of American Photographer and though his work has had some critics, to me, his images are works of art. Burnett uses a number of cameras to capture his images, but some of his most notable work has been done with a large format Speed Graphic with a 178mm f\/2.5 Aero-Ektar lens, along with what is considered by many to be a toy camera, a Holga 120mm film camera. Brunett’s use of these cameras may help him and his work to stand out from the crowd. But it is his skill as a photographer and his willingness to try something different are what truly make him stand out as a photographer.<\/p>\n\n\n\n<p>We can learn a lot from our heroes, from their work to their style. Ultimately, we each build our own style. Don’t be afraid to try new things. Who knows, you may be a pioneer.  In small ways, we can help make this world a better place.  You may be someone’s hero.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I probably began cooking when I was in junior high school, when I took a class in home economics. According to my brother, it was something I just did, something that he wasn’t allowed to do, and he saw this as something that gave me&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/my-heroes\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":339,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[3],"class_list":["post-338","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/338","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=338"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/338\/revisions"}],"predecessor-version":[{"id":340,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/338\/revisions\/340"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/339"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=338"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=338"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=338"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}