{"id":344,"date":"2023-01-12T17:17:46","date_gmt":"2023-01-12T17:17:46","guid":{"rendered":"https:\/\/llgt.cafe\/?p=344"},"modified":"2023-01-12T17:17:46","modified_gmt":"2023-01-12T17:17:46","slug":"filling-the-void","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/filling-the-void","title":{"rendered":"Filling the Void"},"content":{"rendered":"\n<p>I don’t know about you, but for the time being, it really does seem like I have everything that I need. And though I may not have everything that I would like to have, all of my basic needs are being met.<\/p>\n\n\n\n<p>Yet, it seems that more and more, things are being taken away. And, unfortunately, many people around the world cannot say that all of their basic needs, such as food, shelter, and safety, are being met.<\/p>\n\n\n\n<p>While some of the things that people need are being taken away by armed conflict, other things have been taken away by earthquake and famine. While there seems to be an increase in the number of earthquakes, there are also huge swarms of locusts devastating crops around the world.<\/p>\n\n\n\n<p>Around the world, our freedoms have been taken away, and we have been asked, or even demanded to surrender these freedoms in the name of health and safety. Mostly, we have been asked to surrender our rights to move about freely and our right to worship in group settings. Protests are okay, but we cannot get together to praise the living God.<\/p>\n\n\n\n<p>All of this taking away is creating a void in the lives of many of the people around the world. While the most immediate need for some may be some of the basic needs of life, others are likely to see needs in their spiritual lives, and in their need to spend time with others.<\/p>\n\n\n\n<p>We can spend our time just trying to survive, we can spend our time trying to thrive, and we can spend our time just trying to keep ourselves entertained. Yet, if we fail to seek after the true and living God, we will still find our lives lacking.<\/p>\n\n\n\n<p>You may disagree with me, and you are certainly welcome to do so, but I believe in the God of the Bible. I believe that God, not billions of years of chance, created this world, and that we were created for a purpose: fellowship with God.<\/p>\n\n\n\n<p>I believe that sin entered through the world, creating a break in the fellowship that man (men and women) had with God, but that, though Jesus’ death, burial and resurrection, God has provided a way for to restore that fellowship. It is God’s gift, and all we have to do is receive it by faith; there is nothing that I can do, no matter how hard I try, to earn eternal life.<\/p>\n\n\n\n<p>Along with everything else, a lack of fellowship creates a void in our lives. I can try to fill this void with other things, but these things won’t last. Eventually, these things will rust or rot. Only God is eternal.<\/p>\n\n\n\n<p>God never promises a world without troubles. In fact, Jesus says that in this world we will have many problems. Jesus continues to say, <strong>“…but be of good cheer; I have overcome the world.” —John 16:33 (KJV)<\/strong><\/p>\n\n\n\n<p>So, as you find more and more things being taken away, ask yourself how you are going to fill the void. If you start with God, he promises that he will take care of the other needs. If you start with the needs, all you are ever likely to have is needs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I don’t know about you, but for the time being, it really does seem like I have everything that I need. And though I may not have everything that I would like to have, all of my basic needs are being met. Yet, it seems&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/filling-the-void\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":345,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14],"tags":[33,5,3],"class_list":["post-344","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","tag-bible","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/344","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=344"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/344\/revisions"}],"predecessor-version":[{"id":346,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/344\/revisions\/346"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/345"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=344"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=344"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=344"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}