{"id":352,"date":"2023-01-14T18:54:34","date_gmt":"2023-01-14T18:54:34","guid":{"rendered":"https:\/\/llgt.cafe\/?p=352"},"modified":"2023-01-14T18:54:34","modified_gmt":"2023-01-14T18:54:34","slug":"how-much-is-enough","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/how-much-is-enough","title":{"rendered":"How Much is Enough?"},"content":{"rendered":"\n<p>The things that we have, and the money that we have, is it enough? Are we happy with what we have, or are we always wanting just a little more? While the world is filled with people that have so little, there are are few that have so much. And no matter where we lie in that spectrum, it’s easy to think that all we need is a little more.<\/p>\n\n\n\n<p>We enter this life with nothing, and we will leave this life with nothing. And whether we come into this world as part of a family that is wealthy or a family that is poor, everything that we have comes from God and belongs to God.<\/p>\n\n\n\n<p>“Let the brother of low degree rejoice in that he is exalted: But the rich, in that he is made low: because as the flower of the grass he shall pass away. For the sun is no sooner risen with a burning heat, but it withereth the grass, and the flower thereof falleth, and the grace of the fashion of it perisheth: so also shall the rich man fade away in his ways.” — James 1:9-11 (KJV)<\/p>\n\n\n\n<p>We are not defined by what we own but by our relationship with the living God. “And as Moses lifted up the serpent in the wilderness, even so must the Son of man be lifted up: That whosoever believeth in him should not perish, but have eternal life. For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:14-15 (KJV)<\/p>\n\n\n\n<p>I am not saying that we shout not reach for our highest potential, but maybe we should reevaluate what we think of as success. The Bible makes it clear that we cannot serve two masters; we cannot serve both God and money, because we will love one and hate the other.<\/p>\n\n\n\n<p>It does matter what we do in this life, but it’s not our riches that we will take with us when we die. Our hope is not in our money or the things that we own. “For what shall it profit a man, if he shall gain the whole world, and lose his own soul? Or what shall a man give in exchange for his soul? — Mark 8:36-37 (KJV)<\/p>\n\n\n\n<p>Finally, consider these words from Ecclesiastes 12:13-14 (KJV), “Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man. For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil.”<\/p>\n\n\n\n<p>The work that Jesus did, dying on the cross that we might have eternal life, it is enough. That is why it is called good news.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The things that we have, and the money that we have, is it enough? Are we happy with what we have, or are we always wanting just a little more? While the world is filled with people that have so little, there are are few&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/how-much-is-enough\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":353,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14,29],"tags":[33,3],"class_list":["post-352","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","category-think-about-it","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/352","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=352"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/352\/revisions"}],"predecessor-version":[{"id":354,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/352\/revisions\/354"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/353"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=352"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=352"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=352"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}