{"id":355,"date":"2023-01-15T19:33:02","date_gmt":"2023-01-15T19:33:02","guid":{"rendered":"https:\/\/llgt.cafe\/?p=355"},"modified":"2023-01-15T19:33:02","modified_gmt":"2023-01-15T19:33:02","slug":"what-is-it","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-is-it","title":{"rendered":"What is it?"},"content":{"rendered":"\n<p>Have you ever looked at the list of ingredients on one of your favorite foods and wondered what some of the ingredients were? I sometimes feel overwhelmed when a recipe lists eight or more ingredients, but there may be 20 or more ingredients listed on anything from your favorite candy bar to a simple soup.<\/p>\n\n\n\n<p>These foods may taste good, but the sad truth is that some of the ingredients that are used may be added in order to make us more addicted to these foods. And the desire for profit and to produce a product that will have a long shelf life may outweigh the desire to produce a truly health product. And, to be honest, those foods which claim to be healthier often don’t taste as good.<\/p>\n\n\n\n<p>On top of not being able to pronounce some of the items in a list of ingredients, many ingredients can be listed under “spices.” These may be actual spices, but they may also be man made products: chemicals that are added in order to get you addicted. Soy, a natural product, is often listed as vegetable protein.<\/p>\n\n\n\n<p>The problem is that we may not fully understand the health implications of all of the soy that is used in many of our prepared foods these days, or of things like corn oil. And it’s hard to trust some of the studies when they are either done by or funded by those who will most benefit from a positive outcome.<\/p>\n\n\n\n<p>Then there are the things that we know, but may not fully appreciate, that foods containing high levels of fat and high levels of sugar, or items that easily convert to sugar may not be good for us, not only affecting our weight, but possible affecting our cognitive health.<\/p>\n\n\n\n<p>Though I don’t have any recommendations for changing the food industry, I can recommend that, if all possible, you try to avoid processed foods and make your own. If you don’t have time to cook every day, try to pick one day where you can make a large batch and portion it out for the week, refrigerating or freezing your food if necessary. The few hours that you spend in the kitchen one day a week may be worth it in the long run.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever looked at the list of ingredients on one of your favorite foods and wondered what some of the ingredients were? I sometimes feel overwhelmed when a recipe lists eight or more ingredients, but there may be 20 or more ingredients listed on&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-is-it\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":356,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43],"tags":[3],"class_list":["post-355","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/355","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=355"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/355\/revisions"}],"predecessor-version":[{"id":357,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/355\/revisions\/357"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/356"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=355"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=355"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=355"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}