{"id":358,"date":"2023-01-16T16:03:34","date_gmt":"2023-01-16T16:03:34","guid":{"rendered":"https:\/\/llgt.cafe\/?p=358"},"modified":"2023-01-16T16:03:34","modified_gmt":"2023-01-16T16:03:34","slug":"hobbies","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/hobbies","title":{"rendered":"Hobbies"},"content":{"rendered":"\n<p>If photography were my hero, camera equipment would be my nemesis. I can spend hours just checking out websites like B&amp;H Photo, trying to figure out what I might buy if I had the money, or watching YouTube videos on the latest gear.<\/p>\n\n\n\n<p>Taking pictures is something that I enjoy doing, and it is something that I have enjoyed doing for more than forty years. There are other things that I enjoy doing, like writing and cooking, traveling and meeting new people. But if there were any of these that I could do for a living, and I have worked in the food industry for somewhere around 30 years, I would like to take pictures.<\/p>\n\n\n\n<p>For me, photography isn’t about making that perfect picture, but looking at the world around me and finding the beauty, even if it’s something that lasts for just a moment, like a cloud, a hummingbird drinking nectar from a flower, or the smile on the face of a bride to be.<\/p>\n\n\n\n<p>Likewise, when I cook, I like to look around and see what I have available to make for myself or for others. For me, it is a challenge to make the best meal that I can out of what I have or to come up with a meal plan based on all of the options available at the grocery.<\/p>\n\n\n\n<p>Writing is something that I have done most of my life, but blogging is something that I have only recently started. When I was in college, I took a few journalism classes, hoping to combine writing with my photography. Mostly, when I write, it’s in one of my journals and, for me, writing can be relaxing and therapeutic.<\/p>\n\n\n\n<p>Travel and meeting new people can be a lot of fun. Though I have had a few opportunities to travel with a group or with a guide, I have done most of my travels on my own. Some times it’s just for a day or a few hours. Other times, it’s for months or years.<\/p>\n\n\n\n<p>For now, all of these things are just hobbies. Hobbies are things that we can do that we can enjoy. They can help pass time and may even make us feel better. On the other hand, we can spend our time feeding our addictions, which may cost us in more than one way or another, and often make us feel worse.<\/p>\n\n\n\n<p>Then there are the things that we know, but may not fully appreciate, that foods containing high levels of fat and high levels of sugar, or items that easily convert to sugar may not be good for us, not only affecting our weight, but possible affecting our cognitive health.<\/p>\n\n\n\n<p>Though I don’t have any recommendations for changing the food industry, I can recommend that, if all possible, you try to avoid processed foods and make your own. If you don’t have time to cook every day, try to pick one day where you can make a large batch and portion it out for the week, refrigerating or freezing your food if necessary. The few hours that you spend in the kitchen one day a week may be worth it in the long run.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If photography were my hero, camera equipment would be my nemesis. I can spend hours just checking out websites like B&amp;H Photo, trying to figure out what I might buy if I had the money, or watching YouTube videos on the latest gear. Taking pictures&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/hobbies\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":359,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,53,52],"tags":[54,3,55],"class_list":["post-358","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-hobbies","category-photography","tag-cameras","tag-llgt","tag-photography"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/358","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=358"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/358\/revisions"}],"predecessor-version":[{"id":360,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/358\/revisions\/360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/359"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=358"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=358"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=358"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}