{"id":361,"date":"2023-01-17T17:04:04","date_gmt":"2023-01-17T17:04:04","guid":{"rendered":"https:\/\/llgt.cafe\/?p=361"},"modified":"2023-01-17T17:04:04","modified_gmt":"2023-01-17T17:04:04","slug":"thinking-for-ourselves","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/thinking-for-ourselves","title":{"rendered":"Thinking for Ourselves"},"content":{"rendered":"\n<p>Consider this: how much of the things that we think or say is simply something that we heard someone else say? It’s not uncommon, and we may not even realizing that we are doing it.<\/p>\n\n\n\n<p>The problem is that all of us have certain bias, and most often we seek out information that matches what we already believe (conformation bias), even putting up mental roadblocks to the things that may go against the things that we want to believe.<\/p>\n\n\n\n<p>In most cases, no one gets hurt by the things that we believe are either true or false. But all of us make decisions based on our beliefs, and some of these choices may impact not only our own lives but the lives of others. And the things that we believe can be passed on to others, whether they are true or not. And we may not even be aware that something that we believe isn’t true, either in part or in whole.<\/p>\n\n\n\n<p>Often, it’s difficult to know what to believe about a particular subject. Take diets for example. What one person says is healthy, another might say the exact opposite. For a time, margarine was considered to be healthier than butter. Further back, blood letting was used as a method to cure disease. It was also believed that heart disease was a problem in the heart; now it’s known to be an issue with the arteries leading to the from and to the heart. But there is still no agreement on exactly what causes things like plaque to build up in the arteries.<\/p>\n\n\n\n<p>More and more, our media is becoming biased, leaning one way or another. And, if you want to know why it is leaning in one direction, sharing certain stories while completely ignoring others, or sharing a story in a particular light, you may just need to look at where the money is coming from. Who’s advertising is paying for the broadcast, and who owns the company. Say, for example, a major beverage company is advertising on the nightly news. It’s unlikely that you are going to see a negative story about the harmful effects of either sugar or alcohol, depending on which beverage company is advertising.<\/p>\n\n\n\n<p>A friend told me that he watches all of the news channels. He said that some lean one way, while others lean another direction. He told me that the truth is often somewhere between the two.<\/p>\n\n\n\n<p>So, how can we overcome bias and begin to think for ourselves? One way is to intentionally look for sources of information that may conflict with your own views. You won’t get this if you turn on the TV and leave it on the same channel.<\/p>\n\n\n\n<p>You can also talk to people who may disagree with you. Don’t shut them off as you might a television program that you’ve lost interest in. You need to seek to hear and to understand more than to be heard and understood.<\/p>\n\n\n\n<p>Ask yourself questions, like what do you believe and why. Where did we get this information? Is it true? Is it just partially true? Is it completely untrue? Is it something that may have been true at one time but is no longer applicable?<\/p>\n\n\n\n<p>I’ve been guilty of saying or thinking things that may have not been true, thinking that they were, only later finding out that they either were not true or may have not been true.<\/p>\n\n\n\n<p>Thinking for ourselves begins with asking question. It’s not likely that we will ever know everything for certain, or be right about everything, but the more information that we get, the more of an informed decision that we can make. You can begin asking theses questions. Or, you can just let someone else do your thinking for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Consider this: how much of the things that we think or say is simply something that we heard someone else say? It’s not uncommon, and we may not even realizing that we are doing it. The problem is that all of us have certain bias,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/thinking-for-ourselves\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":362,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29],"tags":[3],"class_list":["post-361","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/361","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=361"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/361\/revisions"}],"predecessor-version":[{"id":363,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/361\/revisions\/363"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/362"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=361"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=361"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=361"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}