{"id":374,"date":"2023-01-21T19:31:48","date_gmt":"2023-01-21T19:31:48","guid":{"rendered":"https:\/\/llgt.cafe\/?p=374"},"modified":"2023-01-21T19:31:48","modified_gmt":"2023-01-21T19:31:48","slug":"feeling-stressed","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/feeling-stressed","title":{"rendered":"Feeling Stressed?"},"content":{"rendered":"\n<p>I&#8217;m told that stress is not good for the body, and that the body does not distinguish between good stress and bad stress.<\/p>\n\n\n\n<p>There are so many stresses to choose from. There is the stress of loosing ones job, of that final exam, of having health problems or having one that you love be sick. There are financial stresses and relational stresses, an a whole host of others.<\/p>\n\n\n\n<p>Stressors don’t even need to be real. If we think that we are late because the clock is wrong, we will be just as stressed as if we were really late. It’s not the stressors that are the problem but the way that we react to them.<\/p>\n\n\n\n<p>Stress can do any number of things to our body, for giving us high blood pressure to educing psychoses. Certain stresses may also cause depression or a sense of hopelessness. If stress persists long enough or is severe enough, it may require medical attention of one type or another.<\/p>\n\n\n\n<p>It may be easy to identify the negative stresses in our lives, though they may not be easy to deal with on our own. But there are other stressors that we must keep in mind. An adrenaline rush can be okay from time to time, but it is not something that we want to experience long term because of the damage that it can do to our bodies.<\/p>\n\n\n\n<p>Caffeine is another thing that can make us feel better and may help us to be more productive, but taken to extremes, can be may be very harmful to the body. And there is evidence that coffee may be just as addictive as some drugs.<\/p>\n\n\n\n<p>First John 4:18 (KJV) tells us that “There is no fear in love; but perfect love casteth out fear…”<\/p>\n\n\n\n<p>The best place that anyone can be is safe in God’s love: to know that God not only wants to take care of us but that he is more than capable of doing so, even when we don’t know what we need.<\/p>\n\n\n\n<p>You may say that religion is a crutch. In part, I must agree. It is not, however a crutch that I have made, but one that was given to me. You see, Jesus is called our great physician, and he gives us whatever we need to make us complete. Truly, when we become Christians, when we put our faith in him, he comes along and stands besides us and helps us along the way. And from time to time we may even be carried.<\/p>\n\n\n\n<p>If you find yourself stressed, stop. Take a moment to look at what you are thinking about. Count to ten, or distract yourself in some way. Write out your thoughts or talk to a friend. Do something that you enjoy. It may make a world of difference.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I&#8217;m told that stress is not good for the body, and that the body does not distinguish between good stress and bad stress. There are so many stresses to choose from. There is the stress of loosing ones job, of that final exam, of having&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/feeling-stressed\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":375,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,16],"tags":[3],"class_list":["post-374","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-health","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/374","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=374"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/374\/revisions"}],"predecessor-version":[{"id":376,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/374\/revisions\/376"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/375"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}