{"id":377,"date":"2023-01-22T20:09:33","date_gmt":"2023-01-22T20:09:33","guid":{"rendered":"https:\/\/llgt.cafe\/?p=377"},"modified":"2023-01-22T20:09:33","modified_gmt":"2023-01-22T20:09:33","slug":"photography-as-art","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/photography-as-art","title":{"rendered":"Photography As Art"},"content":{"rendered":"\n<p>I’ve decided to try to start a photography business — again. My first attempts never really got off the ground. I’m hoping that past fails have taught me something.<\/p>\n\n\n\n<p>I just got back from a bridal show and picked up business cares from a few of the area of wedding photographers. Speaking of wedding photography, and photography in general, there has long been the question as to whether one style of photography is more of a form of art than another.<\/p>\n\n\n\n<p>Unlike other forms of art, photography has the ability to capture things as they are, or at least as they appear to be. Video does much the same thing. Some forms of sketching can come close with the use of projectors and other tools.<\/p>\n\n\n\n<p>My style of photography is more of a journalistic style of photography. I like to capture more natural settings and more natural poses. Other photographers like to control their subject, often telling the people in their photographs where to stand or sit and how to act. Some like to control every aspect of their photographs, hiring makeup artists and, perhaps, setting up special backgrounds. Other photographers choose to do all of their work post process, doing various degrees of work in software like Photoshop.<\/p>\n\n\n\n<p>If you are a photographer, you may want to take a moment to consider your style. I’ve known a lot of photographers over the years and have heard of several different photographic styles. In sports photography, for example, some photographs chase the action with their camera, while others focus on one area and take pictures only when the action is in that area, such as the finish line of a race or around the basketball goal. Some photographers work more on composition, while others may look more at the story that their photographs tell.<\/p>\n\n\n\n<p>My feeling is that all these styles of photography are forms of art because beauty is in the eye of the beholder or, in the case of music, the ear of the beholder. You may not like the same style of art that I like and visa versa, but that doesn’t make either preference less valid. It might even be a good idea to check out styles outside of your own preference from time to time.<\/p>\n\n\n\n<p>If you can, take some time to look at some photographs, either your own or someone else’s and ask yourself what it is that you like or dislike about these pictures. What do you think when into making these pictures, and what might you do differently. Keep in mind, however, that if you are looking at someone else’s work, that your opinions probably say more about you than the artist who created the work.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve decided to try to start a photography business — again. My first attempts never really got off the ground. I’m hoping that past fails have taught me something. I just got back from a bridal show and picked up business cares from a few&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/photography-as-art\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":378,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28,52],"tags":[3],"class_list":["post-377","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","category-photography","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/377","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=377"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/377\/revisions"}],"predecessor-version":[{"id":379,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/377\/revisions\/379"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/378"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=377"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=377"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=377"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}