{"id":384,"date":"2023-01-24T16:33:55","date_gmt":"2023-01-24T16:33:55","guid":{"rendered":"https:\/\/llgt.cafe\/?p=384"},"modified":"2023-01-24T16:33:55","modified_gmt":"2023-01-24T16:33:55","slug":"thoughts-on-money","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/thoughts-on-money","title":{"rendered":"Thoughts on Money"},"content":{"rendered":"\n<p>Money is a lot of things, and it is not the same thing to everyone. It seems that all of us, no matter how much we have, we want more. Yet it’s not the money that makes or breaks us, but the things that we do or fail to do with the money that we have.<\/p>\n\n\n\n<p>Whether we like it or not, money, and how we use it can also tell us a lot about ourselves. Money shows us were our value are, what’s important to us, and whether or not we have self control, among other things. I do not believe that that having lots of money somehow gives us a form of Godliness as some believe, nor is wealth always gained by honest means. Money should not separate us, but often it does.<\/p>\n\n\n\n<p>Money is a tool, allowing us to do the things that we want and helpings us to get the things that we need. I say helping, because getting the things that we need may depend on things outside of our control.<\/p>\n\n\n\n<p>Our view of wealth is based mostly on those around us, our view of those around us, and our view of what is most important. Our view of wealth is also shaped by our faith as well as by our past.<\/p>\n\n\n\n<p>It’s quite easy to see that wealth is not evenly disbursed. Compared to those who own and live in bigger houses, drive nicer cars and have and earn more money, I’m not all that rich. But compared to those who may have one set of clothing, live in a shack, struggle to get food and water, worry about their and their family’s safety and do not have the freedom to worship God as they choose, I might be considered very rich.<\/p>\n\n\n\n<p>Credit and debt also allow us to buy the things that we want right now. The use of credit can also tell us a lot about ourselves. And while it’s easy to assume that things will only continue to get better, wisdom teaches the wise to prepare for lean times, times when there is no money or there are no crops. And though create can give us what we want now, it can be a trap that keeps us from what we need in the future. Plus, the thing that we want now may not be something that we want in the future.<\/p>\n\n\n\n<p>Yes, money is a tool, but remember that it is not the only tool. To only think of money when it comes to getting the things that we want is to limit our thinking. Often wisdom and hard work are more important than how much money we have in our bank account at any given time. Farsightedness can be of more value than years of education.<\/p>\n\n\n\n<p>The Bible has a lot to say about money. It you want wisdom on how to deal with money, this is where you should look, beginning with Proverbs. This life is short in light of eternity. And the picture that we paint with our lives isn’t made up of the things that we hope to do, but in the details of the little things that we actually do. These are the things that we really should take the time to think about.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Money is a lot of things, and it is not the same thing to everyone. It seems that all of us, no matter how much we have, we want more. Yet it’s not the money that makes or breaks us, but the things that we&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/thoughts-on-money\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":385,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38,29],"tags":[20,3],"class_list":["post-384","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-money","category-think-about-it","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/384","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=384"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/384\/revisions"}],"predecessor-version":[{"id":386,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/384\/revisions\/386"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/385"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=384"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=384"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=384"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}