{"id":387,"date":"2023-01-25T17:40:29","date_gmt":"2023-01-25T17:40:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=387"},"modified":"2023-01-25T17:40:29","modified_gmt":"2023-01-25T17:40:29","slug":"rumors","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/rumors","title":{"rendered":"Rumors"},"content":{"rendered":"\n<p>There is a lot of information being spread about all sorts of people: a lot of information and a lot of disinformation. The problem is that it can be difficult to tell which is which. It may all boil down to who do you trust more and what is it that you already believe.<\/p>\n\n\n\n<p>Unfortunately, what we really have most of the time is no more than a rumor. Rumors may be completely true, partly true or complete lies. One problem is that we often don’t know whether a rumor is true or not, and we may never know whether it is true or not. The second problem is that we cannot always go to the person or people involved to get their side of the story, if we eve n want to know the truth.<\/p>\n\n\n\n<p>Perhaps the biggest problem is that rumors are nothing less that destructive. Rumors can destroy individuals, families, businesses and even peoples or countries. Rumors cause mistrust and confusion, doubt and, if not dealt with properly can cause damage that lasts for months or years.<\/p>\n\n\n\n<p>The Bible has a lot to say about rumors and those who spread them, and none of it is any good. it may be difficult to spot a rumor, but if you hear one, the best thing to do is to let it end with you. Question the person who is spreading the rumor to find out if they have actual evidence of that they are saying is true or not. Either way, you should encourage that person to stop spreading the rumor. If you want or need to talk to anyone about a rumor, talk to those who are involved, keeping in mind that that person may not want to talk about any rumors.<\/p>\n\n\n\n<p>Some companies take a very dim view of people who spread rumors and, depending on the rumor, may find the spreading of rumors as grounds for termination.<\/p>\n\n\n\n<p>For me, it doesn’t matter what I believe about a person, I don’t put a lot of stock in rumors. It may be a “harmless” guess as to what someone might do, or what might happen in the future. Yet, guesses are guesses and should be sold as such instead of as fact.<\/p>\n\n\n\n<p>Instead of tearing each other down, we need to be building each other up. Hurt people only go on to hurt other people and, unless someone puts a stop to this cycle, the hurting just keeps going.<\/p>\n\n\n\n<p>Do you believe the best of others or the worst? Perhaps this says more about you than it does the other person. It may be a harsh reality but it’s true. Think about that the next time you hear a rumor or are tempted to pass one on to someone else. Take a moment to stop and think before you pass on a rumor, then stop<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is a lot of information being spread about all sorts of people: a lot of information and a lot of disinformation. The problem is that it can be difficult to tell which is which. It may all boil down to who do you trust&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/rumors\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":388,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[47,29],"tags":[3],"class_list":["post-387","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-relational","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/387","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=387"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/387\/revisions"}],"predecessor-version":[{"id":389,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/387\/revisions\/389"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/388"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=387"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=387"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=387"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}