{"id":393,"date":"2023-01-27T19:00:36","date_gmt":"2023-01-27T19:00:36","guid":{"rendered":"https:\/\/llgt.cafe\/?p=393"},"modified":"2023-01-27T19:00:36","modified_gmt":"2023-01-27T19:00:36","slug":"taking-inventory","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/taking-inventory","title":{"rendered":"Taking Inventory"},"content":{"rendered":"\n<p>One of the main things that I have learned from all of my years in food service is how to make something out of very little, or just the things that I have available. This is why I always try to have the basics: oil, flour, yeast, eggs and, if I dig it out, I should be able to find baking powder. Cinnamon is nice, but if you don’t have it, it’s just an extra.<\/p>\n\n\n\n<p>There are at least a few things that you can make with just these items — pancakes, muffins, bread — and if you add just one or two ingredients, there are so many more things that you can make.<\/p>\n\n\n\n<p>Right now, I have two cans of canned chicken. There are at least a few meats that taste like chicken. So what does canned chicken taste like? I’d say it tastes like tuna. Back to my list. I have a package of lasagna noodles, enough cheese for one meal, and some sliced lunch meats: smoked turkey and cooked ham. Oh, and I have part of a loaf of bread, some mixed greens, and three condiments: ketchup, mayonnaise and salsa. I have instant potatoes that someone gave me and enough milk for my tea.<\/p>\n\n\n\n<p>You see, you don’t have to have a lot to make a meal, or at least a snack. If I wanted, I could make pancakes (yes, I found the baking powder), ham and potato soup, fried egg with cheese and salsa, an egg sandwich, fried ham with a side of instant potatoes, a ham sandwich with mixed greens, along with a few other dishes. I’ve already had dinner, but I could make these things tomorrow.<\/p>\n\n\n\n<p>Maybe you live in a place where the basics are harder to come by. If so, what is it that you do have? You don’t have to answer that question. Just think about it. Maybe you have neighbors and you and your neighbor(s) can pool your resources. You may have to go out and forage for something. Hopefully you can do better than just pine cones, but if not, I can at least keep you in my prayers. I cannot begin to imagine what you are going through right now.<\/p>\n\n\n\n<p>Have you heard of the story of “Stone Soup”? When I was little, it was one of my favorite stories. If I remember correctly, there is a goose who wants to make a soup. Starting off with just a stone, the goose is able to get the other animals in the story to add something, until the soup is completed, and there is enough for everyone.<\/p>\n\n\n\n<p>You don’t need to spend nearly 30 years in food service, or go to an overpriced culinary school. All you need to do is stop and take an honest look at what you have. Maybe you just have the stone and a pot of water, but you have to start with something. Not one of us knows what tomorrow holds, so remember to make the most of today, and be thankful for what you do have.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the main things that I have learned from all of my years in food service is how to make something out of very little, or just the things that I have available. This is why I always try to have the basics: oil,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/taking-inventory\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":394,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,45],"tags":[3],"class_list":["post-393","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/393","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=393"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/393\/revisions"}],"predecessor-version":[{"id":395,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/393\/revisions\/395"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/394"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=393"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=393"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=393"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}