{"id":400,"date":"2023-01-29T18:32:36","date_gmt":"2023-01-29T18:32:36","guid":{"rendered":"https:\/\/llgt.cafe\/?p=400"},"modified":"2023-01-29T18:32:36","modified_gmt":"2023-01-29T18:32:36","slug":"are-we-listening","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/are-we-listening","title":{"rendered":"Are We Listening?"},"content":{"rendered":"\n<p>It should come as no surprise that we often don’t listen to one another. And if we do listen, often we don’t hear what’s really being said.<\/p>\n\n\n\n<p>God has tried to warn us countless times, starting with Adam and continuing to the present. Stay away from this, flee that, and choose love over everything else. But in order to show love, you have to spend time with someone. You have to stop talking and take the time to listen.<\/p>\n\n\n\n<p>Parents have such a short time to spend with their children. Most of a child’s personality is developed within the first two years, but that personality continues to be shaped and molded for years to come. Unfortunately, many of those years can be shaped by hours spent in front of a screen, years spent in a classroom, or by all of the time spent with friends who may or may not have your best interest in mind.<\/p>\n\n\n\n<p>So, what do we do, shut ourselves off from the rest of the world and hide in our own little corner? Do we cut off communication with even those whom we share a roof? These days, I see one of two things: utter silence or loud yelling, neither of which is an effective means of communication.<\/p>\n\n\n\n<p>Is it that we already know each other so well that we no longer need to talk. Is it that we are now too busy to communicate with one another, or is it that we already know all of the answers and don’t need to rehash old conversations.<\/p>\n\n\n\n<p>It’s easier to talk to people that we agree with, though conversations can often be short. It may be more difficult to find someone who shares your interests, but even more difficult to find someone who disagrees with you who is willing to have an actual conversation.<\/p>\n\n\n\n<p>As a nation, as a people and, for Christians in particular, we ought to stop tearing each other down and start building one another up. We need to stop dismantling one another and focus our attention on those who are trying to tear us apart.<\/p>\n\n\n\n<p>Instead of believing the lies that we have all been fed, we need to turn our attention to the one who is the truth. Our yes should be yes, and our no should be no. We need to stop calling wrong right and right wrong. And we need to take back our families from a world that is bent on it’s own destruction and on the destruction of everything that God created and called good.<\/p>\n\n\n\n<p>Is thee still time? I believe that even in the fires, God is telling us that he loves us. In the loneliness, God is telling us that he is with us. In the want and need, God is telling us that he is our provider. Are we listening?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It should come as no surprise that we often don’t listen to one another. And if we do listen, often we don’t hear what’s really being said. God has tried to warn us countless times, starting with Adam and continuing to the present. Stay away&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/are-we-listening\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":401,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[35,47],"tags":[3],"class_list":["post-400","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-question","category-relational","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/400","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=400"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/400\/revisions"}],"predecessor-version":[{"id":402,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/400\/revisions\/402"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/401"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=400"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=400"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=400"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}