{"id":404,"date":"2023-01-30T14:24:18","date_gmt":"2023-01-30T14:24:18","guid":{"rendered":"https:\/\/llgt.cafe\/?p=404"},"modified":"2023-01-30T14:24:18","modified_gmt":"2023-01-30T14:24:18","slug":"good-and-bad-ideas","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/good-and-bad-ideas","title":{"rendered":"Good and Bad Ideas"},"content":{"rendered":"\n<p>I’ve come up with an idea for a new reality show: “Laundromat Dating.” Don’t steal it. Actually, if you want it, you can have it. If you put it together, having seen it in person, I think I would watch it.<\/p>\n\n\n\n<p>Think about it, meeting at a laundromat is a perfect place to meet someone for a date. It’s safe, cheap (about $3 per load to wash and $2 for drying), and is limited to an hour to an hour and a half. It’s perfect for a one hour show. And, if you get tired listening to his resume, you don’t have to do laundry ever again. I guess the saying is true: “You can learn a lot about a guy by the way he folds his socks.”<\/p>\n\n\n\n<p>I have to admit that most of my ideas wind up in the garbage can of the mind. Some of them should have. These include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Affordable housing: an individual or family would pay housing based on the price of the property, plus some amenities, like security and utilities. Some cities offer COOP housing, but someone us usually making money.<\/li>\n\n\n\n<li>A self supported ministry or Non-Profit: It would make money though business such as restaurants, photography and book sales. I worked on this one a long time before giving up.<\/li>\n\n\n\n<li>Personal Chef: actually, this is a really good idea — in some parts of the country. But not where I was trying to get started.<\/li>\n\n\n\n<li>Spending $900 on advertising to find out that you can really only make about 1% of that back.<\/li>\n<\/ul>\n\n\n\n<p>Some ideas should probably wind up in that same trash can. Someone set up a trailer sized ice machine in northern Idaho. I’m sure this person’s heart was in the right place, but it may have been an expensive lesson. I stopped by to photograph it, because it was gone after a month.<\/p>\n\n\n\n<p>Here are some good ideas:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Start with an idea. Do your research, but don’t invest any money until you’ve decided that you have customers. If you have a lot of friends, talk to them, first, to see if they are interested. Also, find out if they could either review your product\/service or recommend you to friends.<\/li>\n\n\n\n<li>Be up front. Don’t be afraid to ask potential customers if they can afford what you are offering. If possible, get their contact information and get permission to use this contact information. An email address usually works. This way you can contact them, later, with new products or services they may be interested in.<\/li>\n\n\n\n<li>Start small. This is a hard one, considering that Sam Walton borrowed $5 million to set up his first Walmart in Rogers, Arkansas — which is less than a 45 minute drive from here. He did, however, manage to get a low interest loan, thanks to the fact that he was the loan officer. What I mean is, have a budget in mind. The camera equipment I purchased for my photography business was purchased after a great deal of research, and it fit within my budget, meaning, I could pay for it on my present income.<\/li>\n\n\n\n<li>Finally, be consistent. It helps to have all of the legalese in place, but you have to talk to people on a regular basis, letting them know who you are, that you can be trusted, and that they can look to you as a dependable expert in your field.<\/li>\n<\/ul>\n\n\n\n<p>If that fails, tell jokes: I quit my job at the farm because they said I could pick up chicks. I think they lied.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve come up with an idea for a new reality show: “Laundromat Dating.” Don’t steal it. Actually, if you want it, you can have it. If you put it together, having seen it in person, I think I would watch it. Think about it, meeting&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/good-and-bad-ideas\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":405,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,28,50,39],"tags":[3],"class_list":["post-404","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-creativity","category-humor","category-ideas","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/404","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=404"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/404\/revisions"}],"predecessor-version":[{"id":406,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/404\/revisions\/406"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/405"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=404"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=404"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=404"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}