{"id":407,"date":"2023-01-31T16:31:29","date_gmt":"2023-01-31T16:31:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=407"},"modified":"2023-01-31T16:31:29","modified_gmt":"2023-01-31T16:31:29","slug":"morning-routine","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/morning-routine","title":{"rendered":"Morning Routine"},"content":{"rendered":"\n<p>You won’t see a video, but I do have a morning routine. Thanks to a couple of books that I picked up on <a href=\"https:\/\/amzn.to\/3HHDnfU\" target=\"_blank\" rel=\"noreferrer noopener\">Audible<\/a>, I’ve discovered the importance of having a consistent morning routine. It doesn’t have to be complicated.<\/p>\n\n\n\n<p>First things first. After waking up, I look at the clock. If it’s before 4, or I’ve gotten less than 5 hours sleep, I ask God if there’s anything I need to pray about. I pray for anyone who comes to mind and I either get up or try to go back to sleep. Some times I just need a quick snack before going to back to bed. When I do get started, it’s usually with a cup of coffee in my favorite coffee\/tea cup: two teaspoons instant <a href=\"https:\/\/amzn.to\/3HHDnfU\" target=\"_blank\" rel=\"noreferrer noopener\">coffee<\/a>, stevia and lots of milk.<\/p>\n\n\n\n<p>I have my <a href=\"https:\/\/amzn.to\/3wNJfha\" target=\"_blank\" rel=\"noreferrer noopener\">vitamins<\/a> lined up on the kitchen table behind me. My checklist is on a dry-eraser board on the fridge next to the Bible verse that I read each morning — at some point.<\/p>\n\n\n\n<p><strong>Let the words of my mouth, and the meditation of my heart, be acceptable in thy sight, O Lord, my strength, and my redeemer. — Psalm 19:14 (KJV)<\/strong><\/p>\n\n\n\n<p>I’m a work in progress (WIP), so this is something that I hope will some day be true.<\/p>\n\n\n\n<p>Music is a must, first thing in the morning. Right now, I am addicted to <a href=\"https:\/\/amzn.to\/3HM1qdq\" target=\"_blank\" rel=\"noreferrer noopener\">Audrey Assad<\/a> and to most (not all) of her songs. I could listen to her song, “Good to Me” for hours, which is a good thing, because I like to get a song stuck in my mind because it helps pass time while I work.<\/p>\n\n\n\n<p>Journaling is on my list and, while I wish reading were one of my loves, I find that it takes too much mental energy. That’s where YouTube videos come in handy. If you look hard enough, you can find positive or helpful videos. YouTube has problems trying to figure me out, as I’ve told it I don’t like most of the channels that they recommend.<\/p>\n\n\n\n<p>Just as letters — real, hand written letters — seem to have become something from the past, it seems that email is taking the same path, in favor of texting and FaceTime. Of the two, I prefer a text. Apple’s Messages is similar to texting, but only works between Apple devices. I can send someone a text from my phone and another from my tablet, and it doesn’t matter to them which I send it from. But it matters to me which one they reply to because one will go to my phone and one will go to my tablet. I may not see one or the other for some time.<\/p>\n\n\n\n<p>Breakfast is usually between 11am and noon. FYI: 12M is actually noon. Yesterday, I had leftover tuna salad on a sandwich. It depends on what I have on hand. One day, I took brownie mix and made pancakes with peanut butter. I usually have eggs with cheese, since cheese is, after all, a vegetable in my book. One of my favorites is diced bacon, fried eggs topped with kimchi.<\/p>\n\n\n\n<p>I begin my blog post by 11am. If I lack the energy, I find an old blog post that I can use, copy\/paste, and create an image for the website and for Facebook.<\/p>\n\n\n\n<p>I like to walk at least 10 minutes, if it’s not too hot or absolutely too cold. I think, with the ice on the streets and temperatures around 20°F\/-6.66 (cold from hell, as some would say), it qualifies as too cold.<\/p>\n\n\n\n<p>By 1:30am, I’m getting ready for work: shave, shower and putting my lunch box together. I keep everything else — keys, pens and earbuds — in a box on the TV table by the kitchen table.<\/p>\n\n\n\n<p>You may ask: “But why?” I’m glad you asked. I’ve leaned that it’s important, not only to stay focused, but to focus my heart and mind on the right things. I’m not saying it’s easy, but it’s worth it. I have a choice: I can either focus on all of the negative things, the things that I want to waist my time on, or I can focus on the things that will eventually get me where I want to be. The good news is that a walk to the fridge or the kitchen stove counts as a walk, in a pinch.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You won’t see a video, but I do have a morning routine. Thanks to a couple of books that I picked up on Audible, I’ve discovered the importance of having a consistent morning routine. It doesn’t have to be complicated. First things first. After waking&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/morning-routine\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":408,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16,14],"tags":[33,3],"class_list":["post-407","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","category-spiritual","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/407","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=407"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/407\/revisions"}],"predecessor-version":[{"id":410,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/407\/revisions\/410"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/408"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=407"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=407"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=407"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}