{"id":411,"date":"2023-02-01T14:20:28","date_gmt":"2023-02-01T14:20:28","guid":{"rendered":"https:\/\/llgt.cafe\/?p=411"},"modified":"2023-02-01T14:20:28","modified_gmt":"2023-02-01T14:20:28","slug":"the-heart-of-god","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-heart-of-god","title":{"rendered":"The Heart of God"},"content":{"rendered":"\n<p>It seems sometimes that the growing amount of evil in the world can be overwhelming. Just watch a few hours of television — and I don’t recommend it — and this is what your are likely to see: death, murder, deceit and destruction on a scale that few of us have ever seen in our lives. On the other hand, there are those who will say that “you have a problem and we have the solution; and you can have our solution for 99 easy payments of only $20\/month.” You get the picture.<\/p>\n\n\n\n<p><strong>First Peter 5:8 (KJV) tells us, “Be sober, be vigilant; because your adversary the devil, as a roaring lion, walketh about, seeking whom he may devour.”<\/strong><\/p>\n\n\n\n<p>It may seem, at times as though the devil is winning. But wait. The story isn’t over.<\/p>\n\n\n\n<p>From the time of Adam and Eve — if you believe they existed, and I do — God has had a plan. In fact, this plan probably predates Adam and Eve. And, you know what, I wish I could say that I understand God and his plan, but I cannot. After 40 plus years of trying to understand the mind of God, all I can do is accept his plan by faith. And, in reality, that’s enough.<\/p>\n\n\n\n<p>What I can do is say that I’m finally beginning to understand the heart of God. You see, in the end, God wins. It doesn’t matter who his enemy is, God is going to win. And guess what, as in all of the stories in the Old and New Testament, God isn’t going to use the strong and the mighty, the rich, the famous or the well known. No, God is going to use the weak, the broken, the humble; those used by this world, rejected by the same, and those who have been humbled by life’s circumstances. He will use the young and the old, boys and girls, and those who just can’t quite figure life out. And God uses these people to change the world.<\/p>\n\n\n\n<p>While the devil tries to tell us, “God does’t love you. Look what you’ve done.” Or, conversely, “Look what you’ve accomplished. You don’t need God.” God is saying, through the stillness of his Holy Spirit, “I love you. I created you for a purpose, and I know what’s best for you.” The devil, and I believe he is real, too, just lies, steals and divides. That’s all he can do; he cannot create anything. But, if you’ve heard of Job, he can create problems in our lives.<\/p>\n\n\n\n<p>The good news is that God is still very much alive, and very much active in the lives of people all around the world. And, for now, God is allowing the devil to have his little temper tantrum — to wreck havoc on this world — so that we will run to him for safety. You see, God made a promise to a man named Abram, later called Abraham, and because Abram trusted God, God game him a new name, with a promise to save the world. And, unlike the devil, God cannot lie.<\/p>\n\n\n\n<p><strong>“But God hath chosen the foolish things of the world to confound the wise; and God hath chosen the weak things of the world to confound the things which are mighty.” — 1 Corinthians 1:27 (KJV)<\/strong><\/p>\n\n\n\n<p>I would love to say that I understand the mind of God, but I cannot. All I can say is that I have put my trust in God and in his plan — not only for my life but for yours, also. It seems foolish that something that is so simple could be true, yet it is. And, believe it or not, in the end, God wins.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It seems sometimes that the growing amount of evil in the world can be overwhelming. Just watch a few hours of television — and I don’t recommend it — and this is what your are likely to see: death, murder, deceit and destruction on a&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-heart-of-god\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":412,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,25,14],"tags":[33,8,7,5,3],"class_list":["post-411","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/411","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=411"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/411\/revisions"}],"predecessor-version":[{"id":413,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/411\/revisions\/413"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/412"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=411"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=411"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=411"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}