{"id":414,"date":"2023-02-02T13:17:13","date_gmt":"2023-02-02T13:17:13","guid":{"rendered":"https:\/\/llgt.cafe\/?p=414"},"modified":"2023-02-02T13:17:13","modified_gmt":"2023-02-02T13:17:13","slug":"l-o-v-e","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/l-o-v-e","title":{"rendered":"L.O.V.E"},"content":{"rendered":"\n<p>Did you ever hear the joke about the Arkansan, the photographer and the tourist? Me neither. But if you ever do, it should be a good one.<\/p>\n\n\n\n<p>Joking aside, I was looking for an acronym for the word love. This is what I came up with: leftovers vs. Escoffier. But who or what, you may be asking, who is Escoffier? Well, I’m glad you asked. To borrow a phrase from Bill and Ted, he was a French dude.<\/p>\n\n\n\n<p>According to Wikipedia, Georges Auguste Escoffier, was born in France in the mid 1800s. He died in 1935. In between, he invented — wrote down — much of what we now know as French cuisine. Whole stores as well as a number of restaurants and just about overhang that’s based on food (cooking shows, magazines and cookbooks) has it’s roots in the work of Escoffier.<\/p>\n\n\n\n<p>So, how does that relate to love? For me, cooking is love. I’d say it was something I fell into rather than something I picked; it picked me, due to a lack of other choices at the time.<\/p>\n\n\n\n<p>Rather than bore you with my culinary background, I’ll tell you a story.<\/p>\n\n\n\n<p>I remember being told, “Curiosity killed the cat.” Now, I knew better, even at the age of eight. My parents taught me better. I don’t know about you, but as a youth, I was forever curious. So, who told me about the inevitable death of the cat? It was she school’s librarian. Go figure.<\/p>\n\n\n\n<p>No, it’s the car that kills the cat, at least that’s my experience. The cat crosses the street because it — like many of us, wants to know the freedom of venture, and to find mice. Personally, I hate mice.<\/p>\n\n\n\n<p>Have you ever, if just by chance seen a “Playboy Magazine,” or any other magazine of the same nature? At first, they were innocent pictures. But, over time, depravity demanded more and more, until the first issues wouldn’t be recognizable in today’s society. Like “Life” magazine, “Playboy” is no more. These magazines could compete on the Internet, so they’re gone. Instead, we have PornHub and countless other websites. And with a credit or debit card, you too can join the millions who search the Internet, looking for love. But is it love?<\/p>\n\n\n\n<p>The short answer: no. But here’s the truth: Nooooooooooooo. God offers us Escoffier, but this kind of love is the leftovers that the world offers, the kind that someone dug out of the trash. And no matter how appealing it may seem, what those looking for these things as well as those who pose for the same are both looking for the same thing: love. What they really need is the love of a father: the love of God the Father.<\/p>\n\n\n\n<p>It’s free, you know. God offers his love freely and without any stipulations. What do I have to do to get this love? Just ask. God is waiting to hear from you. I’m just the messenger.<\/p>\n\n\n\n<p>By the way, real love takes commitment. It’s a fearful thing, and we need the help of others or partial blindness to get there.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Did you ever hear the joke about the Arkansan, the photographer and the tourist? Me neither. But if you ever do, it should be a good one. Joking aside, I was looking for an acronym for the word love. This is what I came up&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/l-o-v-e\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":415,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,25,41,43,50,14],"tags":[8,7,3],"class_list":["post-414","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-faith","category-family","category-food","category-humor","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/414","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=414"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/414\/revisions"}],"predecessor-version":[{"id":416,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/414\/revisions\/416"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/415"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=414"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=414"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=414"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}