{"id":417,"date":"2023-02-03T15:59:54","date_gmt":"2023-02-03T15:59:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=417"},"modified":"2023-02-03T15:59:54","modified_gmt":"2023-02-03T15:59:54","slug":"how-i-see-it-now","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/how-i-see-it-now","title":{"rendered":"How I See It &#8212; Now"},"content":{"rendered":"\n<p>I have to admit that I admire the dedication of those whom I saw this morning, braving sub freezing temperatures to enter the Sam’s Club liquor store. Now, if I were them, I would have gone into Sam’s Club, first, for a $5 edible hand warmer, otherwise known as a rotisserie chicken.<\/p>\n\n\n\n<p>It was like a concert, or a Razorback sporting event. And, I could have looked at them and seen a bunch of alcoholics. Yet, when you think about it, most or all of them are probably restaurant owners and business owners. That is, after all, what Sam’s Club was initially set up for.<\/p>\n\n\n\n<p>You see, even a quarter has two sides. And I really do have the option of which side I choose to look at. Not everyone knows this. And knowing isn’t always the same as doing, as I have recently discovered.<\/p>\n\n\n\n<p>Take, for example, my morning trip to DMV. I could have had my mind on my lack of sleep, or worried that I couldn’t pay my taxes. But I arrived early. I joked with the assessor and even told about my meeting with a county assessor over my new business, asking myself if I needed to asses toilet paper, too. You know, these days, toilet paper is a pretty valuable asset.<\/p>\n\n\n\n<p>On to the “Collections” line, where I was met with a young lady with a beautiful smile. I let her know, first thing, that she had a beautiful smile. I was going to say that I saw it with the previous customer, but she showed it to me when I stepped to the window. And, when I left, I told her to keep it.<\/p>\n\n\n\n<p>I even joked with the guy who told me that I owed nearly $1,000 for my plate. What I said was, “That’s more than the plate at the restaurant in Phoenix.” He told me that some had to pay $5,000 just for taxes and that his car was so old that they paid him. Wow. Five thousand dollars for a plate. At that price, a person should at least get a goodnight kiss.<\/p>\n\n\n\n<p>Someone once tole me that I can choose the story that I tell myself and, like everything else, it took years for that truth to sink in. On one hand, a joke can be a coping mechanism. On the other hand, it can be a way to connect with others that we might otherwise never get to know and appreciate.<\/p>\n\n\n\n<p>“You shall know the truth, and the truth will get you killed,” — 1 Nowhere 1:2 (King Ralph Edition)<\/p>\n\n\n\n<p>I miss Robin Williams, and I didn’t realize until yesterday (maybe this morning) how much I miss him. He was funny: no, hilarious.<\/p>\n\n\n\n<p>You see, like a coin, there are two sides. If we know the truth about the darkness of this world — the lying, cheating and stealing and so on — it will come after us. In one way or another, it will kill us.<\/p>\n\n\n\n<p>If, however, our truth — and, yes, Virginia, there is a Kansas — if our truth is Jesus, founded on the Word of God, then we will die to self. If God chooses, he can protect us.<\/p>\n\n\n\n<p>So, next time you are tempted to judge someone, remember, it may be a phase they are in. They may not yet know how to live as they aught. Next time you’re tempted to complain, try pulling out a coin, if you are blessed enough to carry one and realize that, yes, we do have a choice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I have to admit that I admire the dedication of those whom I saw this morning, braving sub freezing temperatures to enter the Sam’s Club liquor store. Now, if I were them, I would have gone into Sam’s Club, first, for a $5 edible hand&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/how-i-see-it-now\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":418,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29],"tags":[3],"class_list":["post-417","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/417","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=417"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/417\/revisions"}],"predecessor-version":[{"id":419,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/417\/revisions\/419"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/418"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=417"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=417"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=417"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}