{"id":421,"date":"2023-02-04T13:10:26","date_gmt":"2023-02-04T13:10:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=421"},"modified":"2023-02-04T13:10:26","modified_gmt":"2023-02-04T13:10:26","slug":"who-are-you-who-who-who-who","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/who-are-you-who-who-who-who","title":{"rendered":"Who are you?  Who, who &#8212; Who, who?"},"content":{"rendered":"\n<p>“Who do you think you are?”, words often spoken in an angry tone. No, really, who are you? It’s a legitimate question. It’ is a question that, however, is not addressed nearly often enough. We just kind of assume that we know the answer without having to really think about it. But this may surprise you: your answer affects literally every aspect of your life.<\/p>\n\n\n\n<p>But how, you may ask. I’m glad you asked. Because, however you see yourself, that is what you will become.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>If you quit things, whether they are important to you or not, you are likely to see yourself as a quitter.<\/li>\n\n\n\n<li>If you see yourself as a drunk or a looser: guess that, that’s how you are likely to behave.<\/li>\n\n\n\n<li>It may seem that the latest craze is to see ourselves as the helpless victim, but I think this has been around for some time.<\/li>\n\n\n\n<li>If, however, you see yourself as an artist, a singer, someone with eternal value or someone who is loved, then that is how you will see yourself.<\/li>\n<\/ul>\n\n\n\n<p>Other people’s opinions also weigh in — and they can have either a positive or negative impact. The choice is yours. You can decide to make their opinion your own or you can use it to motivate you to do they very same thing that they said you could not do.<\/p>\n\n\n\n<p>We may never know, at least in this lifetime, the impact that we may have on the lives of other individuals. I’m told that 9\/11 began with the disrespect that some Muslims felt when American solders flew overhead with their feet hanging out of helicopters. Believe me, I was there, and I saw it. Another story says that one man was treated poorly when visiting Hawaii — just before Pearl Harbor. Apparently the information that he brought back to Japan helped spark the attack.<\/p>\n\n\n\n<p>I find that it takes a lot for a person to die: a small virus or cancer cells multiply until they finally take their toll. Or some trauma may overtake an individual. Yet, I find that it may take just a few words to either build someone up or tear them down. This is why it is so important that we choose our words — and our attitude towards others — very carefully.<\/p>\n\n\n\n<p>As adults, we have a big responsibility for the way we treat, not only other adults, but children as well. The things that we show them, the things that we do with and to them become their compass for deciding what is normal. If we kindly show others the things that we should, with love and patients, they are likely to pick up on our case. However, if we abuse our powers, they are likely to pick up on that, too, and their compass may be forever skewed.<\/p>\n\n\n\n<p>As believers in and followers of Jesus, we care commanded to love one another. Yet, it is not something that we ought to do out of obligation but out of a willing heart. John 13: 34-35 tells us, “A new commandment I give unto you, That ye love one another; as I have loved you, that ye also love one another. By this shall all men know that ye are my disciples, if ye have love one to another.”<\/p>\n\n\n\n<p>However we treat others is up to us. We have the choice whether we act in love towards others or not. We also have the choice on whether we accept that little “gifts” that others give us or not. Remember however that ultimately, God is judge.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Who do you think you are?”, words often spoken in an angry tone. No, really, who are you? It’s a legitimate question. It’ is a question that, however, is not addressed nearly often enough. We just kind of assume that we know the answer without&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/who-are-you-who-who-who-who\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":422,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,26,25,41,46,51,35,47,29],"tags":[3],"class_list":["post-421","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotional","category-emotions","category-faith","category-family","category-friends","category-personal-growth","category-question","category-relational","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/421","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=421"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/421\/revisions"}],"predecessor-version":[{"id":423,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/421\/revisions\/423"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/422"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}