{"id":427,"date":"2023-02-06T12:03:23","date_gmt":"2023-02-06T12:03:23","guid":{"rendered":"https:\/\/llgt.cafe\/?p=427"},"modified":"2023-02-06T12:03:23","modified_gmt":"2023-02-06T12:03:23","slug":"dna-diablo-not-answer","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/dna-diablo-not-answer","title":{"rendered":"DNA: Diablo Not Answer"},"content":{"rendered":"\n<p>So, here’s a question: I’m told that we carry a lot in our DNA. I’ve heard that even parts of our personality can be found in an individual’s DNA. I’ve also heard that trauma can affect an individuals DNA that can passed down generation after generation.<\/p>\n\n\n\n<p>So, my first question is this: if both sides of a family suffered trauma — say WWII for example and the killing of millions of the people of at least one of them, might this DNA be passed on to following generations?<\/p>\n\n\n\n<p>Here’s another question? How far might this DNA go back? Adam must have been traumatized when he was evicted — by God himself — from the only land he had ever know. How about Eve? I mean, I really hate snakes.<\/p>\n\n\n\n<p>Able received a fatal head trauma and I doubt he recovered from that. Could that still affect modern medicine as we know it today? I don’t know.<\/p>\n\n\n\n<p>Jacob had to leave his fairly and forfeit everything that he had worked so hard to steal from his brother. He did get his dad’s blessing, but you cannot pack that in carry on. Then, in turn, he was tricked by another family member. And his wife nearly died after she stole the family gods. Plus, he had his brother to deal with on the journey home — the one that never happened.<\/p>\n\n\n\n<p>David lost at least two sons and had a man killed mob style after David slept with his wife. I know the guilt was eating him alive. And don’t forget King Saul who had to have gotten really ticked at times: enough to try to hunt down and kill young David — all because of a little envy and greed.<\/p>\n\n\n\n<p>Here’s a question or two: you have no doubt seen the nude statue of young David. It’s a nude and larger than life. Did he pose for that, and would it be considered child abuse? Just kidding. The statue came long after David died and there would be no surviving pictures from that time.<\/p>\n\n\n\n<p>There are others: Daniel had to face the lions. Moses killed a nan and had to leave everything that he was familiar with. Mary had to face her family with unexpected news. Many were killed, and that has to have an affect on someone’s life.<\/p>\n\n\n\n<p>In high school, I had a very wise vice principal who once asked me how I managed to, not only graduate with honors but receive an invitation to intern in Washington DC. I don’t know the answer to either one. My mom wouldn’t let me take the internship.<\/p>\n\n\n\n<p>We can look at these events in horror — letting the adrenal gland overpower our emotions (this takes about a minute, I hear). That’s one option. Or we can stop and, after taking a deep breath ask ourselves if what we think we are experiencing is real or not. Or we can thank God for protecting us from what might have happened. In particular, I’m thinking of a car that nearly ran me over. I was in the crosswalk and the driver made an illegal turn. But it happened so quickly, that I had no time to react. Yes, God was watching out for me and I knew it.<\/p>\n\n\n\n<p>You see, as I told Sandy, hurt people hurt people. If someone hurts me — or in the case of the transfer of information through DNA — if someone hurt my mom or dad, I might suffer for it. Might I, in turn make others suffer for what my parent had experienced. It’s a valid question and is worth at least a moment of pondering.<\/p>\n\n\n\n<p>I believe, though it’s not stated in the Bible, is that what that small piece of fruit might have done was to change the DNA of man and woman. I believe that Adam missed what he had so much that his loss was very traumatic. Did Adam and Eve eventually part ways after a big fight?<\/p>\n\n\n\n<p>I also believe that when we are born again — and Jesus did say that we “must” be born again — that God somehow renews our DNA. The Bible does call the believer a “new creation.” What does this mean, you may ask? It means that we don’t have to follow our own inclinations to do evil. Now, we may still choose evil but, even as a believer, there will be consequences. Believe it or not, they now now that even premarital sex can lead to pregnancy. No lie.<\/p>\n\n\n\n<p>So, what do we do with all of this information? If we not born again, a good place to start with is a prayer of repentance. A simple “God help me” will suffice, if it comes with faith that God actually will help. If, however, you are praying “God, help me win the $100 million dollar lottery,” you’re on you own.<\/p>\n\n\n\n<p>If you are a believer, a prayer of thanksgiving will do wonders. I was helping direct traffic at church on Sunday. Soon, I was doing a signaling motion that resembled that of a music conductor and I thought to myself: “They’re playing God’s songs, these cars they are.”<\/p>\n\n\n\n<p>I like to keep all questions till later — keeping them in the back of my mind until I’ve had time to sort them out. That’s how I often work best. After all, there may be a simple answer to the questions that I’ve so long pondered. I put everything out on the table — so to speak — until I’m able to mentally process it. This is an exercise that can take longer than anyone might anticipate, depending on one’s openness to the Holy Spirit. I’m working on it. I am, after all, a work in progress. I thank God that he uses a work in progress or W.I.P. like me and not a whip.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So, here’s a question: I’m told that we carry a lot in our DNA. I’ve heard that even parts of our personality can be found in an individual’s DNA. I’ve also heard that trauma can affect an individuals DNA that can passed down generation after&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/dna-diablo-not-answer\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":428,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,19,15,26,25,16,30,50,39,13,51,35,47,14,29],"tags":[8,7,3],"class_list":["post-427","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-education","category-emotional","category-emotions","category-faith","category-health","category-how-to","category-humor","category-ideas","category-open-for-discussion","category-personal-growth","category-question","category-relational","category-spiritual","category-think-about-it","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/427","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=427"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/427\/revisions"}],"predecessor-version":[{"id":429,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/427\/revisions\/429"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/428"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}