{"id":431,"date":"2023-02-07T14:41:04","date_gmt":"2023-02-07T14:41:04","guid":{"rendered":"https:\/\/llgt.cafe\/?p=431"},"modified":"2023-02-07T14:41:04","modified_gmt":"2023-02-07T14:41:04","slug":"would-you","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/would-you","title":{"rendered":"Would You?"},"content":{"rendered":"\n<p>Here’s a question, and I’ve brought up this subject in a previous post (it may or may not still be available): would you recognize a slave? How about this one: would you know the difference between someone who is being emotionally, sexually or physically abused? Would you know a victim of sex trafficking if you saw one?<\/p>\n\n\n\n<p>I know I wouldn’t. If fact, I think it would be really had for any of us. Whole organizations spend countless hours searching for victims and their victimizers. Sadly, you don’t have to look any further than the US\/Mexico boarder. One friend told me of a group that he had worked with that would go into a scene and — vigil anti style — clean up an area. In the end, all of the bad guys may be dead, but the victims — often little children — would be free. God loves little children.<\/p>\n\n\n\n<p>You see, a good guy may seem to have evil intentions, while a bad guy may seem to have good intentions. Only God can tell the difference and, in his eyes, the results are the same.<\/p>\n\n\n\n<p>The reality is that, in one way or another, each and every one of us serve one master or another. Let me explain.<\/p>\n\n\n\n<p>Matthew 6:24 (KJV) tells us that “No man can serve two masters: for either he will hate the one, and love the other; or else he will hold to the one, and despise the other. Ye cannot serve God and mammon.”<\/p>\n\n\n\n<p>These are Jesus’ words and I know this because they are in red. It could be a money, but it could also be a job, a car, a relationship: even a ministry. It’s anything that controls us rather than us controlling it. We, ourselves, have to figure out the answer to this question ourselves. What God wants is for us to trust him with our lives and to love him so much that it is the desire of our heart to serve only him. After all, only a creator could know what’s best for his creation.<\/p>\n\n\n\n<p>The sad truth is that the sex slave trade and human trafficking have moved underground, so it’s harder to find. And it moves around from place to place. And, on top of that, different countries are either importing or exporting sex trafficking and it’s hard to know these days which ones are which.<\/p>\n\n\n\n<p>The good news is this: wherever you find yourself, you can turn to God. Whoever you are, you can ask God for help and he will hear you. Just say, “God, help me.” And, guess what, he will move heaven and earth to get you the help you need.<\/p>\n\n\n\n<p>Say, for example, you see a woman begging for money on a local street corner. What do you know about her. You may see that she is young, or that she is aged, worn by life and it’s circumstances. She may be alone or, if she’s one of the lucky ones, she may have another adult with her. She may, on the other hand, have a small child with her. What do you know? More importantly, what do you do. You may find yourself in quite a difficult situation and the sad thing is that you may not even know it.<\/p>\n\n\n\n<p>I know a woman who walks the same bicycle path that I do. She has a place to live, an adult daughter, at least one dress and little else. But she shares the story of how God has changed her life and she loves Jesus.<\/p>\n\n\n\n<p>That said, how can you ever help someone else. The story of the good Samaritan may help answer that. You see, you can’t really blame the priest or the Rabi. They were only going along, doing their own business, just trying to live life. But the good Samaritan — spoiler alert: it’s Jesus — comes along. He doesn’t pass on the other side of the street. He doesn’t call 911. He doesn’t ask you if you need help or even offer you a cheeseburger. What Jesus does is pick us up — after all, there’s nothing that we can do — he put us on his ride and made the journey on foot so that he could put us up for the time needed for us to recover, however long it took. That’s the love of God that he has for us — all of us.<\/p>\n\n\n\n<p><strong>“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” —John 3:16 (KJV)<\/strong><\/p>\n\n\n\n<p>Where do you find yourself. You may try to help others, but as they tell you at the beginning of each flight, you have to start with yourself, wherever you may be. The good news is that you don’t have to stay there. Jesus loves you; he loves you way too much to let you remain a slave to sin — whether it’s you sin, the sin of a family member or the sin of someone you don’t even know. Jesus really does love you and he was willing to hang on a cross to prove it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Here’s a question, and I’ve brought up this subject in a previous post (it may or may not still be available): would you recognize a slave? How about this one: would you know the difference between someone who is being emotionally, sexually or physically abused?&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/would-you\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":432,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[35,14,29],"tags":[3],"class_list":["post-431","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-question","category-spiritual","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/431","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=431"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/431\/revisions"}],"predecessor-version":[{"id":433,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/431\/revisions\/433"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/432"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=431"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=431"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=431"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}