{"id":434,"date":"2023-02-09T13:24:47","date_gmt":"2023-02-09T13:24:47","guid":{"rendered":"https:\/\/llgt.cafe\/?p=434"},"modified":"2023-02-09T13:24:47","modified_gmt":"2023-02-09T13:24:47","slug":"having-both-mission-and-passion","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/having-both-mission-and-passion","title":{"rendered":"Having Both Mission and Passion"},"content":{"rendered":"\n<p>Whether you have a job, a business of your own, or just a hobby that helps you pass your time, it’s good to have both a mission and a passion. Mission is simply your reason for doing what you do, while passion is what helps get you out of bed even before you’ve had your coffee or need to go to the bathroom.<\/p>\n\n\n\n<p>You can mission without passion, but it is not likely that you will have passion without a mission. The best case scenario is that you would have a mission, that you have a great deal of passion and that the two are on the same path. The worst case would be that you have neither mission or passion.<\/p>\n\n\n\n<p>The fact is that passion can come and go, as it tends to be built on our feelings. Mission, whatever it is, does not change. My mission is to do whatever I do as unto the Lord, and to bring him glory. It’s not about making myself or anyone else happy. If God puts me somewhere, it’s either because that is where he wants to use me, or because he wants to show me that I need to work on building a different path.<\/p>\n\n\n\n<p>What is your mission, and what gets you going? Maybe it’s a hobby. Maybe you write short stories, or create beautiful songs. Maybe you serve others. Maybe you are still looking for an answer to these questions. There’s certainly noting wrong with that.<\/p>\n\n\n\n<p>One thing that you can do at any age is to write down your goals. Your goals can change over time, but that’s okay. You may find it helpful, as I have, to start off by writing the things that you do not want, and then writing the opposite of that. “I do not want to be poor” becomes “I want to be rich”, and “I don’t want to work for a large corporation might become either “I want to work for a small business” or “I want to start my own business.” Make certain to be specific, and you are more likely to be able to measure your goal if it is both quantifiable and time sensitive.<\/p>\n\n\n\n<p>Once you know what you want to do and you have well defined goals, break down into goals steps that can either be done once and marked off of the to-do list, or can be turned into daily tasks or even into habits. Take care of as many of the things that you can that just need to be done once, but also begin to figure out how you can turn routine items into habits. There may be just one item that you will be doing daily, and it may be something that you enjoy. For other things, it may be a little harder, and you may have to set up a mental cue.<\/p>\n\n\n\n<p>It may take time, but you can set up habits that will take you, not where someone else wants to go, but where you want to go. If you do something because it is something that you want to do, rather than because you have to do it, it is likely that you are going to be more passionate about what you are doing, and it will be less of a struggle to get out of bed. Believe it or not, it’s possible to look forward to waking up at 4 in the morning.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you have a job, a business of your own, or just a hobby that helps you pass your time, it’s good to have both a mission and a passion. Mission is simply your reason for doing what you do, while passion is what helps&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/having-both-mission-and-passion\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":435,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17,44,28,19,53,40,52],"tags":[3],"class_list":["post-434","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-business","category-career","category-creativity","category-education","category-hobbies","category-making-money","category-photography","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/434","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=434"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/434\/revisions"}],"predecessor-version":[{"id":436,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/434\/revisions\/436"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/435"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=434"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=434"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=434"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}