{"id":437,"date":"2023-02-10T18:20:26","date_gmt":"2023-02-10T18:20:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=437"},"modified":"2023-02-10T18:20:26","modified_gmt":"2023-02-10T18:20:26","slug":"better-yet","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/better-yet","title":{"rendered":"Better yet"},"content":{"rendered":"\n<p>Believe it or not, there may be something greater than having a lot of money, and that is the wisdom of knowing what to do with that money.<\/p>\n\n\n\n<p>You may come across a lot of money at some point in your life but, if you lack the wisdom of knowing what to do with that money, it’s not likely to be around for very long. And if you lack the wisdom in your finances, it’s just at likely that having more money may be more trouble than it’s worth. Remember that money is nothing more than a tool, an indicator of where our heart is.<\/p>\n\n\n\n<p>It may not be a lack of wisdom, though. It may be a lack of direction. And without a sense of direction, we are likely to waste our resources, going in every direction.<\/p>\n\n\n\n<p>In order to find direction, we need to know where we want to go, and we need to know from where we are starting. After figuring out these two things, we need to create a plan that will take us from where we are to where we want to go.<\/p>\n\n\n\n<p>Believe it or not, the bills that we need to pay first aren’t the credit card companies or even the rent, food, or the phone bill. The first bills that we need to pay are our tithe and ourselves. I know exactly how hard it is to do this, as I almost never pay myself, and all too often, I fail to tithe. It’s not that I don’t want to do either, but it’s easy to think that I will pay myself if there is anything left over at the end (and there never is), and that God can handle things for a while.<\/p>\n\n\n\n<p>The easy part is figuring out where you want to go. The next part is almost as easy, and it’s to create a budget. But remember that you have to include everything. If you don’t include everything, you are much less likely to stick with the budget that you have created.<\/p>\n\n\n\n<p>At some point, you will need to figure out where you are. You can do that, now, or you can wait till you have an emergency fund set up. This emergency fund should contain at least $1,000 or three or more months of living expenses. No, it’s not easy, but it won’t be easy getting by if you don’t have the money and an emergency arises. I never studied law, but Murphy’s Law states that “emergencies will often happen at the worst possible time.”<\/p>\n\n\n\n<p>The hardest part is actually sticking to the budget that you have carefully crafted. You may find it helpful to print out a copy or to write it on an index card so that you can carry it around with you. Better yet, use cash for things like groceries, travel expenses and entertainment. Don’t reach for the bank card unless you have money in your account earmarked for the item or items that you are purchasing, and never use a credit card for conveniences.<\/p>\n\n\n\n<p>Another tip, if you are able to do so is to have an automatic payment go either to savings or to another account. This is something that you can do once and forget, and it will be one less thing that you will have to worry about.<\/p>\n\n\n\n<p>One warning: No amount of money, whether it be small or great, is worth loosing your eternal soul. it’s not that having money will cost you your soul but, rather, being self sufficient can blind people to their need for a Savior.<\/p>\n\n\n\n<p>It’s easy to get stuck in the trap of never having any money, and it’s a hole that can be hard to dig out of, especially if there is the added weight of debt and\/or the increased cost of living. Add to that, the fact that many of us have lost our jobs or are going back to jobs with either lower wages or reduced hours, and it makes the work all the more difficult. Just remember that difficult does not equate to impossible and, if you work at it long enough and with enough determination, nothing is impossible.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Believe it or not, there may be something greater than having a lot of money, and that is the wisdom of knowing what to do with that money. You may come across a lot of money at some point in your life but, if you&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/better-yet\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":438,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,25,30,39,38,51,14,29,45],"tags":[3],"class_list":["post-437","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-faith","category-how-to","category-ideas","category-money","category-personal-growth","category-spiritual","category-think-about-it","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/437","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=437"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/437\/revisions"}],"predecessor-version":[{"id":439,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/437\/revisions\/439"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/438"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=437"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=437"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=437"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}