{"id":440,"date":"2023-02-11T18:36:03","date_gmt":"2023-02-11T18:36:03","guid":{"rendered":"https:\/\/llgt.cafe\/?p=440"},"modified":"2023-02-11T18:36:03","modified_gmt":"2023-02-11T18:36:03","slug":"dining-out","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/dining-out","title":{"rendered":"Dining Out"},"content":{"rendered":"\n<p>Where is your favorite place to dine out? Maybe you prefer having your food delivered to your home. Either way, it can be nice to not have to cook or clean up afterwards.<\/p>\n\n\n\n<p>There may be certain things to consider, like, how many people will be eating. If there is more than one person, what are the ages. Budget limits can also come into play.<\/p>\n\n\n\n<p>The burger is probably the most common food item sold in the United States. Americans consume somewhere around 50 million burgers each year, while the rest of the world prefers things like Jerk Chicken. Want fries with that? The average burger will cost from between $3 and $9 USD. I ate at the Hard Rock Cafe in London once and it cost closer to $20, but it did come with a salad.<\/p>\n\n\n\n<p>Walmart is likely still the biggest seller of fried chicken in the US. I don’t really care whether it’s associated with any particular race. I grew up, the youngest of five, living in NW Arkansas. I can pick the meat off of a piece of chicken as good as anyone. They do have carryout, and you can get delivery though a third party.<\/p>\n\n\n\n<p>Maybe you prefer pizza. There are lost of places to choose from, though one of my favorites, Rocky Rococo’s, recently closed it’s restaurant in Spokane, Washington. About the only pizza place that doesn’t deliver is Costco or Sam’s Club. It seems the larger the chain, the lower the quality of the pizza. Just saying.<\/p>\n\n\n\n<p>There’s also Mexican food, and the taco or burrito are always good options. Usually, you can get a full meal for $5 or less if you go to one of the national chains. You may want to avoid this option if you are trying to stay away from beans, but I find Mexican food to be a good treat now and then.<\/p>\n\n\n\n<p>If you want spicy, but want something a little different, there’s also Asian cuisine. It could be Japanese, Chinese, or Thai. There is also what seems to be a recent boom in Korean foods. Dishes include General Tso’s, sweet and sour and a variety of soups.<\/p>\n\n\n\n<p>We can’t forget Indian foods, which are some of the most popular dishes around the world. Indian dishes. Indian and Jamaican dishes tend to come form sit-down style restarts, but you can still get carry out.<\/p>\n\n\n\n<p>Perhaps you prefer a place that sells steak or fresh fish, the real kind, not mechanically tenderized or or breaded and fried. The kind that comes with a real soup or salad, or some other appetizer: perhaps even an amuse. I still remember going to Wises Cafeteria in New Orleans, Louisiana every year with my family and grandparents.<\/p>\n\n\n\n<p>Food is entirely regional. You won’t find the smokehouses in Rocky Mountains like you will in the Ozark Mountains, and you won’t find the BBQ like you will in places like Texas and New Mexico. Tacos are likely to be better in places where they actually know how to make them, and you won’t find fried catfish like you do in the south.<\/p>\n\n\n\n<p>I found a great little deli in Spokane called Sonnenberg’s. They have the some of the freshest meats and often at some of the best prices. The even have some of the best British Bangers around. Now and again, I will dine out, but you know what they say; home is where the pans are.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Where is your favorite place to dine out? Maybe you prefer having your food delivered to your home. Either way, it can be nice to not have to cook or clean up afterwards. There may be certain things to consider, like, how many people will&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/dining-out\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":441,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,39],"tags":[3],"class_list":["post-440","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-ideas","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/440","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=440"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/440\/revisions"}],"predecessor-version":[{"id":442,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/440\/revisions\/442"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/441"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=440"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=440"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=440"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}