{"id":453,"date":"2023-02-13T17:19:26","date_gmt":"2023-02-13T17:19:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=453"},"modified":"2023-02-13T17:19:26","modified_gmt":"2023-02-13T17:19:26","slug":"gods-handiwork","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/gods-handiwork","title":{"rendered":"God&#8217;s Handiwork"},"content":{"rendered":"\n<p>This morning, as I walked out in the dark of night to drive to work, I took a moment to gaze up into the sky and admire the beauty that I had so often seen at other times in my life, in other parts of the world.<\/p>\n\n\n\n<p>As you probably already know, I grew up next to the University of Arkansas where I was able to do far more than just become a Razorback fan. One summer, I decided to take World Literature and Astronomy at the same time. This was when I was told that I couldn’t write (well). I made a C, if I remember correctly, or maybe it was a B, in World Lit and dropped out of the Astronomy class. I guess you could say that it was a bit over my head. I did stay in the Astronomy Lab class and actually did very well in it.<\/p>\n\n\n\n<p>Because of the University of Arkansas, we — my family and I, along with the other students that I went to school with —had access to telescopes as well as a planetarium. Like many photographers, one of my main interests was astrophotography and, though I delivered newspapers, the equipment necessary to attach my camera to a telescope or to track stars for longer exposures always seemed out of reach.<\/p>\n\n\n\n<p>According to space.com, “There are 88 officially recognized constellations in the sky.” Genesis tells us that the sun, moon and stars were created for signs and seasons, but it was the Greeks who are the first known students of Astronomy, giving the constellations names after their gods.<\/p>\n\n\n\n<p>Not to be confused with astrology, there are still questions about what is out there, in spite of the years of study. At least now, we have a much better understanding of just how big the universe is. And wither you believe in evolution or creation, objects from space have clearly had a major impact on this planet.<\/p>\n\n\n\n<p>Space captures our imagination and can keep us awake at night. I’ve seen the movies, and I’ve seen the magazines at the checkout stands. Who can forget “Star Trek” or “Star Wars”? One of the first movies created was of a rocket launch to the moon, years before we actually sent astronauts to the moon. “Capricorn One ” was probably my favorite movie when it came out in 1978. And I might have finished reading the book if I hadn’t left it out in the rain. “Greenland” seems like it might be a good movie, but it seems way too intense. I’m hoping that they come out with a book for that movie, but nothing yet.<\/p>\n\n\n\n<p>Whatever you think about what is out there, or where you stand on space exploration, it’s clear that, wherever you live, we can all enjoy the beauty of the night sky. The view may have not changed over the years, but the beauty of the night sky never grows old, and there is still much to learn.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This morning, as I walked out in the dark of night to drive to work, I took a moment to gaze up into the sky and admire the beauty that I had so often seen at other times in my life, in other parts of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/gods-handiwork\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":454,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,29],"tags":[3],"class_list":["post-453","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/453","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=453"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/453\/revisions"}],"predecessor-version":[{"id":455,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/453\/revisions\/455"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/454"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=453"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=453"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=453"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}