{"id":460,"date":"2023-02-15T17:48:07","date_gmt":"2023-02-15T17:48:07","guid":{"rendered":"https:\/\/llgt.cafe\/?p=460"},"modified":"2023-02-15T17:48:07","modified_gmt":"2023-02-15T17:48:07","slug":"only-time-will-tell","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/only-time-will-tell","title":{"rendered":"Only Time Will Tell"},"content":{"rendered":"\n<p>The way that people have earned a living and made a life for themselves may have changed over the years but the one thing that remains is that a person needs a skill and a group of people who are willing to pay for that skill.<\/p>\n\n\n\n<p>It used to be that acting was thought of as a lower skill, drug dealing was a job of the pharmacist and soft drink companies, and farming, hunting or fishing were the main ways to make money. It may have been the founder of McDonald’s who actually started the idea of real estate investment. Stock trade was initially something only available to those who already had money.<\/p>\n\n\n\n<p>The industrial age made it possible to have large groups of people do a job for a single person, usually the one with the most money to invest, or the one who took the largest risk in starting the business. Shipping already existed, but the introduction of the interstate highway after WWII took farming out of most communities and drove the masses into larger cities.<\/p>\n\n\n\n<p>Television and movies brought more prestige and a lot more money to the art of acting, while the internet made it possible for anyone in the world to not only communicate with anyone else in the world but to sell products to anyone in the world.<\/p>\n\n\n\n<p>Colleges and universities made it possible to shape whole generations, changing both the morality and the focus of many who entered and left these institutions. Some left better off then when they went in, some left worse off, while many just never changed.<\/p>\n\n\n\n<p>All stores used to be family owned. Now, we have national chains that are owned in part by one family or even one individual as well as any number of investors. The same can be said about most companies. More recently, companies in one country are being purchased by people in other countries.<\/p>\n\n\n\n<p>More and more, companies are focused on doing the things that will bring them the most money, and will create the most profit for investors and owners. When Sam Walton started building Walmart, it was his dream to bring the amenities found in larger cities into the smaller towns across America. Once Walmart became a publicly traded company and, especially after the death of Sam Walton, the purpose of Walmart seemed to be to put most of their competition out of business. Now, Amazon is poised to do pretty much the same thing. But there’s still enough of an ocean, even for the smaller fish.<\/p>\n\n\n\n<p>It will be interesting to see what comes next. Fear of the end of the world has driven many to make unwise decisions over the years, and a bad day at the office can wipe out years of savings. Feeding the industry of killing seems to be the only sure way to make a living, no matter what happens, and even the future of the medical industry is in question.<\/p>\n\n\n\n<p>One of the musicians at church was telling me that, after retiring, he lost the ability to sleep in. It seems that one thing will never change: we all need a purpose. For some, it’s being a parent, for others, it’s just to get by. Some find purpose in using whatever skill they have, while others find purpose in serving others. There are still some who find purpose in taking the risks that others aren’t willing to take. it used to be that one might risk his or her own life as part of building a new life. Now, it’s more likely to be our faith that puts our lives at risk. One thing remains true; the power that we give over things to give us life and prosperity is also a power that can take those things away.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The way that people have earned a living and made a life for themselves may have changed over the years but the one thing that remains is that a person needs a skill and a group of people who are willing to pay for that&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/only-time-will-tell\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":461,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,29],"tags":[3],"class_list":["post-460","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/460","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=460"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/460\/revisions"}],"predecessor-version":[{"id":462,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/460\/revisions\/462"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/461"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=460"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=460"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=460"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}