{"id":478,"date":"2023-02-18T17:37:42","date_gmt":"2023-02-18T17:37:42","guid":{"rendered":"https:\/\/llgt.cafe\/?p=478"},"modified":"2023-02-18T17:37:42","modified_gmt":"2023-02-18T17:37:42","slug":"how-big-is-god","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/how-big-is-god","title":{"rendered":"How Big is God?"},"content":{"rendered":"\n<p>Do you suppose there is an angel of the month award in Heaven?<\/p>\n\n\n\n<p>Personal as well as spiritual growth begins, not with answers, but with questions. As a child, I wanted to know who came first, Jesus or Santa. I wanted to know if aliens were friendly, and how long it took light to travel from the sun to the earth. I wanted to know why, when we traveled to see grandparents for Christmas, did my pets always seem to die while we were gone, when I clearly told God that I did not want them to die. I had all sorts of questions.<\/p>\n\n\n\n<p>It seems that, after the fall, God chose to reveal himself a little bit at a time and, over time, the Bible reveals the names of God, each displaying a part of his character. Besides George Burns, God is known as YHWH, El, Eloah, Elohim, Elohai, El Shaddai and a bunch of others. When Moses wanted a name to give the Egyptians, God said “Tell them I AM sent you.”<\/p>\n\n\n\n<p>At the same time the world was getting to know it’s God, or turning away from him, we were just getting to know and understand our universe.<\/p>\n\n\n\n<p>Several times, the Bible speaks of an unseen world, telling us that is seen comes from that which is unseen and “lean not on your own understanding.” Is there something else out there, something that we cannot see? When I look at the night sky, all I can see is the moon, stars and planets. I’ve seen the norther lights a few times and a few shooting stars, but I’ve never seen the angels that have been portrayed in numerous paintings.<\/p>\n\n\n\n<p>So, how big is God? We know that Jesus is part of the trinity: Father, Son and Holy Spirit. We know that Jesus walked on the earth at different times in history, and that the Spirit hovered over the Earth. We are also told that God the Father is invisible and that no man has seen him, but do we really know or understand how big God is.<\/p>\n\n\n\n<p>We’re told that angels can be big enough to put one food on each of the coasts of the United States, while a thousand may fit on the head of a needle. I’m not sure how you measure that, or where you find that in the Bible.<\/p>\n\n\n\n<p>Science tells us that angels are really aliens, and Christianity tells us that aliens are really fallen angels. Sandy used to tell me about the angel that stayed with her after she was struck by a car and nearly died. No one else could see him, but he stayed with her in the hospital and in her home while she recovered.<\/p>\n\n\n\n<p>So, how big is God? We may not know for sure in this lifetime. While some theories point to an alternate universe, or a dimension outside our own, I tend to think that we might be blinded to the things that might be right in front of us. It could be that God inhibits the universe, or it could be that God inhabits a space and time separate from that which he has created. The Bible says that the Earth is God’s footstool. This morning, as I gazed into the stars, wondering what might be out there, I wondered, could the universe just be God’s thumb print?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you suppose there is an angel of the month award in Heaven? Personal as well as spiritual growth begins, not with answers, but with questions. As a child, I wanted to know who came first, Jesus or Santa. I wanted to know if aliens&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/how-big-is-god\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":479,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,13,35,14],"tags":[33,8,7,5,3],"class_list":["post-478","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-open-for-discussion","category-question","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/478","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=478"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/478\/revisions"}],"predecessor-version":[{"id":480,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/478\/revisions\/480"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/479"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=478"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=478"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=478"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}