{"id":495,"date":"2023-02-19T17:34:50","date_gmt":"2023-02-19T17:34:50","guid":{"rendered":"https:\/\/llgt.cafe\/?p=495"},"modified":"2023-02-19T17:34:50","modified_gmt":"2023-02-19T17:34:50","slug":"temporary-sanity","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/temporary-sanity","title":{"rendered":"Temporary Sanity"},"content":{"rendered":"\n<p>The relationships that we choose as well as the ones that we choose, or the ones that choose us, have the ability to stir us emotionally. But we should not let our emotions control our relationships.<\/p>\n\n\n\n<p>It wasn’t my emotions that caused me to ask Sandy to marry me back in 2011. It was because I believed that this was what God wanted. It was trust and faith. The emotions came, but not until later.<\/p>\n\n\n\n<p>Too often, we let our emotions control our relationships. The problem is that, no matter how much we know about any given situation, our knowledge is always going to be incomplete. It’s easy to give up on others, or even to give up on ourselves, but we only hurt ourselves when we do.<\/p>\n\n\n\n<p>Self control is an art, and it is something that we have to continue to work on throughout our lives. We have to, one, know what it is that we want and, two, want it enough to commit to staying on the right path. In the case of relationships, we need to communicate, which begins with asking the right questions and listening to the answers. Not only that, but we need to hear what’s not being said and ask even more questions.<\/p>\n\n\n\n<p>A moment of rage can be devastating, ending the life of one and forever changing the life of another. And it could all be avoided with a little self control. A friend who was actively involved in Chicago’s told me that many a life have been forever changed by actions that took less than a minute.<\/p>\n\n\n\n<p>We can, however, choose to do what’s right. We don’t have to be in such a hurry to get our own way, and we can be concerned about the needs of others, even putting other’s needs above our own. We may not feel love for someone right now, but we can act in a loving way, making the needs of others equal to our own needs. It’s not always easy, but it is a choice that we can make.<\/p>\n\n\n\n<p>“Always do what’s right, no matter what everyone else is doing.” That is one of the lessons that I learned in basic training. It had more to do with marching, but it is an idea that should apply to our whole lives. And, though I have failed many a time, that doesn’t mean that it isn’t a rule that I at least try to apply.<\/p>\n\n\n\n<p>On top of doing right, I do my best to apply the golden rule of doing unto others as I would have them do unto me, and love others as I love myself. If you looked at my whole life, you would see that I’ve only applied these rules a very small percentage of my life. Perhaps it’s my age. Perhaps it’s the experience that life provides. If I think I’ve somehow “gotten there”, it most likely indicates that I have no idea where there is.<\/p>\n\n\n\n<p>Can we feel strongly about a relationship? Yes, we can and we should. But we can also allow our emotions to blind us to the truth. And we can allow our temporary emotions to lead us down the wrong path. Remember, the things that we think are true now may not be so apparent at some point in the future. And the truth the we share now may turn out not to be true at all.<\/p>\n\n\n\n<p>We can’t keep ourselves from never making a mistake. It’s pointless to try. The only way to never make a mistake is to never do anything of any significance. But we can learn from our mistakes, and we can learn to stop torturing ourselves when we make a mistake.<\/p>\n\n\n\n<p>One that that I learned is that it’s easy to make mistakes. That’s why I usually get a second opinion, especially if I am thinking about offering advice to someone else. Too often the ones who offer the most advise are the ones who have no working experience in a given area. But we can be patient. Often, even the worst advise can be offered in love.<\/p>\n\n\n\n<p>I think that one of the worst feelings comes from opportunities lost. One such instance came when I was spending time with two little children. One was more outgoing, while the other had suffered emotional and physical abuse. When the one came up for a hug, the other turned and went on his way. I wish I had done more to let this little boy know that he, too, was loved. In another instance, I came across a friend who had made a mistake. We hadn’t talked about it, but you could see the shame as he passed by. I wish that I had stopped him, given him a hug<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The relationships that we choose as well as the ones that we choose, or the ones that choose us, have the ability to stir us emotionally. But we should not let our emotions control our relationships. It wasn’t my emotions that caused me to ask&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/temporary-sanity\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":496,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,41,46,47,29],"tags":[3],"class_list":["post-495","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-family","category-friends","category-relational","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/495","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=495"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/495\/revisions"}],"predecessor-version":[{"id":497,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/495\/revisions\/497"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/496"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=495"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=495"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=495"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}