{"id":513,"date":"2023-02-22T18:26:33","date_gmt":"2023-02-22T18:26:33","guid":{"rendered":"https:\/\/llgt.cafe\/?p=513"},"modified":"2023-02-22T18:26:33","modified_gmt":"2023-02-22T18:26:33","slug":"want-to-live-a-long-life","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/want-to-live-a-long-life","title":{"rendered":"Want to live a long life?"},"content":{"rendered":"\n<p>A lot of years ago, back when I was still in high school, I heard a story about a pilot who, when faced with loosing his own life or allowing his plane to crash into a crowd of onlookers, chose to stay with his plane and give up his own life. Back in his locker, as the story goes, they found a note that simply read, “I’m third.”<\/p>\n\n\n\n<p>It’s a story that I’ve taken with me and, though it is unlikely that that I will ever find myself in a failing aircraft, facing the choice of my life or the lives of others, there is something that can be learned from this story.<\/p>\n\n\n\n<p>Perhaps it’s something new or, more likely, it’s just a cycle that we’re going through. Slowly we begin to loose respect for life. It begins with those most in need: the elderly, the poor, those with special needs and the unborn. Not that I have anything against the American Bald Eagle, but when a person can serve more time for killing a Bald Eagle than for killing another human being, it seems that something just ain&#8217;t right.<\/p>\n\n\n\n<p>Respect is something that has to be taught. It needs to be modeled it has to be demanded, or it won’t be passed on from one generation to the next. Not only do we have to put on a show for all to see but, more and more this seems to be come a me, or an i generation. My feeling is that those who model disrespect for anyone, especially those who do so in a public forum, out to be ashamed. And, yes, it goes both ways. It goes well beyond stimulus checks and money for the airlines. It’s all about the respect that we show or fail to show.<\/p>\n\n\n\n<p>Realize it or not, when we devalue others, we are also devaluing ourselves. You can’t have one without the other. But we’re often so busy demanding our own say, shifting the blame, and wondering when someone else is going to make things right, that we fail to see our own part in the downward trend.<\/p>\n\n\n\n<p>Maybe you were one of the lucky few who had a respect for others modeled for you. Excellent. Are you doing the best you can to model it for others? Believe it or not, showing others respect, even making yourself third, doesn’t in anyway diminish who you are. In fact, it could turn you from an i back to an I.<\/p>\n\n\n\n<p>Exodus 20: 12 (KJV) says, “ Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.” Want to know how to live a long life? Respect others, starting with your parents. It’s pretty simple.<\/p>\n\n\n\n<p>I’m not guaranteeing that anyone can change overnight. It’s taken me years, and I’m still working on building respect, not only for myself, but for others. Some times, it has to begin with forgiving others and, yes, forgetting any wrongs that may have been done to us. But even the longest journey has to begin somewhere.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A lot of years ago, back when I was still in high school, I heard a story about a pilot who, when faced with loosing his own life or allowing his plane to crash into a crowd of onlookers, chose to stay with his plane&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/want-to-live-a-long-life\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":514,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,25,16,30,35,14],"tags":[33,5,3],"class_list":["post-513","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-faith","category-health","category-how-to","category-question","category-spiritual","tag-bible","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/513","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=513"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/513\/revisions"}],"predecessor-version":[{"id":515,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/513\/revisions\/515"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/514"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=513"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=513"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=513"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}