{"id":518,"date":"2023-02-23T17:27:00","date_gmt":"2023-02-23T17:27:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=518"},"modified":"2023-02-23T17:27:00","modified_gmt":"2023-02-23T17:27:00","slug":"a-look-into-the-future","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/a-look-into-the-future","title":{"rendered":"A look into the future"},"content":{"rendered":"\n<p>Say, for example, that we could take a turn on the television and, instead of our favorite show, we were shown what the future might look like. I remember, as a child, seeing images of cars and what we might call bluetooth technology. We were shown home appliances that, either digressed technologically or advanced. And, though we have some of these things, we still don’t have our own huber crafts.<\/p>\n\n\n\n<p>So, knowing what we know now, what might things look like in the distant or not so distant future?<\/p>\n\n\n\n<p><strong>Work<\/strong><br>I think that, in one way or another, most of us will be in sales. The first is those who sell something. Now, whatever we do, we all sell something. My present “day job” is putting together parts small parts for automobiles. Am I selling anything. Yes, I’m selling my boss(es) on the idea that he needs me to continue to work for him\/her.<\/p>\n\n\n\n<p>If we choose not to work, it’s either because we have enough money to make it at whichever level we choose to live or because we “sell” the idea to someone else that they should support us. This includes marriage and, yes, the woman can and often is the one with the income. It also includes support from other family members and it includes government aid or aid from a non-profit organization.<\/p>\n\n\n\n<p><strong>Money<\/strong><br>I see two options for money. One is that there will be “Monopoly” money: money that is fun to look at but not worth much. I have, somewhere in my things, currency from Somalia, Africa. It’s not worth much, but it helps me remember one of the places that I’ve been.<\/p>\n\n\n\n<p>Another possibility is that, like so many other things, money will take some digital form. I don’t think it will have a presidential image or the words “In God We Trust”, but it will be available and transferrable instantly.<\/p>\n\n\n\n<p><strong>Food<\/strong><br>I’m not sure about food. It has been suggested by someone that we get bugs, and I don’t mean “Bugs Bunny.” Though John ate locust and honey in the wilderness, I think I’ll pass on that one. There is already soy options for chicken, beef and cheese. And there are probably other’s that I don’t know about. Note: if you cook with tofu, it has no flavor so you have to add some. Fermented tofu is the only decent option.<\/p>\n\n\n\n<p><strong>Relationships<\/strong><br>It seems that, for several reasons, our relationships are becoming more remote. We can have everything except intimacy via our mobile devices. It’s “safer” to keep our distance. And when it comes to our relationships, many prefer the “microwave” or “try now and, maybe, buy later” options.<\/p>\n\n\n\n<p><strong>Comedy<\/strong><br>Finally, what might comedy look like in the future? For this example, I’ll need my friend, Rolf the Dowg, who is an expert at comedy.<\/p>\n\n\n\n<p>Me: So Rolf, tell us a joke — from the future.<\/p>\n\n\n\n<p>Rolf: So, someone walks into a bar.<\/p>\n\n\n\n<p>Me: and..?<\/p>\n\n\n\n<p>Rolf: That’s it.<\/p>\n\n\n\n<p>Really, we cannot fully predict the future. We can try to shape our own future but choosing what and whom we listen to, but there is so much that we just cannot control. I find that it’s best to do my best and leave the rest up to the God who created all things for His glory and His purpose. I hope you’ll do the same.<\/p>\n\n\n\n<p>If you have a prayer request or just want more information, you can contact me at rolf@llgt.com.  Please put &#8220;Hi&#8221;, &#8220;Prayer&#8221; or &#8220;Question&#8221; in the subject line.  Note: I will never sell your email address.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Say, for example, that we could take a turn on the television and, instead of our favorite show, we were shown what the future might look like. I remember, as a child, seeing images of cars and what we might call bluetooth technology. We were&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/a-look-into-the-future\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":519,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,25,41,43,46,50,39,38,13,35,47,14,29],"tags":[8,3],"class_list":["post-518","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-faith","category-family","category-food","category-friends","category-humor","category-ideas","category-money","category-open-for-discussion","category-question","category-relational","category-spiritual","category-think-about-it","tag-god","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/518","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=518"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/518\/revisions"}],"predecessor-version":[{"id":520,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/518\/revisions\/520"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/519"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=518"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=518"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=518"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}