{"id":521,"date":"2023-02-24T17:15:09","date_gmt":"2023-02-24T17:15:09","guid":{"rendered":"https:\/\/llgt.cafe\/?p=521"},"modified":"2023-02-24T17:15:09","modified_gmt":"2023-02-24T17:15:09","slug":"something-i-hope-to-never-learn","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/something-i-hope-to-never-learn","title":{"rendered":"Something I hope to never learn"},"content":{"rendered":"\n<p>I feel like I’ve learned a lot over my lifetime. There are still things that i would like to learn. Now that I have two coworkers who communicate through sign language, I would lie to earn sign language. I used to know the alphabet, but it’s been way too long and I’ve forgotten what I learned. I have learned hello, how are you, thank you and you’re welcome.<\/p>\n\n\n\n<p>I would like to learn programming but, thus far, I’ve not been able to pick it up on my own. This is because I, at one time, want to create apps to sell in iTunes. Or, I could find a job where I would probably make more money than I have been making.<\/p>\n\n\n\n<p>Not that my head is about to explode from knowledge, but I feel like I’ve learned a lot over the years. Yet, there is at least one thing that, no matter how long I live, I hope that I never learn.<\/p>\n\n\n\n<p>Life has taught me one thing and, in reality, more than once; I have a tendency to be gullible. Gullible: “easily persuaded to believe something; credulous.” In other words, you could put my photo and name by the definition. I wouldn’t say that I foolishly believe everything that I hear, but I do have a tendency to believe that, unless proven otherwise, most people are going to be honest in what they say.<\/p>\n\n\n\n<p>You can look for clues as to when someone is being honest. Not looking someone in the eye is one possible sign, but I tend to look kind of upward and to the side when I’m trying to remember certain things. Telling when someone is lying, it can be really hard at times.<\/p>\n\n\n\n<p>I don’t want to learn not to be gullible. To me, I have one of two choices. I can believe that people are being honest with me, or I can believe that people, in general, are liars. I would rather believe that most people are honest.<\/p>\n\n\n\n<p>Sadly, we’ve grown to expect a certain amount of lying from certain professions and, if not lying, leaving out what might be critical information. Layers, people who sell cars, especially used cars, politicians and weather forecasters probably top the list.<\/p>\n\n\n\n<p>Most of the time, when someone is less than honest with me, I eventually find out. Either someone tells me, or I figure out, myself. Unfortunately, if you confront the person, they are more likely to shift the blame rather than admitting what they did and\/or apologizing.<\/p>\n\n\n\n<p>So, yes, as long as I’m alive, I hope to keep learning, but I hope to never learn to mistrust others, even if I have to suffer a little bit every now and then.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I feel like I’ve learned a lot over my lifetime. There are still things that i would like to learn. Now that I have two coworkers who communicate through sign language, I would lie to earn sign language. I used to know the alphabet, but&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/something-i-hope-to-never-learn\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":522,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[60,41,46,47],"tags":[3],"class_list":["post-521","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-communication","category-family","category-friends","category-relational","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/521","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=521"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/521\/revisions"}],"predecessor-version":[{"id":523,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/521\/revisions\/523"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/522"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}