{"id":524,"date":"2023-02-25T18:46:24","date_gmt":"2023-02-25T18:46:24","guid":{"rendered":"https:\/\/llgt.cafe\/?p=524"},"modified":"2023-02-25T18:46:24","modified_gmt":"2023-02-25T18:46:24","slug":"the-traveling-salesman","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-traveling-salesman","title":{"rendered":"The Traveling Salesman"},"content":{"rendered":"\n<p>Over the years, I’ve heard a lot of things about the traveling salesman: from stories of why one failed where another found success to jokes that I cannot repeat. I remember one story of a traveling vacuum cleaner salesman. After dumping a pile of dirt on a woman’s living room floor and said that, if his vacuum cleaner didn’t pick up all of the dirt that he would eat the dirt himself.<br>The story ends with the woman telling him to enjoy his meal because she had no electricity in her home.<\/p>\n\n\n\n<p>My grandfather was a traveling salesman of sorts. Representing FTD in several states, he was able to visit large a large portion of the United States, going around and taking large orders from florists. Not only was he able to travel and to write off his travel expenses, but he was able to afford a nice home in New Orleans as well as many other things.<\/p>\n\n\n\n<p>The idea of the traveling salesman isn’t new. It had been around for a long time. But, perhaps more than the invention of the automobile, the airplane, or the telephone, one thing has changed the role of the traveling salesman. That one thing is the computer.<\/p>\n\n\n\n<p>You see, my grandfather probably wouldn’t be able to do what he did all those years ago in today’s world. For one thing, many of the smaller florists have gone out of business. Most flours are now sold in large grocery chains. And orders are placed on computers.<\/p>\n\n\n\n<p>At the same time, the computer has opened up new markets. Instead of going door to door, seeing is done computer to computer over the internet. And the items that are being sold no longer have to be a physical object but may very well be a digital item, like a picture, an ebook, a song or a piece of software.<\/p>\n\n\n\n<p>I’ll never forget the punch cards that my dad would have produced to create just one software program, or the fact that these cards would have to be redone if there was as little as one mistake in the code. I remember the funny noise that the modem made when first connecting one computer to another by phone, before the internet existed.<\/p>\n\n\n\n<p>It wasn’t right away that the computer changed things. The first computers were as big as a bus and had hardly any memory at all. It took computers that could go into the homes of enough people, the software to operate these complex machines, high speed communication through the internet and the resources to buy these gadgets. The laptop needed batteries small enough and powerful enough to be able to take the computer anywhere, and the invention of the smartphone and tablet made the computer even more mobile and accessible.<\/p>\n\n\n\n<p>Today, if we choose, we can work from just about anywhere we want. Though many parts of the world still have little or no internet access, these areas are shrinking and may one day disappear. And, while the number of opportunities have opened up immensely, so has the level of competition. So, as with everyone in life, the prize goes to the one who works the hardest and refuses to quit, no matter what: male or female.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Over the years, I’ve heard a lot of things about the traveling salesman: from stories of why one failed where another found success to jokes that I cannot repeat. I remember one story of a traveling vacuum cleaner salesman. After dumping a pile of dirt&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-traveling-salesman\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":525,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17,44,28,41,61],"tags":[3],"class_list":["post-524","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-business","category-career","category-creativity","category-family","category-travel","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/524","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=524"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/524\/revisions"}],"predecessor-version":[{"id":526,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/524\/revisions\/526"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/525"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=524"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=524"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=524"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}