{"id":527,"date":"2023-02-26T19:12:21","date_gmt":"2023-02-26T19:12:21","guid":{"rendered":"https:\/\/llgt.cafe\/?p=527"},"modified":"2023-02-26T19:12:21","modified_gmt":"2023-02-26T19:12:21","slug":"seven-ideas-for-growing-closer-together","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/seven-ideas-for-growing-closer-together","title":{"rendered":"Seven Ideas for Growing Closer Together"},"content":{"rendered":"\n<p>There are a lot of ways that you can spend time with and grow closer to friends and family. Below are just a few ideas.<\/p>\n\n\n\n<p>Eat a meal together. October 11 is Southern Food Heritage Day, so cook or pick up some already prepared fried or baked chicken, a salad and some sort of dessert. You can eat outside or, if your weather is already still cold, you can eat inside.<\/p>\n\n\n\n<p>Watch a movie or television together. Maybe you like classic movies, or the latest releases. Maybe you prefer watching football, baseball, or basketball. You can always find something to watch. You can even find something educational if you prefer and, if your library is open, you can usually find movies that you can borrow for free.<\/p>\n\n\n\n<p>Go out. Depending on where you live, there may be a short time before the weather starts getting a lot colder. Lows in northern Idaho are already dipping into the mid 40s and will soon be in the 30s. But you can still go for a walk or ride bicycles or find some other outdoor activity.<\/p>\n\n\n\n<p>Maybe you and your family or friends prefer to exercise your brains. Whether you prefer to debate, argue, or just discuss current issues, or whatever book you’ve been reading, there is a fair and amiable way to communicate with others, whether they agree with your view or not.<\/p>\n\n\n\n<p>Create something. It doesn’t matter what you use — stone, wood, glass, paper and paint, wool, or flour and butter — there’s so much that you can make. You can make something for yourself, by yourself, or you can make something with others to give away as a gift. You might be surprised just how talented you are.<\/p>\n\n\n\n<p>Volunteer. Give your time to a local charity or to help clean up part of your city or community. Your local chamber of commerce might be a good place to find volunteer opportunities.<\/p>\n\n\n\n<p>Downsize. This last one isn’t really an activity, but it can bring your family together. I’ve heard more than once that some of the best times can be had when a family has less and that more can come often come from having less. Less space, less money, and fewer things can offer challenges that those who “have everything that they need” don’t have to face. If we have no challenges in our lives, we will quickly grow bored and might just find a way to create our own challenges, which may or may not turn us in a positive direction.<\/p>\n\n\n\n<p>Whichever one you choose, or if you come up with your own idea, these things just don’t happen on their own. They have to be planned and planned for. You have to set aside time, and you have to have whatever is needed for that activity. I think, however, that you will find the time well worth the effort.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are a lot of ways that you can spend time with and grow closer to friends and family. Below are just a few ideas. Eat a meal together. October 11 is Southern Food Heritage Day, so cook or pick up some already prepared fried&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/seven-ideas-for-growing-closer-together\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":528,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,46,30,39,47,45],"tags":[3],"class_list":["post-527","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-friends","category-how-to","category-ideas","category-relational","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/527","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=527"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/527\/revisions"}],"predecessor-version":[{"id":529,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/527\/revisions\/529"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/528"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=527"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=527"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=527"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}