{"id":530,"date":"2023-02-27T17:22:40","date_gmt":"2023-02-27T17:22:40","guid":{"rendered":"https:\/\/llgt.cafe\/?p=530"},"modified":"2023-02-27T17:22:40","modified_gmt":"2023-02-27T17:22:40","slug":"borrowing-from-yourself","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/borrowing-from-yourself","title":{"rendered":"Borrowing From Yourself"},"content":{"rendered":"\n<p>Probably some of the best advise I’ve ever not followed is to start saving money. It seems that there’s always a “need” or a want. The few times that I did have some amount of money, I usually wasn’t working, so that money didn’t last long.<\/p>\n\n\n\n<p>The reality is, most if not all of us are going to have to borrow from ourselves at one time or another. We can either have that money in the bank or in some sort of investment, or we can use credit and borrow from our future selves.<\/p>\n\n\n\n<p>One of the problems that I had when I was told that I needed to start saving was that I didn’t really have any clear goals at the time. Even after graduating from culinary school, with nearly $30 thousand in student loans, I didn’t really have a clear understanding of what I wanted to do.<\/p>\n\n\n\n<p>When you’re younger, it’s easy to dismiss the thought of growing older. And the thought of retirement can seem like a strange concept. But, like many other things that we can do, saving can become a habit. And whether we save a little or a lot, saving is a good habit to have because it’s more about forming the habit than how much money we are able to set aside: at least at first.<\/p>\n\n\n\n<p>Money can only make us so happy, though it can give us a certain comfort level. The law of diminishing returns states that, in the case of money, have money only helps make us happier to a certain point. I think it’s somewhere around $75 thousand a year that the plateau starts to flatten out.<\/p>\n\n\n\n<p>It’s hard to say how things might have been had I made different choices along the way. I, probably like many others, keep hoping that “my ship will come in” or that things might somehow change. In my case, things did change. I got laid off from a job where I was a temp for nearly 18 months, wound up getting another temp job with a $2 an hour raise, lost that after a week and a half. Now, I’m working a job that is $1.50 less than I made for those 18 months.<\/p>\n\n\n\n<p>I don’t share these stories because I did everything right but because I’ve failed countless times. Some times I learn something from my failures. It’s the lessons that I’ve learned that I hope will help you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Probably some of the best advise I’ve ever not followed is to start saving money. It seems that there’s always a “need” or a want. The few times that I did have some amount of money, I usually wasn’t working, so that money didn’t last&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/borrowing-from-yourself\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":531,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[38,13,29],"tags":[3],"class_list":["post-530","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-money","category-open-for-discussion","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/530","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=530"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/530\/revisions"}],"predecessor-version":[{"id":532,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/530\/revisions\/532"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/531"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=530"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=530"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=530"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}