{"id":533,"date":"2023-02-28T15:47:37","date_gmt":"2023-02-28T15:47:37","guid":{"rendered":"https:\/\/llgt.cafe\/?p=533"},"modified":"2023-02-28T15:47:37","modified_gmt":"2023-02-28T15:47:37","slug":"what-now","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-now","title":{"rendered":"What Now?"},"content":{"rendered":"\n<p>Feeling stuck. Not sure how to get out of the daily grind? Maybe you just want to try something different but aren’t sure where to start. Here are some ideas that may help.<\/p>\n\n\n\n<p>Start small. Take a moment to write down a list of things that you would like to start doing: exercising, eating more vegetables, remembering to feed your dog, for example. Find a place to put this list where you can see this list each morning and throughout the day. I have mine on a dry eras board. If you want to walk each day, start out with a two to ten minute walk. On weekends, I may walk three hours or more, but I try to walk a little each day, even if it’s to the fridge.<\/p>\n\n\n\n<p>Try joining a church, a church small group for larger churches, or a club. Volunteer for a local charity or for the library. There are so many organizations that can use volunteer help.<\/p>\n\n\n\n<p>Seek a new job\/career or get a second job. You may have to do this if you loose your current job for whatever reason. Hopefully, this doesn’t happen, but it happens all the time. It can seem like a good thing, but often, it does’t. Either way, put your energy into finding something new and, if possible, exciting.<\/p>\n\n\n\n<p>Take up a hobby. There are so many to choose from. Just within art there is photography, watercolor, pastel, color pencil, charcoal, those little fluffy things and so much more. You may even want to take a class that can help you learn a craft and may help you meet others who are also interested in art.<\/p>\n\n\n\n<p>Teach a class. I found a local store, Natural Grocers, that allows me to use their kitchen to teach a class. They also provide me with up to $100 groceries to use as a demo. They do have rules that I am required to follow but nothing too difficult. I’ve only done one class but another is scheduled for next month. Just make sure that, if you decide to teach your class that you know your subject. Curiosity helps, too.<\/p>\n\n\n\n<p>Find others to go for walks with. There may be a local photography club, too, as well as writers and speakers clubs. You should be able to do a Google search for local clubs.<\/p>\n\n\n\n<p>The greatest\/best change in my life came when I put my faith in Jesus to pay my sin debt and restore a relationship with God. John 3:16 (KJV) tells us that, <strong>“ For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”<\/strong> It gives us what we cannot earn and what none of us deserve: forgiveness, wholeness and eternal life. Some things, we get as soon as we accept God’s gift, while other things take a lifetime to change. A prayer of salvation is just the beginning.<\/p>\n\n\n\n<p>Change can be hard at times, especially if it is forced on us. But it doesn’t have to be. It’s our decision as to whether we see change as a good or bad thing. Try to see it as a good thing. In one way, change will occur, with or without us.<\/p>\n\n\n\n<p>Note: I’m not talking about some changes that others may try to force upon us. Even a lie can seem true if you hear it often enough. Keep an open mind to differing views and you should be able to decide what to think about differing issues on your own. Is there a write and wrong? In some cases, yes, but in others, no. You are the one who decides which is which, at least in your own mind. And this, too, may change over time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Feeling stuck. Not sure how to get out of the daily grind? Maybe you just want to try something different but aren’t sure where to start. Here are some ideas that may help. Start small. Take a moment to write down a list of things&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-now\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":534,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,28,31,19,15,26,25,41,48,43,16,53,30,39,35,47,14,45],"tags":[33,22,7,5,36,3],"class_list":["post-533","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-creativity","category-did-you-know","category-education","category-emotional","category-emotions","category-faith","category-family","category-fitness","category-food","category-health","category-hobbies","category-how-to","category-ideas","category-question","category-relational","category-spiritual","category-tips","tag-bible","tag-health","tag-jesus","tag-king-james-bible","tag-learning","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/533","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=533"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/533\/revisions"}],"predecessor-version":[{"id":535,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/533\/revisions\/535"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/534"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=533"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=533"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=533"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}