{"id":536,"date":"2023-03-01T18:00:31","date_gmt":"2023-03-01T18:00:31","guid":{"rendered":"https:\/\/llgt.cafe\/?p=536"},"modified":"2023-03-01T18:00:31","modified_gmt":"2023-03-01T18:00:31","slug":"trusting-our-heavenly-father","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/trusting-our-heavenly-father","title":{"rendered":"Trusting Our Heavenly Father"},"content":{"rendered":"\n<p>There was a family in the break room at work as I sat down to eat my morning snack: a mother and father, their baby boy and a little girl about two or three years old. When the mother left to find out something, the little girl hesitated for a moment and then bolted out the door after her mother. It wasn’t because the little girl didn’t want to be with her father. Likely, she just decided that she wanted to go with her mother and perhaps worried that she may not be able to catch up with her.<\/p>\n\n\n\n<p>When it comes to spending time with our Heavenly Father, we often act quite the same. We may spend time in church on Sunday but often become distracted by our day to day routine during the rest of the week.<\/p>\n\n\n\n<p>And, though we say that we trust God, do we trust him completely — with our money and other treasures. Really, it all belongs to him anyway, but we often act like little children — at least the ones who don’t want to share their candy or their toys.<\/p>\n\n\n\n<p>I don’t know about you, but when times are lean and funds are low, the church seems to be the first place where budget cuts hit. I wish it weren’t so, but it is.<\/p>\n\n\n\n<p>Proverbs warns us that lean times will come from time to time and tells us to be ready for them. And just when I start to get used to making a certain amount of money, or look forward to having a little extra, something happens.<\/p>\n\n\n\n<p>Most of the time the something that happens is my own fault, or the consequences may be worse because of poor planning. Some times, however, I wonder if God might be doing something in or through my life.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>&#8220;And as Jesus passed by, he saw a man which was blind from his birth. And his disciples asked him, saying, Master, who did sin, this man, or his parents, that he was born blind? Jesus answered, Neither hath this man sinned, nor his parents: but that the works of God should be made manifest in him.&#8221;  <\/strong>      <\/p>\n\n\n\n<p>— John 9:1-3 (KJV)<\/p>\n\n\n\n<p>There are times when God uses our circumstances to show us that we can still trust him, that he’s still there, and that he can take care of whatever comes along. Other times, he uses our circumstances to gently steer us back to him.<\/p>\n\n\n\n<p>Where do you put your trust? Do you put your trust in God, maker of Heaven and Earth. Maybe you put your trust in your money or possessions. I hope you put your faith in God. Ephesians 3:20-21 (KJV) reminds us,<strong> “Now unto him that is able to do exceeding abundantly above all that we ask or think, according to the power that worketh in us, unto him be glory in the church by Christ Jesus throughout all ages, world without end. Amen.”<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There was a family in the break room at work as I sat down to eat my morning snack: a mother and father, their baby boy and a little girl about two or three years old. When the mother left to find out something, the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/trusting-our-heavenly-father\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":537,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,41,14],"tags":[33,8,7,5,3],"class_list":["post-536","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-family","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/536","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=536"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/536\/revisions"}],"predecessor-version":[{"id":538,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/536\/revisions\/538"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/537"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=536"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=536"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=536"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}