{"id":540,"date":"2023-03-02T17:30:10","date_gmt":"2023-03-02T17:30:10","guid":{"rendered":"https:\/\/llgt.cafe\/?p=540"},"modified":"2023-03-02T17:30:10","modified_gmt":"2023-03-02T17:30:10","slug":"inventors-and-inventions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/inventors-and-inventions","title":{"rendered":"Inventors and Inventions"},"content":{"rendered":"\n<p>When I was much younger, I wanted to be an inventor. Inventing seems so cool. You get to use both your mind and your imagination to create new things, or just find better or different ways of doing things that are already being done.<\/p>\n\n\n\n<p>There have been so many inventors throughout the years. Some of their inventions became a part of our everyday lives, while others did not. And not all inventors have been fully recognized for the inventions that they have introduced into the world.<\/p>\n\n\n\n<p>According to an obituary published in November 12, 1909 issue of “The New York Times”, The friends of Dr. THEODORE RUGGLES TIMBY, who died this week, aged 91, poor and generally neglected, are convinced that he invented the revolving gun turret used first on war vessels of the Monitor type. Many persons in public life have admitted the priority of TIMBY&#8217;S invention to ERICSSON&#8217;S.<\/p>\n\n\n\n<p>Here are some inventors that you may not have heard of:<\/p>\n\n\n\n<p>Choe Yun-ui invented the metal type printing press, close to two hundred years before Johannes Gutenberg invented his printing press.<\/p>\n\n\n\n<p>In 1959, Ernie Fraze invented the pop top found on soda cans. Though not truly recognized for his invention, which was was inspired by a picnic, by 1980, Fraze&#8217;s company and invention were bringing in $500 million dollars of annual revenue.<\/p>\n\n\n\n<p>George Heilmeier invented the liquid crystal display, which helped bring us the first digital watches and clocks, along with the first digital calculators. They were only black and white, but they were a major step towards the electronics that we have today and, on some devices, are still in use.<\/p>\n\n\n\n<p>Giovanni Caselli’s pantelegraph, created in1860, was actually the first fax machine.<\/p>\n\n\n\n<p>James Goodfellow created the ATM in pin number pad in 1966 so people can take money out of the bank after hours.<\/p>\n\n\n\n<p>In April 1954, Gordon Teal, an inventor at Bell Labs, crated the first silicon transistors.<\/p>\n\n\n\n<p>Henry Heyl invented the cinema in 1870, in spite of Thomas Edison’s claim that no one invented the cinema. Sadly, with the CORONA virus, many movie theaters are being hit hard, and some are even closing. We are, however, seeing an upsurge in drive-in theaters.<\/p>\n\n\n\n<p>Robert Kearns invented windshield wipers in 1967. Perhaps his greatest source of earnings has come from lawsuits against those who have stolen his idea. These lawsuits take in an estimated $30 million each.<\/p>\n\n\n\n<p>Mary Anderson also created the windshield wiper. Her introduction of the windshield wiper came in 1903. It’s doubtful, however, that she took in any money from lawsuits.<\/p>\n\n\n\n<p>Margaret Knight invented a machine that automated the folding of the paper grocery bag in 1879.<\/p>\n\n\n\n<p>Bette Nesmith Graham invented Liquid Paper in 1951, allowing writers and typists to fix errors made on paper.<\/p>\n\n\n\n<p>George Washington Carver, Dec 13, 2019 to January 5, 1943, did not invent peanut butter as many are taught. Marcellus Gilmore Edson did. Carver claimed to have invented over 300 peanut related inventions, and there’s no reason to doubt his claims.<\/p>\n\n\n\n<p>These days, I have more ideas than ever, but few of them are along the lines of inventions. Most of my ideas are ideas for writing or shot videos that I would like to make. And who knows, some day I may create a better toaster. Someone else can work on mouse traps.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When I was much younger, I wanted to be an inventor. Inventing seems so cool. You get to use both your mind and your imagination to create new things, or just find better or different ways of doing things that are already being done. There&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/inventors-and-inventions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":541,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,28,31,43],"tags":[3],"class_list":["post-540","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-creativity","category-did-you-know","category-food","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/540","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=540"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/540\/revisions"}],"predecessor-version":[{"id":542,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/540\/revisions\/542"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/541"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=540"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=540"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=540"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}