{"id":547,"date":"2023-03-04T16:39:05","date_gmt":"2023-03-04T16:39:05","guid":{"rendered":"https:\/\/llgt.cafe\/?p=547"},"modified":"2023-03-04T16:39:05","modified_gmt":"2023-03-04T16:39:05","slug":"faith-is","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/faith-is","title":{"rendered":"Faith is&#8230;"},"content":{"rendered":"\n<p>I needed a bag to take my lunch to work this morning, and I was in a hurry, so I dumbed the contents of the first bag that I came to on the floor. Unfortunately, along with everything else, I wound up dumping about a quarter cup of stevia or some other sugar substitute onto the carpet.<\/p>\n\n\n\n<p>I don’t own a vacuum cleaner, or I didn’t at the time, and I really didn’t want to leave this mess on the floor overnight.<\/p>\n\n\n\n<p>Fear is the absence of faith that things will be okay, worrying that things won’t go as one might hope or that things will not happen as quickly as we need. Depression is the feeling that things will never get better. The Bible tells us that perfect love casts out fear. Yet, love and faith are not the same thing.<\/p>\n\n\n\n<p>Hebrews 11:1 (KJV) tells us, <strong>“Now faith is the substance of things hoped for, the evidence of things not seen.” Hebrews 11:6 goes on to say, “ But without faith it is impossible to please him: for he that cometh to God must believe that he is, and that he is a rewarder of them that diligently seek him.”<\/strong><\/p>\n\n\n\n<p>it seems that I’m always waiting for something. Most of the time things turn out just fine, but there always seems to be just a little doubt that the next thing will turn out okay. If not, there is the concern that I might do the wrong thing.<\/p>\n\n\n\n<p>Whether we realize it or not, all of us have faith. We have faith that, when we go to bed at night that we will wake up, we have faith that we will make it wherever we are going safely. We have faith that this day will be much like the days before. We “practice” our faith by though prayer or by study, and we live our faith by doing good for others. And we display our faith through our conversation.<\/p>\n\n\n\n<p>The problem that I have is that, as 2 Corinthians 5:7 states, we are to walk by faith and not by sight. That’s fine when things are going well. It’s a lot harder when you get laid off, or when you don’t know where the money is going to come from just to meet basic needs, and things don’t look like they’ll get better for months. In spite of all that times that God has provided for my needs, there still looms that feeling that, maybe this time, he may not.<\/p>\n\n\n\n<p>Faith is like a muscle in that it gets stronger with use. Yes, I prefer the times when I don’t need as much faith but in order to exercise faith, at least a little bit of stress and tension are required. No one builds their faith by having it easy as no one builds muscle by reclining in an easy chair.<\/p>\n\n\n\n<p>Do I look for ways to make things better? Yes. But to some extent, I have to realize that everything belongs to God, and that he is more than capable of taking care of all of my needs. Is it hard some times? Yes. The good news is that, like everything that we work at, with time, it does get easier.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I needed a bag to take my lunch to work this morning, and I was in a hurry, so I dumbed the contents of the first bag that I came to on the floor. Unfortunately, along with everything else, I wound up dumping about a&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/faith-is\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":548,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,13,14],"tags":[3],"class_list":["post-547","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-open-for-discussion","category-spiritual","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/547","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=547"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/547\/revisions"}],"predecessor-version":[{"id":549,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/547\/revisions\/549"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/548"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=547"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=547"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=547"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}