{"id":556,"date":"2023-03-07T17:11:41","date_gmt":"2023-03-07T17:11:41","guid":{"rendered":"https:\/\/llgt.cafe\/?p=556"},"modified":"2023-03-07T17:11:41","modified_gmt":"2023-03-07T17:11:41","slug":"learning-vs-creativity","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/learning-vs-creativity","title":{"rendered":"Learning Vs Creativity"},"content":{"rendered":"\n<p>Learning vs. Creativity<\/p>\n\n\n\n<p>A week or so ago, I was walking through one of the parks between the lake and the library, and saw a family — a mother and a child, who was playing in the children’s area. The question came to mind, does education kill creativity. Kill: that’s probably too strong a word. But does it hinder creativity?<\/p>\n\n\n\n<p>The church that I go to also serves as a school during the week The sign out front says “play based learning.” Play encourages creativity and teaches relational skills. I’m not saying that they don’t teach math or other classes; it’s likely that they do, but maybe they find a way to make it more like play. Learning should be fun, otherwise, when we no longer have to learn, we are likely to stop.<\/p>\n\n\n\n<p>I wish that I could say that I enjoyed my years in public school. These years were hard, and I was glad when they were over.<\/p>\n\n\n\n<p>A formal education is a foundation, however, for an ongoing learning process that can last a lifetime. Learning is just the beginning. Taking the things that we learn and being able to apply it to our lives to not only make our own lives better, but to better the lives of others, that is wisdom.<\/p>\n\n\n\n<p>When I was in Jr. hight and high school, and even into college, I was able to take classes that helped me work on my creativity. One of my favorite classes was a college class on creative writing. I remember making three or more attempts at just my first paper before coming up with something that I was happy with.<\/p>\n\n\n\n<p>Photography is another area where I enjoy being creative. Cooking too. Creativity requires time, though, and if we are not setting aside to be creative, then it is not likely a skill that we will build.<\/p>\n\n\n\n<p>What can keep us from building this skill? Spending all of our time on learning other things, work, recreational activities like watching television, or just trying to live life. Nothing is wrong with an of these activities, in moderation.<\/p>\n\n\n\n<p>Of course, we can go our whole lives without being creative, yet, our creativity can be one of the best things that we can offer to this world, and I believe that if is one of the greatest gifts that we can give to ourselves, and it is one that brings me a great amount of joy; using our creativity and sharing it with others is just one way we can serve others.<\/p>\n\n\n\n<p>What is it that brings you the most joy? Maybe it’s spending time with those you love. Little children are full of creativity, and are quick to pick up on new ideas and concepts. I’m glad that my parents didn’t squelch my creativity when I was growing up. It would have been easy to have done, but they didn’t and, for that, I am thankful.<\/p>\n\n\n\n<p>There are so many choices available when it comes to being creative. One friend sows. Several of my friends take pictures. It was probably after I met Tim LaHay that I decided that I wanted to be a writer, and about 18 years after that that I actually began writing on a regular basis.<\/p>\n\n\n\n<p>If you have something that you enjoy doing, great, keep working on it. If not, maybe you can try something new. There are so many things to choose from. You just need to pick one and get started. You may be surprised at how well you do.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learning vs. Creativity A week or so ago, I was walking through one of the parks between the lake and the library, and saw a family — a mother and a child, who was playing in the children’s area. The question came to mind, does&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/learning-vs-creativity\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":557,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,35],"tags":[3],"class_list":["post-556","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/556","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=556"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/556\/revisions"}],"predecessor-version":[{"id":558,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/556\/revisions\/558"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/557"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=556"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=556"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=556"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}