{"id":559,"date":"2023-03-08T17:30:29","date_gmt":"2023-03-08T17:30:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=559"},"modified":"2023-03-08T17:30:29","modified_gmt":"2023-03-08T17:30:29","slug":"mark-1231","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/mark-1231","title":{"rendered":"Mark 12:31"},"content":{"rendered":"\n<p>It seems quite evident that, at least where I live, that the ability to get most things nearly instantly has changed the way that we deal with others and not necessarily in a positive way. Relationships are harder to build, because we expect others to be what we expect them to be right now, not ten or twenty years down the road.<\/p>\n\n\n\n<p>Speaking of down the road, I was driving home on one occasion and a car passed me headed to the on-ramp. No big deal, but I could tell that the driver had the accelerator all the way to the floor. I’m not sure if this other driver was in some sort of a hurry, or just didn’t want to wait. And it seems to be much the same wherever I go: Arkansas, Massachusetts, California. People are in a hurry, and they don’t seem to care who they put at risk. Likewise, there are those who don’t seem to care and put others at risk by driving too slow.<\/p>\n\n\n\n<p>Maybe I’m wrong, but it seems that some people are so focused on themselves that they fail to see how the things that they do are affecting others. And it’s kind of sad. So much of society is being taught to simply blame others for their problems. The banks are the reason I don’t have any money, the fast food restaurants are the reason I’m overweight, and the police are the reason there’s crime. None of this is true, but you might think it were if you watched the television on a regular basis.<\/p>\n\n\n\n<p>The Bible makes it clear that we are to love one another, and that’s not just our friends or those we agree with. The Bible goes so far as to say that we are to love even our enemies and to pray for those who do us harm.<\/p>\n\n\n\n<p>With a divorce rate at or above 50%, it seems that many hare having issues loving their husbands or wives, let alone their enemies. And loving our neighbors as yourselves? I doubt it. Perhaps worst of all is the fact that Christians are known to be some of the stingiest people, with only a small portion of most Christians who attend church giving to their church, and being some of the worst tippers when they go out to eat after church. I’m not sure why this is true. For me, it is a blessing to give to those who serve me, as the Bible says that it is more of a blessing to give than it is to receive.<\/p>\n\n\n\n<p>For many, respect is no longer expected and so it’s no longer given. At the same time I see that, to those who are shown respect, respect is returned. For those who don’t show any respect, maybe they just need a little more patients.<\/p>\n\n\n\n<p>I found out a long time ago that those who hurt others have often themselves been hurt by others. I don’t think it’s something that’s done intentionally and those who hurt others may not even be aware of how their actions affect others.<\/p>\n\n\n\n<p>Anther thing I have seen recently is an increased fear of offending others. And it’s gotten to the point, at times, that someone will apologize for getting within 6 foot of another person. Personally, I would rather have someone “get in my space” who doesn’t care, because it’s not something that bothers me. We are meant to be social creatures for a reason. How we interact with others not only affects our happiness but our health. And you can’t buy love or respect no matter how much money you have.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It seems quite evident that, at least where I live, that the ability to get most things nearly instantly has changed the way that we deal with others and not necessarily in a positive way. Relationships are harder to build, because we expect others to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/mark-1231\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":560,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,46,47],"tags":[33,3],"class_list":["post-559","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-friends","category-relational","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/559","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=559"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/559\/revisions"}],"predecessor-version":[{"id":561,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/559\/revisions\/561"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/560"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=559"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=559"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=559"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}