{"id":562,"date":"2023-03-09T17:39:09","date_gmt":"2023-03-09T17:39:09","guid":{"rendered":"https:\/\/llgt.cafe\/?p=562"},"modified":"2023-03-09T17:39:09","modified_gmt":"2023-03-09T17:39:09","slug":"self-reliance","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/self-reliance","title":{"rendered":"Self Reliance"},"content":{"rendered":"\n<p>If there is one thing that I learned from my time at the YMCA camp on Catalina Island, California, it’s this: you need to be able to take care of some things yourself.<\/p>\n\n\n\n<p>We were out there, and it was just us. The roads were pretty much washed away and, even if they still existed, you would need a vehicle that could operate on an angle of 45 degrees or greater. The only real way to get anything or go anywhere was by boat. Town was about a half hour a way and the mainland was only accessible in a much larger boat than we had on our beaches.<\/p>\n\n\n\n<p>If there were a fire, we would have been the ones to have had to put it out. Fires outside our area, that was the job of someone else, and a huge hovercraft would be brought in to take care of that. It looked like something from the Star Trek Borg, and could be heard from at least 5 miles away.<\/p>\n\n\n\n<p>If something had to be fixed, someone on the camp likely had to fix it, at least temporarily. Propane came on a landing craft, and food came by boat as part of a weekly delivery. I was one of the cooks, and I also did dishes.<\/p>\n\n\n\n<p>Whatever you do, whether you work for yourself or you work for someone else, there are going to be times when you will need someone else’s help. There will also be times when there won’t be anyone who will or can help you and you will have to do the work on your own, especially if you are self employed.<\/p>\n\n\n\n<p>Don’t get me wrong, there will always be a need others, no matter what you or I do. Whether we work for a business or have our own business, we will always need customers, and it is likely that we will also need suppliers. In most cases, co-workers will also be needed to complete tasks that can not be done by an individual, alone.<\/p>\n\n\n\n<p>Yet there will be times when we will have to act alone to fix problems. By this, I mean that we cannot always expect others to fix our problems. Some times we will have to take action to fix things ourselves. We can ask others to help us with a particular issue, but if they cannot help us or, if they are part of the problem, then we must move on and work on fixing the issue ourselves.<\/p>\n\n\n\n<p>The same can be said for motivation. No one is going to motivate us to do something if we are not willing to make the time to do whatever needs to be done. We can dream and plan and make notes till we are blue in the face, but no one else can make us take the actions necessary to actually do the things that need to be done to see a goal through to completion.<\/p>\n\n\n\n<p>How do we tackle a large project like writing a book or building a business? One day at a time, doing at least something each day that takes us closer to our goal. Even if we just set up to do something and even if we don’t actually get anything done, a little something is better than a whole lot of nothing.<\/p>\n\n\n\n<p>It’s time that we learn to hold ourselves accountable for our own actions and stop trying to blame others for the lack of results.<\/p>\n\n\n\n<p>One last note. I’m not sure, but it seems that there are a lot of people who believe that they don’t need help when it comes to gaining eternal life. Many people believe that they will be good enough when, surely, they’re not as bad as “that other guy.”<\/p>\n\n\n\n<p>The Bible, however, makes it clear that we cannot do this on our own. God sent his son, Jesus, to die on the cross because we are incapable of earning eternal life. We can never be good enough. These aren’t my standards. They are God’s. God makes the rules, not me. If you want God’s gift of eternal life, just ask. Then trust God to take care of the details.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If there is one thing that I learned from my time at the YMCA camp on Catalina Island, California, it’s this: you need to be able to take care of some things yourself. We were out there, and it was just us. The roads were&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/self-reliance\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":563,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14,29],"tags":[8,7,3],"class_list":["post-562","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","category-think-about-it","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/562","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=562"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/562\/revisions"}],"predecessor-version":[{"id":564,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/562\/revisions\/564"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/563"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=562"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=562"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=562"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}