{"id":569,"date":"2023-03-11T19:16:03","date_gmt":"2023-03-11T19:16:03","guid":{"rendered":"https:\/\/llgt.cafe\/?p=569"},"modified":"2023-03-11T19:16:03","modified_gmt":"2023-03-11T19:16:03","slug":"faith-and-doubt","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/faith-and-doubt","title":{"rendered":"Faith and Doubt"},"content":{"rendered":"\n<p>I remember an encounter between myself and Frank White before a football game on the campus of the University of Arkansas. I’m pretty sure it was one of those times when I had walked down to the universities athletic department and patiently waited to talk to Rick Schaeffer to ask for a press pass so that I could photograph the game.<\/p>\n\n\n\n<p>At this time, Frank White was, I think, still governor of Arkansas, and was running for election to continue as governor. Earlier, he had defeated Governor Bill Clinton, who had moved back to Fayetteville with his wife, Hillary, where the two taught on the campus of the University of Arkansas. My home, the home where I spent the first 17 years of my life, was on the edge of that campus.<\/p>\n\n\n\n<p>When I met Frank White, I remembered him for just one thing. During his time in office, Governor White had tried to have the state of Arkansas allow the teaching of the Bible in the public schools. It became a fierce battle of faith and “science” , religion vs. state, evolution vs creation, the ACLU vs the state of Arkansas, and faith vs doubt. It was the second of it’s kind and was known as “the great monkey trial. Arkansas’ side seemed ill prepared, and they were defeated. That’s how I saw Frank White on that day, as he stood outside the football stadium trying to gain votes for the coming election: defeated.<\/p>\n\n\n\n<p>There were, perhaps, a few things wrong with this trial. The first, being, that there should have never been the question of whether the Bible could be taught in public schools. No, I’m not talking about the supposed separation of church and state. That’s a conversation for a later time. What I mean is that, for decades, this country’s foundation of government and education had been built and run based on the principals found and taught out of the Bible. Then “scientist”, evolutionists, atheists and lawyers came along and had the Bible surgically removed from public life. Over time, the patient, the United States of America, having had the truth of the Bible remade, has slowly and painfully began to die.<\/p>\n\n\n\n<p>Another problem that underlies the fact that our country cannot use the Bible to prove the existence of God is that fact that it has used the teaching of the theory of evolution to, over the years, somehow prove that God does not exist, he did not create us or this universe, we are not created in the image of God, we do not have a God given purpose and, since God does not exist, Jesus’ death on the cross serves no purpose. If you want to teach that we came from apes instead of from God, prove it: 100%, no theories forced down our throats until we accept them as facts. If you can prove beyond a shadow of a doubt that God does not exist and that we were created over a million years, the product of billions of accidents, then you can teach evolution. Otherwise, you are teaching a false faith and a false religion that, today, we call science.<\/p>\n\n\n\n<p>The the third and final problem is that we asked the schools to teach the Bible in the first place. Nothing against schools in general, but they often struggle to teach the foundations of education: math, science, English and the other subjects that we need as a foundation. They might be able to teach religion, but they certainly are not the place to look for forgiveness of sin or for a restored relationship with the creator of the universe.<\/p>\n\n\n\n<p>What does the Bible teach? That’s an answer that the church should be teaching. Sadly, the different churches cannot agree on what the Bible says or means, and it has, in large part, left the truth of God’s word in pursuit of just getting more people into it’s doors or trying to prove the superiority of their own flavor of truth over the building of relationships with one another and with God. What the great American trial did to Arkansas and to the rest of the world was to plant a seed of doubt in the hearts of a country that God exists, that he created everything that we see, and that he loved us enough to send his own son to die on a cross so that we might have eternal life. And that seed has been growing, now, for nearly 40 years.<\/p>\n\n\n\n<p>My faith seed was planted just over 40 years ago. It had to be the smallest of seeds. Perhaps, I haven’t cared for it nearly as much as I should have. It’s been battered and abused, torn, crushed, questioned, burned, pruned more than once, broken, despised and misunderstood. In spite of everything, it hasn’t died but continues to grow. You see, my faith seed isn’t a theory, it’s not a doctrine or an understanding; it’s a relationship with the living God. That seed that was planted more than four decades ago was my faith in my Savior, the Lord Jesus Christ.<\/p>\n\n\n\n<p>Once received and accepted, once planted and nurtured, this seed cannot be removed. Jesus died once and for all: for all people and for all time. That is to see that we cannot reject Jesus, but I follow neither the Calvinist nor the Arminianism theologies. To me, Calvin is a funny little boy with a hilarious stuffed tiger, takes away any power of man to make any decisions for himself, while Arminianism gives way to much power to man and to self, taking away that power from God himself, out of God’s strong, loving hands and into the weak hands of man.<\/p>\n\n\n\n<p>No, my faith is about a relationship. Like when Sandy began a relationship with me and we were eventually married. I was not looking for a relationship with God. Yet he pursued me and over time, he has lovingly built that relationship. If my faith fully grown. No, I doubt it. But it has come a long way over the years. It’s taken a lot of abuse over the years, but I think that it’s finally starting to grow back, to bloom, and even flower. And you know what comes from flowers? Fruit. And what comes from fruit? Seeds.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I remember an encounter between myself and Frank White before a football game on the campus of the University of Arkansas. I’m pretty sure it was one of those times when I had walked down to the universities athletic department and patiently waited to talk&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/faith-and-doubt\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":570,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[8,7,3],"class_list":["post-569","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/569","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=569"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/569\/revisions"}],"predecessor-version":[{"id":571,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/569\/revisions\/571"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/570"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=569"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=569"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=569"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}