{"id":572,"date":"2023-03-12T19:23:23","date_gmt":"2023-03-12T19:23:23","guid":{"rendered":"https:\/\/llgt.cafe\/?p=572"},"modified":"2023-03-12T19:23:23","modified_gmt":"2023-03-12T19:23:23","slug":"ive-heard","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/ive-heard","title":{"rendered":"I&#8217;ve Heard"},"content":{"rendered":"\n<p>I’ve been a Christian for just over 40 years, now. I’ve lived in several different places, gone to several different churches, and heard a lot of different people speak on what they believe is the truth. Believe me, no one says “this is what I’m teaching, but I don’t really believe it.”<\/p>\n\n\n\n<p>Below are some of the things that I’ve heard over the years. See if any of these seem familiar.<\/p>\n\n\n\n<p><strong>The Bible<\/strong><br>The Bible is the inerrant Word of God. The Bible is just a collection of good stores. Every word of the Bible is true. There are mistakes and embellishments. Jesus spoke in perfect King James. Only those who know Greek and Hebrew can fully understand the Bible. The King James Bible is the best and only Bible that we should use. It’s best to use multiple translations. We need to follow the whole law. We just need to follow two laws (love God and love others as ourselves). The Holy Spirit gave men the words to write. Men used their own stories to create God over time. Shakespeare wrote some of the Psalms. We can use the Bible to predict the future. We can only look back and use the Bible to know that what God said was true.<\/p>\n\n\n\n<p><strong>Creation<\/strong><br>God created the heavens in the earth. The universe was created in an explosion. God created man in his image. Man evolved over millions of years, starting in a pool of water or something like that. Creation took seven days. Creation got started and was interrupted by some destructive event. God created all things but used evolution in the process. Evolution is real. Evolution is not. The earth is about 6,000 years old. The earth is millions of years old. God created man. Man created God.<\/p>\n\n\n\n<p><strong>Johan<\/strong><br>The story of Jonah, along with other similar stories, is real. The story was made up. Job existed. Job is just a good story.<\/p>\n\n\n\n<p><strong>Jesus<\/strong><br>Jesus is God and a part of the trinity. Jesus was a good teacher and nothing more. Jesus never sinned.Jesus sinned. Jesus claimed to be equal with God.  Jesus never claimed equality with God. Jesus’ death allows us to have eternal life. Jesus’ disciples stole the body of Jesus and he is still dead. The stories of Jesus are real and factual. The stories of Jesus were made up and just got better and better over time. Jesus said this. Jesus meant that. Jesus didn’t exist because there is no “J” in Hebrew. Jesus is the way. Jesus is a way.<\/p>\n\n\n\n<p><strong>Baptism<\/strong><br>Baptism should be done as early as possible. Baptism should be done only after there is faith and salvation. Baptism is essential to salvation. Baptism is only symbolic of what has taken place in one’s life. Baptism alone saves. Baptism is done by sprinkling. Baptism is by immersion. Baptism is in the name of the Father, Son and the Holy Spirit. Baptism is in the name of Jesus. There is one baptism. There is a separate baptism in the Holy Spirit.<\/p>\n\n\n\n<p><strong>Spiritual gifts<\/strong><br>Spiritual gifts still exist. Spiritual gifts ceased a long time ago. Speaking in tongues is made up. Speaking in tongues is the sign of spiritual life. Tongues is a gift that allows people to speak in other languages, even the tongues of angels. Tongues was only used on Pentecost so that the foreigners could understand what was said in their own language. Gifts are only the well known gifts, such as tongues and healing. The gifts include serving and teaching. People poses spiritual gifts. Only God can heal.<\/p>\n\n\n\n<p><strong>Salvation<\/strong><br>Salvation is trough faith in Jesus Christ. Salvation is through faith and works. Salvation is through works. We can know that we have eternal life. We can only hope that we have eternal life. Man goes to God. God goes to man. Man chooses. God chooses. There will be millions in heaven. There will only be about 144,000. Whosoever believes can have eternal life. Only those whom God chooses can have eternal life. Salvation is something that God already has given us from birth. Salvation is something that we receive when we believe. Salvation is something that we cannot loose. Salvation is something that we can loose at any time. Salvation depends on what we do. Our salvation depends only on whether or not we choose to believe. God chooses to give salvation to some but rejects others. The old testament was different. Those who lived in old testament times also received eternal life through faith. Jews need Jesus, just like anyone else. God has a different plan for the Jew.  All dogs go to heaven.  No dogs go to heaven. <\/p>\n\n\n\n<p><strong>End times<\/strong><br>We are in end times. There could be another 100 years or more to go. There are still prophecies to be fulfilled. Prophecy has already been fulfilled. There will be a rapture before, during or after a seven year tribulation. There will be no rapture. Jesus will rule and reign on earth for a thousand years. There will be no thousand year reign. God will judge the earth. A messiah will come to save the earth. Jesus will come, admit that he never died on the cross and give his power to Mohamed before killing all who refuse to worship him. The tribulations is a seven year period. The tribulation is more like a time lasting 144 years.<\/p>\n\n\n\n<p>If you haven’t guess, I don’t believe all of these things, and this is certainly not a complete list. We all have our own beliefs, believing either the things that we were taught or drawing conclusions of our own along the way.<\/p>\n\n\n\n<p>Personally, I choose to keep my mind open in a lot of areas. In the end, does it matter what I believe? When I stand before God, will he ask me if I spoke in tongues or healed anyone. Will God ask me whether or not I believe that Johan was a real man. Will God ask me which Bible translation I read, or sigh in relief when I say that I prefer the King James translation. I seriously doubt it. What does matter? You know, I’m not going to answer that. You have to decide for yourself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve been a Christian for just over 40 years, now. I’ve lived in several different places, gone to several different churches, and heard a lot of different people speak on what they believe is the truth. Believe me, no one says “this is what I’m&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/ive-heard\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":573,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,13,14],"tags":[33,8,7,3],"class_list":["post-572","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-open-for-discussion","category-spiritual","tag-bible","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/572","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=572"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/572\/revisions"}],"predecessor-version":[{"id":574,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/572\/revisions\/574"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/573"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=572"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=572"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=572"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}