{"id":575,"date":"2023-03-13T14:21:26","date_gmt":"2023-03-13T14:21:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=575"},"modified":"2023-03-13T14:21:26","modified_gmt":"2023-03-13T14:21:26","slug":"tips-for-the-new-cook","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/tips-for-the-new-cook","title":{"rendered":"Tips for the New Cook"},"content":{"rendered":"\n<p>Do you enjoy cooking, or is it a chore? Have you been cooking for some time, or are you still new at it? I enjoy cooking, especially for others. If I’m cooking for myself, I still tend to cook in large batches and put whatever I cook in the refrigerator to eat throughout the week.<\/p>\n\n\n\n<p>If you don’t care to cook, however or, if you are still new at it, here are a few tips.<\/p>\n\n\n\n<p>Start at the library. Depending on the size of your library, there may to cookbooks numbering in the hundreds. It is one of the favorite subjects for people to write about. What you are looking for is ideas and, maybe a recipe or two. My library is curb side service only, making it harder to brows the cookbook section, but I’m sure that if I go online, I could find a book to check out.<\/p>\n\n\n\n<p>Speaking of online, there are a number of online resources. YouTube and Amazon are just a couple of them. YouTube will show you not only the things that you will need, but will nearly always show you step by step the directions for making whatever it is that you want to make.<\/p>\n\n\n\n<p>One of the keys to learning how to cook is technique. Learning technique, such as creaming butter and sugar together as the first step to baking, can help a great deal in the cooking process. Practicing knife skills can also lend to more beautiful presentation in your cooking, and you can learn all of this, free, online.<\/p>\n\n\n\n<p>Knowing what spices and spice combinations work, and using these spices in your cooking, can also add a great deal of flavor to your cooking. Nutmeg is a wonderful spice to cook with, but you need to know when to use it, and how much to add to your recipe. Because it is such a strong spice, you only want to use a small amount, usually around 1\/8 of a teaspoon. The same is true for cayenne pepper, but you likely won’t use these two ingredients in the same recipe.<\/p>\n\n\n\n<p>It’s important to know the difference between spices and herbs. While spices tend to go into a recipe at the beginning of the cooking process, herbs tend to go in near the end, or even after cooking has been completed. The flavor of spices changes over time, while the more delicate herbs tend to loose their flavor fairly quickly. The best way to learn how to use these items is though actual practice. That way, you can find out what flavors that you like most as well as which ones you don’t really care for.<\/p>\n\n\n\n<p>Here are a couple of other tips.<\/p>\n\n\n\n<p>Plan ahead. It will save you both time and money if you are able to plan your meals ahead of time. Yes, you can save a lot of time buying frozen dinners and ordering out, but a home make meal is likely to be a lot better for you, and just might taste batter.<\/p>\n\n\n\n<p>When you are preparing a recipe, gather everything that you will need into one place. Familiarize yourself with the recipe and do your best to understand what you will need to do and when. Give yourself time, and try to make sure that you are not interrupted during the process. There’s little worse than having to leave what you are working on and returning to find out that all of your labor (and food) has been wasted.<\/p>\n\n\n\n<p>Take your time and taste as you go. As noted above, spies can change over time. A little cayenne pepper may not taste so strong now, but given an hour or so will probably increase in intensity. Remember that you can always add more but you cannot take out. There are tricks to reducing heat and over salting, but it’s best to not make these mistakes in the first place.<\/p>\n\n\n\n<p>Enjoy the process. You may cook for yourself, or you may cook for others. The food that took so long to cook may last only minutes, and those whom you cook for may or may not thank you for your efforts. Yet, if you can enjoy the process, from start to finish, then it can make all of your effort well worth it, especially if you can enjoy the results at the end.<\/p>\n\n\n\n<p>Try finding someone else to cook with. Cooking with a friend or family member might be more fun.<\/p>\n\n\n\n<p>If all else fails, read the directions. Find a recipe that you might be interested in cooking and look it up. There are almost always recipes online and YouTube is another source that can give you a visual demonstration of just about any recipe out there.<\/p>\n\n\n\n<p>Finally, if you can and, unless you enjoy doing so, find someone else to wash the dishes. The cook shouldn’t also have to do the dishes. Yes, I’ve had to do the dishes countless times over my career in food services, but it is my least favorite part of cooking.<\/p>\n\n\n\n<p>Perhaps you have some of your own ideas. If so, please feel free to share them below. Cooking can be a rewarding endeavor, but it can also be a lonely one. I would love to hear from you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Do you enjoy cooking, or is it a chore? Have you been cooking for some time, or are you still new at it? I enjoy cooking, especially for others. If I’m cooking for myself, I still tend to cook in large batches and put whatever&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/tips-for-the-new-cook\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":576,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,46,30,39,45],"tags":[66,3],"class_list":["post-575","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-friends","category-how-to","category-ideas","category-tips","tag-cooking","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/575","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=575"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/575\/revisions"}],"predecessor-version":[{"id":577,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/575\/revisions\/577"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/576"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=575"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=575"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=575"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}