{"id":593,"date":"2023-03-14T17:28:01","date_gmt":"2023-03-14T17:28:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=593"},"modified":"2023-03-14T17:28:01","modified_gmt":"2023-03-14T17:28:01","slug":"mirages","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/mirages","title":{"rendered":"Mirages"},"content":{"rendered":"\n<p>Have you ever seen a mirage? Probably the most common is when you look at a hot surface, like a road, and it looks like there is water on that surface. You may be thirsty and want something to drink, but the thing that you desire isn’t really there.<\/p>\n\n\n\n<p>I was trying to get a soda out of a new vending machine at work the other day. I put my money in and punched in the number for the item that I wanted. It’s one of those vending machines with a window showing you what was actually there. But when I put the number of that item in, the display read “sold-out.” In the end, I decided that it must have been a mirage because, to me, the item clearly was there — I wanted it to quench my thirst — but the machine told me otherwise.<\/p>\n\n\n\n<p>Emotions are like mirages in that we can “feel” them, experience them, express them, even measure them but they aren’t something tangible that we touch. You will never find a shelf of emotions at the store, and you won’t have one gifted to you at Christmas.<\/p>\n\n\n\n<p>Our emotions, the way that we feel, can be influenced by any number of things. And they can be influenced by multiple things.<\/p>\n\n\n\n<p>Circumstances are perhaps the one thing that influence our emotions the most. Our lives can be calm or full of stress. We can be with a lot of people or we can be alone. We can have everything that we need or there can be lack.<\/p>\n\n\n\n<p>To some extent, we can control our circumstances but, for a large part of our lives we will not be able to. At least we will not be able to control all of our circumstances. We can try, but we cannot control others in what they say, think or do. And we cannot control all of the events in our lives. We may be able to do the things that bring us joy, but if things change or we are no longer able to do these things, we may need to figure something else out.<\/p>\n\n\n\n<p>Our own beliefs can affect our emotions. We may believe that things should or should not be a certain way. We may believe that others should treat us in a particular way. We may believe that we deserve certain things and that, if we don’t have things the way that we want them, we deserve to be unhappy.<\/p>\n\n\n\n<p>We may experience fears or phobias that can change our feelings in little or big ways. I’ve seen several and have experienced a few myself: mice and the fear of high places probably top my list, while it might be spiders or escalators for others. I understand the cure for a phobia is a gradual acceptance. I’m okay with my phobia, though. Mice, at least the ones that run around the house and eat your food? No thank you.<\/p>\n\n\n\n<p>Age can be another factor. Little children, for example, may lack the communication skills to share their feelings so they will often express themselves through their feelings. You wouldn’t expect a baby, to say “Mother, may I have some milk, shaken not stirred.” Instead, that baby will let you know it’s hungry by crying, happy by laughing, and tired by falling asleep. Okay, that last one wasn’t an emotion, but you get the idea. The thing is that it takes time for us to learn to express ourselves, and it doesn’t happen automatically when we learn to speak.<\/p>\n\n\n\n<p>Hormones can have a big impact on how we feel. I have no idea what it’s like to be a teenage girl, but I do know what it’s like to have been a teenage boy and now a 54 year old man. I understand, well, the impact of stress on emotions and have studied the effect that things like vitamin D can have on an individual. While chemicals may be necessary to correct some issues, the answer may be as simple as a change in diet, a change in scenery, or just getting up and moving. Finding someone to talk to can often go a long way.<\/p>\n\n\n\n<p>Finally, there are choices that we make. I don’t mean the choice to have Coke over Pepsi or the other way around. What I am referring to is the choices that we make, usually ahead of time, of what we will do and will not do in any particular circumstance.<\/p>\n\n\n\n<p>I had a Bible study teacher who told us that he would not let anything or anyone control his emotions. He said that someone might make him happier, but they could not make him happy and, therefore could not make him sad. He also said that he would not take up someone else’s fight, someone else’s anger, not even his own wife’s.<\/p>\n\n\n\n<p>We can also choose to believe God’s Word over anything else. Philippians 4:13 is just one verse which many use (though, perhaps, not always the way that it was intended). It says, “I can do all things through Christ which strengtheneth me.”<\/p>\n\n\n\n<p>We can rejoice because of hope, stand firm in faith or grieve over the things that grieve God. We can “lean not” on our own understanding, instead, putting our trust in an eternal and loving heavenly Father. We can depend solely on our own abilities, or we can pt our trust in God. It is, after all, our choice.<\/p>\n\n\n\n<p>Unfortunately, we aren’t often encourages to use this last option. Such a choice doesn’t sell the latest electronics, the nicest cars or the mind altering drugs, legal or not. It’s not something that someone else can sell us. We often have to find discover this truth for ourselves.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever seen a mirage? Probably the most common is when you look at a hot surface, like a road, and it looks like there is water on that surface. You may be thirsty and want something to drink, but the thing that you&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/mirages\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":594,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14],"tags":[33,3],"class_list":["post-593","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/593","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=593"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/593\/revisions"}],"predecessor-version":[{"id":595,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/593\/revisions\/595"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/594"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=593"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=593"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=593"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}