{"id":596,"date":"2023-03-15T15:53:39","date_gmt":"2023-03-15T15:53:39","guid":{"rendered":"https:\/\/llgt.cafe\/?p=596"},"modified":"2023-03-15T15:53:39","modified_gmt":"2023-03-15T15:53:39","slug":"a-box-of-chocolates","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/a-box-of-chocolates","title":{"rendered":"A Box of Chocolates"},"content":{"rendered":"\n<p>I saw a sign that said “store hours” and wondered where someone might store hours. After a moment, the answer came to me: in an hour glass.<\/p>\n\n\n\n<p>We have a new year. For many, this has been one of the worst years in recent history. Many have had family members die, from one cause or another. Others have family who are struggling for their lives. There have been greater emotional and financial strains for many more this last year than in the past, while others have faced loneliness that hasn’t been matched in previous years. We all recognize that, for many 2020 was a hard year.<\/p>\n\n\n\n<p>There are several ways that we can look at 2021. We can take it as it comes and let it do with us whatever it will. We can feel hopeless to do anything to make things better and, maybe, let another year run over us. Or we can decide that this year is going to be better than the last.<\/p>\n\n\n\n<p>How can we make things better, you may be asking. One way is to see challenges not as bad things, things that come agains us, or things that we have no control of. Yes, some challenges are harder to face than others, but those who gain from challenges are those who refuse to give in and, instead, see each problem as an opportunity: an opportunity to grow, to learn, or as an opportunity to serve others.<\/p>\n\n\n\n<p>My momma didn’t tell me how life was like a box of chocolates but, in a way, it’s true. The problem is that it’s too easy to take a piece of chocolate and, if we don’t like it, to put it back or throw it away and not gain anything from it. In life, we can have life experiences and never learn anything or take anything away from them: the positives, the opportunities to do something differently, or the chance to find the diamond in the rough.<\/p>\n\n\n\n<p>We have more control over how we feel about things than we realize. We can start by controlling what we focus on. Often we focus on the things that matter most to us. Or lives are shaped by the things that we think about, the people that we spend the most time with, the way we entertain ourselves and the things that we either have or find lacking in our lives.<\/p>\n\n\n\n<p>I’m not saying that everything that happens to us happens for a good reason. People die and, many times there is no reason other than people die. There was a time, before sin entered into the world, where there was no death. But that time is gone and won’t come back in this lifetime. We all, at some time, will face the matter of death. It’s not a matter of if but when. Death doesn’t really come to teach us anything. It’s just an end to our time in this life, a passing into the next.<\/p>\n\n\n\n<p>It’s important to believe that what is coming is, at least in some way, going to be better than the past. It’s important to trust that the things that happen to us, the place that we find ourselves, happens for a reason, that no tear is wasted and that every prayer is heard.<\/p>\n\n\n\n<p>I remember when TV was shows like “Gilligan’s Island,” “The Andy Griffith Show” and “Hogan’s Heroes.” Today, we have shows that glamorize murder, crime and open relationships. Maybe it’s time to turn off the TV. Maybe it’s time to start spending more time with those we love. Maybe, instead of focusing on our own wants and desires, we need to begin to focus on the needs of others.<\/p>\n\n\n\n<p>We see what we focus on, often leaving the rest of the world behind. This year, what are you going to focus on? What might you do differently this year? How might you choose to see things differently? What might you do differently? What might I do differently?<\/p>\n\n\n\n<p>We can’t store hours. We can’t save them up, and we don’t know how many we are going to have. So use the time that you have wisely. Choose what you focus on and decide what really matters, spending your time with things that matter and less time on things that don’t. Laugh, enjoy life, and ask yourself the important questions while there’s still time. We can’t control how much time we have, but we can choose what we do with the time that we have.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I saw a sign that said “store hours” and wondered where someone might store hours. After a moment, the answer came to me: in an hour glass. We have a new year. For many, this has been one of the worst years in recent history.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/a-box-of-chocolates\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":597,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,50],"tags":[3],"class_list":["post-596","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-humor","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/596","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=596"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/596\/revisions"}],"predecessor-version":[{"id":598,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/596\/revisions\/598"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/597"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=596"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=596"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=596"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}