{"id":599,"date":"2023-03-16T14:00:00","date_gmt":"2023-03-16T14:00:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=599"},"modified":"2023-03-15T16:01:49","modified_gmt":"2023-03-15T16:01:49","slug":"educations-benefits","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/educations-benefits","title":{"rendered":"Education&#8217;s Benefits"},"content":{"rendered":"\n<p>I wish that an education could make all of our lives better. I wish it were that easy, but it’s not.<br>Growing in our knowledge base does have several benefits.<\/p>\n\n\n\n<p>One benefit is that being smart, or at least feeling smart can help us feel better about ourselves. No doubt there are going to be people or tests who are more than willing to tell us what we don’t know or what we’re not good at. We don’t have to listen to them, but it is nice to feel that we are good at something.<\/p>\n\n\n\n<p>Knowing how to do something may also give us an advantage in our marketplace. Simply putting our experience into a resume may help a person start out at a higher wage and, over time, that money can add up.<\/p>\n\n\n\n<p>While learning about one subject may help us excel in one area, knowing more about different areas can help us converse with different people. Having an overall curiosity can do pretty much the same thing.<\/p>\n\n\n\n<p>I think it’s important that we stay curious, that we never loose the urge to learn. Stop learning and you start dying. Yet it seems to me that people, younger and younger are form their opinions with a “no one’s going to change my opinion” mentality.<\/p>\n\n\n\n<p>I think that continuing to learn helps keep our minds younger, too. Yes, it depends, in large part on the things that we take into out bodies and the other things that we do. Our body acts like a machine; fail to take care of it, damage it in some way and it won’t work the way that is supposed to. On the other hand, if we take care of ourselves, if we feed both our bodies and our minds properly, we’re likely to be better off in the long run.<\/p>\n\n\n\n<p>I say better off, but we will not necessarily be better people. The saying that a little knowledge can be dangerous may just be true. But it depends on our character and on our decisions. Give two people $1,000 and one may turn it into a $100 thousand, while the other may loose $99 at the casino. Our character and personal drive have more power to take us places than any amount of knowledge.<\/p>\n\n\n\n<p>There are also a couple of problems with knowledge. One is that knowledge without drive or direction won’t take us anywhere. It’s like having a Ford Mustang that we keep in neutral, while knowledge without character may take us down the wrong road. Knowledge is simply a tool. It can be a good thing in the right hands, or it could be misused in the wrong hands.<\/p>\n\n\n\n<p>I’ve been around long enough to see that some people seem to feel that their education makes them better than others. Indeed, more education can help, but it does not make one group better than another. Our value ought to come from our creator, and we ought to use whatever we have to help others. It can be a tough lesson to learn but there is nothing that we have that we have not been given by God. It should make us more humble rather than more proud. And it should be this perspective that helps us shape our view of ourselves as well as those around us.<\/p>\n\n\n\n<p>Another problem, if you want to see it this way, is that the things that we “know” is constantly changing. The things that we thought were true just a few years ago may have been revised or even proven wrong. Or there may be a better way to do something that we’ve been doing all of our lives.<\/p>\n\n\n\n<p>At the same time, there is so much information that it’s impossible to keep up. I heard a story about a woman who entered her chosen career field and, because she failed to keep learning, those who entered the same career filed just a few years later were way ahead of her and she felt like there was no way to keep up.<\/p>\n\n\n\n<p>Also, you may have heard the saying, “You can’t take it with you (when you die).” I have a hard time believing that we forget everything when we die. Perhaps, it’s just that there won’t be a use for many of the things that we’ve learned in this life. There won’t be cars that break down and need to be fixed, there won’t be computers that need to be programmed, and their aren’t likely to be a need for lawyers to defend us.<\/p>\n\n\n\n<p>If you want to work on something, work on your character. Work at being a better person, loving others rather than judging them. Choose to look for similarities rather than differences, and ways to encourage rather than discourage. At the same time, never give up your curiosity. And never stop learning.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I wish that an education could make all of our lives better. I wish it were that easy, but it’s not.Growing in our knowledge base does have several benefits. One benefit is that being smart, or at least feeling smart can help us feel better&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/educations-benefits\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":600,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,15],"tags":[3],"class_list":["post-599","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-emotional","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/599","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=599"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/599\/revisions"}],"predecessor-version":[{"id":601,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/599\/revisions\/601"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/600"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=599"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=599"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=599"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}