{"id":602,"date":"2023-03-17T14:00:00","date_gmt":"2023-03-17T14:00:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=602"},"modified":"2023-03-15T16:05:39","modified_gmt":"2023-03-15T16:05:39","slug":"travel-while-you-work","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/travel-while-you-work","title":{"rendered":"Travel While You Work"},"content":{"rendered":"\n<p>If you are thinking about picking up and traveling, whether you plan on spending the year traveling around your area or you plan on spending some time in another country, there are more options now then there were just twenty or thirty years ago. Internet and high speed communication has not only allowed people in places outside of the United States to do jobs that once had to be done domestically but also allow people to take many jobs wherever they want.<\/p>\n\n\n\n<p>You may not need a computer for this first one, though many restaurants use computers these days to keep track of their inventory. When I went into the military, I wanted something that I could use when I got out. I wasn’t interested in being a mechanic or learning something that might be so specialized that it would be of no use when I got out. Maybe you’ve heard of the degree in underwater basket weaving. It’s one of those jobs that it’s hard to find in the market place. Or maybe a degree in general studies.<\/p>\n\n\n\n<p>It turned out that what I learned about cooking was only a small part of my culinary education. It did, however, lead to most of my international travel but certainly not most of my domestic travel.<\/p>\n\n\n\n<p>Photography is another thing that I would like to do. I’ve been able to take pictures wherever I go, but I’ve never been able to do it professionally. The amount of money that I’ve made over the years likely wouldn’t pay even a month’s worth of rent, now. Yet there are wedding photographers, photojournalists and photographers who make YouTube videos who are able to travel to different parts of the world and make at least enough money to live off of.<\/p>\n\n\n\n<p>One of my friends in Spokane had a business promoting concerts. This job took him over a wide area of the United States, with offices in at least a few states and at least a few hundred employees.<\/p>\n\n\n\n<p>I have another friend who is a doctor. I’m not sure whether or not he travels, but I know that there are doctors who travel on missions trips, often offering free services in areas where medical help may be harder to find. There are even huge ships dedicated to helping people in these areas, all paid for by donations and run mostly by volunteers.<\/p>\n\n\n\n<p>Speaking of volunteering, I knew someone who was planing to go to Hawaii to work on an organic farm. This work was volunteer work, but I guess he had enough money saved up that it wasn’t an issue for him. Some of the students from the culinary school where I attended went to places like New York City to work for top chefs on television programs, not for any money but for the ability to be able to put it on their resume and for the money that they might be able to make later in their careers.<\/p>\n\n\n\n<p>If you can get your own television show, that may allow you to travel. Being in movies might do the same, though more and more movies these days do their travel virtually these days. If you can’t get a studio to pay your way, maybe YouTube or some other form of social media will.<\/p>\n\n\n\n<p>If you can do well enough on Amazon, selling your products online or making money through affiliate marketing, then you should be able to pay your own way. I found one family on YouTube, The Kelley Krew, that was able to take to the road with a family of six, now seven, and spend that year in a large travel RV and truck.<\/p>\n\n\n\n<p>There are other jobs as well that will allow you to travel, whether you are working for someone else or working independently: whether you require $100 thousand or more to get through the year or just a few hundred a month to get by. it’s all up to you. And, of course, local restrictions on travel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you are thinking about picking up and traveling, whether you plan on spending the year traveling around your area or you plan on spending some time in another country, there are more options now then there were just twenty or thirty years ago. Internet&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/travel-while-you-work\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":603,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,40,61],"tags":[3],"class_list":["post-602","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-making-money","category-travel","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/602","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=602"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/602\/revisions"}],"predecessor-version":[{"id":604,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/602\/revisions\/604"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/603"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=602"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=602"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=602"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}