{"id":608,"date":"2023-03-19T14:00:00","date_gmt":"2023-03-19T14:00:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=608"},"modified":"2023-03-15T16:11:43","modified_gmt":"2023-03-15T16:11:43","slug":"does-it-matter","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/does-it-matter","title":{"rendered":"Does It Matter?"},"content":{"rendered":"\n<p>Does truth matter? Children can answer this question pretty easily: yes, it does matter. But as we grow up — grow older — it may be an answer that we begin to challenge. There are those who would say that there is no absolute truth. Is that true? Perhaps the answer is yes, and no.<\/p>\n\n\n\n<p>If someone falls from the window of a tall building, is that person going to die? Many people have attempted suicide this way, and many of them have succeeded. I remember the story when I was quite young of a man who jumped from a very high building, perhaps in Chicago or New York City. It seems that it was very windy that day, so the wind blew him back onto a ledge, mostly unharmed, just a few stories below.<\/p>\n\n\n\n<p>I’ve also heard of babies that fall from windows and land safely in bushes, children that are run over and survive, being protected by the soft ground beneath them. I knew a man who was one of perhaps a few survivors after the crash of a military aircraft. On the other hand, I’ve heard of those who suffer seemingly minor injuries and die.<\/p>\n\n\n\n<p>The truth is a big question during this election, or at least it should be. It seems that both sides have very different points of views. So, who is right, and will we ever know the answer. Years after the deaths of Abraham Lincoln JFK and Martin Luther King, Jr., there are still unanswered questions.<\/p>\n\n\n\n<p>Does it matter that we still don’t have answers? Maybe. Maybe not.<\/p>\n\n\n\n<p>I had a friend whose brother wound up in the hospital from a gunshot wound to the head. He should have died, but wound up with damage to his face, instead. His wife and her boyfriend say that he shot himself, but there at least some evidence, it would seem, that the boyfriend came from behind and shot my friend’s bother while he argued with his wife. He does’t remember what happened, so it’s likely that the case will never be solved. And there are likely countless cases like this.<\/p>\n\n\n\n<p>Right now, I would have to say, there are millions who are looking forward to spending at least some of eternity in Heaven. Yes, for some reason, some are looking forward to Hell, though this baffles me immensely. In this case, there are way more than two views.<\/p>\n\n\n\n<p>So, let&#8217;s go back to the initial question: does truth matter?<\/p>\n\n\n\n<p>“Jesus saith unto him, I am the way, the truth, and the life: no man cometh unto the Father, but by me.” — John 14:6 (KJV)<\/p>\n\n\n\n<p>Was Jesus telling the truth? Did he really mean that he was “a way”? Because the answer that you give may help determine where you spend eternity.<\/p>\n\n\n\n<p>I may be wrong about this but considering the length of eternity, it doesn’t seem right that people are likely to spend more time considering the purchase of their next vehicle than to consider their beliefs on any spiritual matter. Doing our lives, we are likely to make a lot of choices, taking time to consider them all. Yet, the Bible tells us that, compared to eternity, our lives are but a vapor, a puff of smoke. Shouldn’t we, therefore, take a little more time to think about eternity and why we believe that we will enter Heaven at the end of this life?<\/p>\n\n\n\n<p>Maybe you don’t believe in absolutes. Are you sure of that? I have to admit that, just as I begin to think that I’ve heard everything, someone else comes along with a different theory.<\/p>\n\n\n\n<p>In the 40 years that I’ve called myself a Christian, I’ve heard a lot of different teachings. Many of them conflict with one another. Some truths may seem to conflict, but some times you have to ask if you are looking at two sides of the same coin. The important thing is that we keep asking questions and that we keep looking for answers. As for me, I look to the Bible for the answers. The problem is that others also look to the Bible for their answers, and what they find paints a very different picture.<\/p>\n\n\n\n<p>Over the years, I’ve asked a lot of questions. I still ask questions because I don’t have all the answers. I don’t know everything. There are things that I never learned, things that I remember incorrectly, and things that I’ve forgotten, or at least moved to some remote location in my mind.<\/p>\n\n\n\n<p>I remember family arguments about how the Bible’s claim of having emotions in the gut couldn’t be anatomically correct, yet we are just beginning to understand the role of the nervous system and how it extends outside of the skull and into other parts of the body. We may think we know everything, but we don’t; only God knows everything. And it’s likely that, no matter how many implants that we put in our brains or how many books that we read, we will never know as much as God. To that extent, we must trust whether or not we will believe God or the Bible.<\/p>\n\n\n\n<p>Is there truth and does it matter? Ask a child? Ask him if it matters if an adult breaks a promise or if it matters whether or not someone tells him the truth. I think you know the answer. I think the answer is within you, too.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Does truth matter? Children can answer this question pretty easily: yes, it does matter. But as we grow up — grow older — it may be an answer that we begin to challenge. There are those who would say that there is no absolute truth.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/does-it-matter\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":609,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,35,14],"tags":[33,5,3],"class_list":["post-608","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-question","category-spiritual","tag-bible","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/608","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=608"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/608\/revisions"}],"predecessor-version":[{"id":610,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/608\/revisions\/610"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/609"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=608"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=608"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=608"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}