{"id":621,"date":"2023-03-22T16:57:24","date_gmt":"2023-03-22T16:57:24","guid":{"rendered":"https:\/\/llgt.cafe\/?p=621"},"modified":"2023-03-22T16:57:24","modified_gmt":"2023-03-22T16:57:24","slug":"knowing","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/knowing","title":{"rendered":"Knowing"},"content":{"rendered":"\n<p>James 1: 5-6 (KJV) tells us that, “If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.But let him ask in faith, nothing wavering. For he that wavereth is like a wave of the sea driven with the wind and tossed.”<br>Often, we lack faith because we aren’t really sure what we believe. Any time we start anything new, it takes time to learn what we need to know. Hopefully, we can learn the fundaments early, but that may take years. Studies like law and medicine, and even culinary arts can take years to master and, still, one can never learn everything that there is to learn. Odd thing is that there are a wide variety of opinions in any field of study. And religion is no exception.<br>If we aren’t sure what we believe, it’s easy to be swayed by the latest thing that we’ve heard. It is important, therefore, to be careful who we are listening to. At the same time, it can be good to seek out different opinions, even if we think that we’ve already heard it all.<\/p>\n\n\n\n<p>Current social media is often set up to flood us with one view, while sometimes blocking other options, whether by our choice or by the choice of an algorithm, or both.<br>Not knowing affects other areas of our lives, too. Studies have shown that, the earlier people know their life’s path, the more successful they will be in reaching their goals. Not knowing what we want to do can cause us to waste not only money, but years of our lives. Yet, even if we missed getting an early start, it’s never too late to decide what we want to do with our lives.<br>There are a few things that can help us determine what we might do next. We cannot say that what we do next will determine the rest of our lives, for too much is outside our control. But we can decide what direction we would like to take.<br>The first thing that we can do is to write down some goals. If you don’t know where you want to go, it becomes easy to live life in a rut, where it may seem like we aren’t getting anywhere. Yet, even these times can teach us something. I like to use a computer to type out my goals.<br>Be specific. Instead of writing that you want make a lot of money and retire early, determine how much money that you need to retire, when you would like to retire, a date you will start saving and a clear plan on how much you will need to save or invest each year between now and retirement. Also, have a clear idea of what you want retirement to look like. Do you want to live on a beach or a mansion?<br>Be realistic. It’s okay to dream big. One of my favorite books was Ann Kiemel’s book, “I Love the Word Impossible,” where she talks about dreaming things that only God can do. But I do not want and will never play pro football in the NFL, and I will never become a sky diver. No thank you. But there are lots of things that I can decide that I want to do and, though I may never perfect any particular skill, I can get better at just about anything I work at.<br>Another thing we can do is to talk to friends — those that know us best. Find out what they think that we are or might be good at. Years ago, someone told me that I should have been a librarian because of my many interests. Today, I use that in my blog.<br>Finally, start small. Intentionally, figure out what the least you can do is and do that. If you want to run a marathon, start with a five or ten minute walk. Don’t try, on day one, to run 5 or 6 miles because you are much more likely to give up. Do this with any new habit that you want to incorporate into your routine. I made a list of things that I want to do each day on a dry erase board and I check them off as I do them. My list has 16 things to do and I don’t put things that I’m already in the habit of doing. This can also help limit the time that we spend checking emails, taking phone calls and checking social media.<br>Being free to do whatever can be nice, but having and reaching goals can give us a sense of purpose. It can also help keep us from waking up and realizing that we’ve “wasted” our time on this Earth. Knowing what we believe also helps us when we pray. And if you need wisdom, ask God.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>James 1: 5-6 (KJV) tells us that, “If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.But let him ask in faith, nothing wavering. For he that wavereth is&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/knowing\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":622,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,67,51,14,29,45],"tags":[33,20,8,5,3],"class_list":["post-621","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-habits","category-personal-growth","category-spiritual","category-think-about-it","category-tips","tag-bible","tag-finances","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/621","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=621"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/621\/revisions"}],"predecessor-version":[{"id":623,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/621\/revisions\/623"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/622"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}