{"id":624,"date":"2023-03-23T16:17:00","date_gmt":"2023-03-23T16:17:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=624"},"modified":"2023-03-23T16:17:00","modified_gmt":"2023-03-23T16:17:00","slug":"present-perfect","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/present-perfect","title":{"rendered":"Present Perfect"},"content":{"rendered":"\n<p>The search for perfection may be nearly as elusive as the search for the fountain of youth. We may, perhaps, be able to obtain near perfection in at least one area of our lives, but it’s usually fleeting. And we can always find someone who has more money, knows more or is “more beautiful.”<br>Perfection really should not be our goal. Instead, our goal should be continual improvement. If we set out to do something new with the thought that we will execute our plan perfectly on our first attempt, we are likely to become discouraged and give up. Instead, if we realize that learning is a process of trying new things and failing often, then we are more likely to continue, even after numerous “failures.”<br>Failure is a tricky thing. It can cause us to quit, or we can say to ourselves, “That didn’t work. What can I learn from it?” If children saw failure as some adults do, many of us would still be unable to walk, talk or do simple tasks that many of us take for granted.<br>Television, movies, magazines, advertising and social media don’t really do us any favors in this area. Advertising, for example, shows us the prettiest of people, and always so happy, doing the things that we wish we could do and using a product that we never realized just how much we now need. Then, when we get that thing, our lives still don’t match the image presented to us in the ad.<br>Whatever it is that we want to accomplish, whether it’s something big or something small, we should realize that it may take several attempts to get the results that we are looking for. And we aught to be willing to fail more than once, even if it allows others to see that we aren’t perfect. Know this, they aren’t perfect either.<br>There’s one other thing to keep in mind. Often, we limit our view on the different areas of our life. In finances, for example, we limit our idea of success to money, homes and cars. But family and friends are a treasure that cannot be bought with money. Real love cannot be purchase with a credit or debit card. And there is so much more to beauty than perfect skin. Keep that in mind when you look in the mirror or are tempted to compare yourself with someone else.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The search for perfection may be nearly as elusive as the search for the fountain of youth. We may, perhaps, be able to obtain near perfection in at least one area of our lives, but it’s usually fleeting. And we can always find someone who&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/present-perfect\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":625,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[29,45],"tags":[3],"class_list":["post-624","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-think-about-it","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/624","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=624"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/624\/revisions"}],"predecessor-version":[{"id":626,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/624\/revisions\/626"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/625"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=624"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=624"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=624"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}