{"id":627,"date":"2023-03-24T17:33:50","date_gmt":"2023-03-24T17:33:50","guid":{"rendered":"https:\/\/llgt.cafe\/?p=627"},"modified":"2023-03-24T17:33:50","modified_gmt":"2023-03-24T17:33:50","slug":"who-to-trust","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/who-to-trust","title":{"rendered":"Who To Trust"},"content":{"rendered":"\n<p>How do you know who to trust? I had a friend ask me once how I knew that I could trust her, and I don’t think I really had an answer at the time. There are people whom we trust right away, and there are people who give us warming signs, but we don’t always see these signs right away, and it’s easy to ignore the warning signs.<\/p>\n\n\n\n<p>Websites like Facebook do fact checking on at least some of the posts that are put on their website. And though most of them just seem annoying, some of them are probably helpful.<\/p>\n\n\n\n<p>Trust is a process that either grows or diminishes with time. It would be great if people wore signs that said “trustworthy” or “untrustworthy”, but no one does. I tend to trust people until they prove themselves untrustworthy. Mistakes can be forgiven, but a pattern of lying or abuse should be a big warning sign.<\/p>\n\n\n\n<p>In some relationships, the breaking of trust doesn’t affect us as much. In marriage, it can have a lasting impact that can not only affect the married couple but can have a negative impact on the children.<\/p>\n\n\n\n<p>Trust is so important. We don’t fully understand it’s real value. Rather than trying how to get trust back, it’s best not to loose it at all. If there is any hope of regaining someone’s trust, it has to be done right away.<\/p>\n\n\n\n<p>Proverbs says that a good name is better than riches. How great is the lost if trust has been lost. Yes, we can forgive someone who betray our trust. We can forgive and move on. Jesus said, when asked how many times we should forgive, answered 70 times 7. But there is a thin line between forgiving and enabling, and each of us has to trust ourselves to know the difference.<\/p>\n\n\n\n<p>One last thing: if we don’t trust others, we bought to look at our own lives. If we generally don’t trust others, is it because we, ourselves are untrustworthy? Do we trust others? If so, we risk being hurt. But if we don’t trust, we risk not building relationships and destroying other relationships. Who do you trust? In the end, you have to decide for yourself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How do you know who to trust? I had a friend ask me once how I knew that I could trust her, and I don’t think I really had an answer at the time. There are people whom we trust right away, and there are&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/who-to-trust\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":628,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[59,29],"tags":[33,3],"class_list":["post-627","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-recipe","category-think-about-it","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/627","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=627"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/627\/revisions"}],"predecessor-version":[{"id":629,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/627\/revisions\/629"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/628"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=627"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=627"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=627"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}