{"id":630,"date":"2023-03-25T17:41:34","date_gmt":"2023-03-25T17:41:34","guid":{"rendered":"https:\/\/llgt.cafe\/?p=630"},"modified":"2023-03-25T17:41:34","modified_gmt":"2023-03-25T17:41:34","slug":"what-ifs","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-ifs","title":{"rendered":"What ifs"},"content":{"rendered":"\n<p>It can be fun to play the what if I won the lottery game. Unfortunately, if you’re like most of us, it can be easy to get stuck in the other side of what ifs: the what if I loose my job, or what if I cannot pay rent, or what if I cannot buy groceries next month. The list could go on. The reality is that these things are true for many people. Yet, worrying about the possibility of these things happening doesn’t really help.<\/p>\n\n\n\n<p>It certainly doesn’t hurt to prepare for certain things, like job loss. The Bible clearly teaches that we ought to prepare for lean times when we are able to do so. Yet the Bible also teaches that God is our provider and that He is more than able to meet our needs. So, which is it? Both, really. He gives us what we need, but some times we should set aside part of what we have for the more difficult times.<\/p>\n\n\n\n<p>There are a few problems that we tend to face. One is that, when times are good, we tend to think that they are going to stay that way indefinitely. When things are bad, we might be tempted to think that they will never get better. Or, things may be good, but we spend our time worrying about things that are often beyond our control. And, when things do take a turn for the worse, we may feel that no one understands how we feel, which can lead to loneliness and depression.<\/p>\n\n\n\n<p>Hebrews 4:15 (KJV) tells us that “For we have not an high priest which cannot be touched with the feeling of our infirmities; but was in all points tempted like as we are, yet without sin.” What this means is that Jesus understands how we feel. It means, too, that Jesus is able to take care of not only our physical and emotional needs, but he is able to take care of the sin that separates us from God. And, if we have a relationship with God thought Jesus, then we have the hope of eternal life.<\/p>\n\n\n\n<p>Still, the hope of eternal life doesn’t negate the problems that we face in this life. In fact, in John 16:33 (KJV), Jesus says, “These things I have spoken unto you, that in me ye might have peace. In the world ye shall have tribulation: but be of good cheer; I have overcome the world.”<\/p>\n\n\n\n<p>I have found that playing the what if I won the lottery game hasn’t made me any richer. And drawing my dream home hasn’t made it any more of a reality. But I’ve also learned that worrying about what might happen is also a waste of time and emotional energy. Whatever good times I’ve had, God has been there. Whatever difficulties I’ve faced, God has been there. And we get though it together.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It can be fun to play the what if I won the lottery game. Unfortunately, if you’re like most of us, it can be easy to get stuck in the other side of what ifs: the what if I loose my job, or what if&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-ifs\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":631,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14],"tags":[33,8,7,5,3],"class_list":["post-630","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/630","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=630"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/630\/revisions"}],"predecessor-version":[{"id":632,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/630\/revisions\/632"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/631"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=630"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=630"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}