{"id":633,"date":"2023-03-26T16:36:27","date_gmt":"2023-03-26T16:36:27","guid":{"rendered":"https:\/\/llgt.cafe\/?p=633"},"modified":"2023-03-26T16:36:27","modified_gmt":"2023-03-26T16:36:27","slug":"what-would-you-do","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-would-you-do","title":{"rendered":"What would you do?"},"content":{"rendered":"\n<p>If you could do anything that you wanted for 2023, what would it be? What would you do if money weren’t a problem and you didn’t have to worry about bills or anything else?<\/p>\n\n\n\n<p>I was talking to a friend at church this morning. She and her husband are retired. Retirement is what a lot of people look forward to. It’s a “simple” formula: work, save and retire. My friend told me that not much changes from day to day, except for visits to the doctor.<\/p>\n\n\n\n<p>If I could do anything, one of my choices would be to work as a photographer for “Sports Illustrated”. I would love to go to as many games as I could just to take pictures. But I would also like to get to know some of the people who I was photographing. I doubt that my pictures are quite good enough to make it into Sports Illustrated, but that is what I would like to do.<\/p>\n\n\n\n<p>I would also like to be in a program where I was helping kids. I think kids need a good start to life, and there are so many ways to help kids: teaching and coaching are just a couple of ways. There are kids who need mentors, there are kids who just need to know that they are loved: that their lives have value and that they, too, have something to contribute. By the way, these are needs that never go away.<\/p>\n\n\n\n<p>At one point, I could have been an artist. I would have loved to have an artist’s studio of my own, and to have created great works of art for others to see: paintings or even photographs.<\/p>\n\n\n\n<p>I would love to travel. There are still so many places that I have never been, even in the United States: Oregon, Alaska and Hawaii, just to name a few. I would like to go to Portugal, Israel and I wouldn’t mind going back to some places like Oxford, Bath or Scotland.<\/p>\n\n\n\n<p>I love to cook, but I can’t picture myself working in a restaurant, either as a cook or a chef. I could picture myself as the owner of a restaurant, but that’s not really top of my list of things to do.<\/p>\n\n\n\n<p>In the end, it’s not what I do that makes me happy but realizing that I can be happy with who I am: the good, the bad and the ugly. If we can’t learn to be happy with ourselves where we are, we probably won’t be happy with ourselves when we get to where we want to be.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you could do anything that you wanted for 2023, what would it be? What would you do if money weren’t a problem and you didn’t have to worry about bills or anything else? I was talking to a friend at church this morning. She&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-would-you-do\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":634,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[35],"tags":[3],"class_list":["post-633","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/633","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=633"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/633\/revisions"}],"predecessor-version":[{"id":635,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/633\/revisions\/635"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/634"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=633"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=633"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=633"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}