{"id":636,"date":"2023-03-27T16:47:38","date_gmt":"2023-03-27T16:47:38","guid":{"rendered":"https:\/\/llgt.cafe\/?p=636"},"modified":"2023-03-27T16:47:38","modified_gmt":"2023-03-27T16:47:38","slug":"will-the-real-god-please-stand-up","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/will-the-real-god-please-stand-up","title":{"rendered":"Will the real God please stand up?"},"content":{"rendered":"\n<p>You may be familiar with a television show where three people — one being the person in question and two others pretending to be that person — would answer questions to see if others could guess who the actual person was. Unfortunately, after so many years, so many of us still don’t know who God is.<\/p>\n\n\n\n<p>One Bible verse that many will quote is “God is love,” found in 1 John 4:16. This is often used in conjunction with “thou shalt not judge,” meaning, “I can do whatever I want.”<\/p>\n\n\n\n<p>There are two things God requires. The first is that we love Him more than anyone or anything else. The second is that we love others as ourselves. Yet, we can only do this when we truly understand who God is and what He has done for us.<\/p>\n\n\n\n<p>You may think it egotistical for God to want all of our love, all of the glory and all of our praise. Yet, when was the last time that you or I created anything from nothing? Right, God created it all and everything belongs to Him.<\/p>\n\n\n\n<p>Still, there are many who claim to have a relationship with God, individuals who know that God loves them, who believe that God is an angry God, just waiting for a chance to strike them with lightning or some other death.<\/p>\n\n\n\n<p>The problem is that we — I know I’m guilty of this — can mistake the consequences of our own actions as a sign for whether or not God loves us. Yes, God does allow us to suffer when we make the wrong choices, but that’s an indication that He does love us.<\/p>\n\n\n\n<p>So much of what we think about God comes from our relationship with our own parent(s) or guardians. But each of us is flawed, so our view of God can be flawed. And, sadly, there aren’t many who teach a true perspective on God’s love. Far too many teach that either their god is an angry god or that they, themselves, have to earn God’s love. I think that “Daddy’s Song,” a song by Dennis Jernigan, taught me more about God’s love than anything that I had heard or read. The song is nearly 19 minutes, but it is well worth the time.<\/p>\n\n\n\n<p>The song tells of a relationship between a father an his son. It tells of the great love that the two have for each other. Now, even after the son messes up, the father sill loves the son. In fact, the father loves the son so much, that he takes the consequences of the son’s actions on himself.<\/p>\n\n\n\n<p>In reality, we all mess up in one way or another. Romans 3:23 (KJV) tells us that, “For all have sinned, and come short of the glory of God.” But Romans 5:8 (KJV) tells us that , “But God commendeth his love toward us, in that, while we were yet sinners, Christ died for us.” What does God require of us? Just that we believe what He has said.<\/p>\n\n\n\n<p>Yes, all we need is faith. We must trust that God is who He says He is and that we are who He says that we are. And, though it can be easy to look at ourselves and ask “How can God love me?,” we ought still trust that He does. The alternative is to doubt and the Bible tells us that , without faith, it is impossible to please God.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-4-3 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Dennis Jernigan - &quot;Daddy&#039;s Song&quot; FULL SONG!\" width=\"1200\" height=\"900\" src=\"https:\/\/www.youtube.com\/embed\/FcbtPEQUUsE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n","protected":false},"excerpt":{"rendered":"<p>You may be familiar with a television show where three people — one being the person in question and two others pretending to be that person — would answer questions to see if others could guess who the actual person was. Unfortunately, after so many&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/will-the-real-god-please-stand-up\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":637,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,35,14],"tags":[33,8,7,5,3],"class_list":["post-636","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-question","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/636","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=636"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/636\/revisions"}],"predecessor-version":[{"id":638,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/636\/revisions\/638"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/637"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=636"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=636"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=636"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}