{"id":639,"date":"2023-03-28T16:32:46","date_gmt":"2023-03-28T16:32:46","guid":{"rendered":"https:\/\/llgt.cafe\/?p=639"},"modified":"2023-03-28T16:32:46","modified_gmt":"2023-03-28T16:32:46","slug":"change","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/change","title":{"rendered":"Change"},"content":{"rendered":"\n<p>Something caught my attention on the way home from church the other day. I don’t think I noticed it on the way to church because I was in a bit of a hurry. It was a building, or lack of one, where one of the restaurants from my past had once stood. I don’t drive that way often, and it was kind of a surprise to see that it had been torn down and lay in a heap of rubble. Actually, there were two buildings side by side, and I can’t really say I remember much about the other building.<\/p>\n\n\n\n<p>Whether we like it or not, we all face change. We grow older, move, find and loose friendships and so on. Change is easier for some of us and harder for others. But that can change, too. Someone who easily accepts change can find change more difficult in times of stress. And, though we may be the ones initiating a change, more often, it is “forced” upon us.<\/p>\n\n\n\n<p>I cay forced in quotes because we always have a choice. We may not like the choices that we have but that doesn’t negate that we have the ability to choose. One job that I had changes that came on a regular basis. Now, I could have refused to abide by these changes and I probably would have been let go. Or, I could have found another job. But I’m usually okay with change, so I stayed, until other circumstances changed.<\/p>\n\n\n\n<p>Whether change is good or bad depends on how we perceive it. And even our perception of a particular event can change over time. We have the ability to choose how we see things. James 1:2-3 tells us that we can rejoice when we find ourselves in hard times because it’s the hard times that produce strength and character in us. No, I don’t enjoy hard times, but I am aware that rain brings flowers; the flow of water and wind can bring new beauty to landscapes.<\/p>\n\n\n\n<p>Whether I find myself facing a change, in the midst of change or trying to deal with change that has already occurred, I find the best thing to do is pray. I can pray that God will help me though the situation. Some times, I find myself fearing change that may or may not happen and so I remind myself of verses like Philippians 4:6 that tells us that we shouldn’t worry but should pray, instead.<\/p>\n\n\n\n<p>Probably the worst thing that we can do is to give up. We may surrender a situation to God, but that doesn’t mean that we give up our responsibility to deal with the change that we face. And suicide is never the answer. Usually, the problems will go away. But even if they won’t, we can find joy in the midst of our pain. We can adapt and overcome.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Something caught my attention on the way home from church the other day. I don’t think I noticed it on the way to church because I was in a bit of a hurry. It was a building, or lack of one, where one of the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/change\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":640,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,13,29],"tags":[3],"class_list":["post-639","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-open-for-discussion","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/639","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=639"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/639\/revisions"}],"predecessor-version":[{"id":641,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/639\/revisions\/641"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/640"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=639"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=639"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=639"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}