{"id":64,"date":"2022-10-30T16:45:42","date_gmt":"2022-10-30T16:45:42","guid":{"rendered":"https:\/\/llgt.cafe\/?p=64"},"modified":"2022-10-30T16:45:42","modified_gmt":"2022-10-30T16:45:42","slug":"what-should-we-do","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-should-we-do","title":{"rendered":"What should we do?"},"content":{"rendered":"\n<p>I went for a walk, yesterday. In an older part of town, I walked past a man, sleeping on a bench. He was, perhaps, in his forties. Some times it’s hard to tell. Being out in the sun so many hours, so many days, ages a person. It was pretty clear that this man didn’t have a place to call home.<\/p>\n\n\n\n<p>It’s hard, some times, to know what to do when I see someone who is on the streets. It seems that there are more, these days. And, it may be my imagination, but it seems that those begging for money are getting younger.<\/p>\n\n\n\n<p>Some people don’t have a home because of a temporary situation. But a fair number of them live this lifestyle out of choice. It’s a hard life. Summers are hot, winters are cold, and it often rains. And it can be unsafe to be out on the streets. Why, I wonder, would anyone choose a life like this?<\/p>\n\n\n\n<p>I got to talk to a lady who was holding a sign outside one of the local grocery stores asking for money. In our conversations, I found out that she likely grew up in government housing. It may be that she has lived her whole life expecting a handout. At least she was, last time we spoke, looking for work.<\/p>\n\n\n\n<p>I’m hesitant to give someone who is begging money. It’s too easy to use this money to buy drugs or alcohol. There are some who to are forced to beg for money and are forced to give this money to someone else as a form of modern day slavery. Some times, I’ve given someone food. If someone comes up to me and says they need money for gas, I say no. It just has that feeling of being a scam. But there are other times when it’s not as easy to tell.<\/p>\n\n\n\n<p>If there is one thing that seems to be lacking in the lives of the “homeless”, it seems to be that there is lack of personal responsibility. Rather than taking charge of their lives and working to make changes on their own, what I have seen is a belief that someone else is going to come along and somehow make things better.<\/p>\n\n\n\n<p>I’m not saying that we, as communities and as a nation, should not help those who are truly in need. I’m not talking about people with real disabilities. What I am talking about is people who have, for whatever reason, ended up on the streets and seem to make a living begging others for money.<\/p>\n\n\n\n<p>What I have seen present is a sense of community. I’ve seen that, some times, these people help each other. They listen to one another and they likely realize that one of the greatest resources that we have is the other people in our lives.<\/p>\n\n\n\n<p>It seems to me, what most of these people need isn’t a hand out but a hand up. They need someone to get close enough to invite them into their lives so that they can see the life that they could be living. What they need is someone who can be a model of what it means to take responsibility for one’s own life.<\/p>\n\n\n\n<p>What do you do when you see someone begging for money? I think compassion is important, but I also don’t want to do something that is going to help keep someone else in the lifestyle of depending on others. What do you think? Maybe you have some ideas.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I went for a walk, yesterday. In an older part of town, I walked past a man, sleeping on a bench. He was, perhaps, in his forties. Some times it’s hard to tell. Being out in the sun so many hours, so many days, ages&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-should-we-do\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":65,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[13],"tags":[3],"class_list":["post-64","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-open-for-discussion","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/64","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=64"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/64\/revisions"}],"predecessor-version":[{"id":66,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/64\/revisions\/66"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/65"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=64"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=64"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=64"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}