{"id":643,"date":"2023-03-29T16:12:28","date_gmt":"2023-03-29T16:12:28","guid":{"rendered":"https:\/\/llgt.cafe\/?p=643"},"modified":"2023-03-29T16:12:28","modified_gmt":"2023-03-29T16:12:28","slug":"the-cost-of-addction","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-cost-of-addction","title":{"rendered":"The cost of addction"},"content":{"rendered":"\n<p>I think that most or all of us understand the cost of addiction to at least some extent. Either we have an addiction of our own or we know someone who does. Addition can not only affect the addict but can affect others around him.<\/p>\n\n\n\n<p><strong>Sugar and caffeine<\/strong><br>It may be hard to think of sugar and caffeine as addictions, but these two items are among the most sneaky addictions. Sugar is said to stimulate the same part of the brain as at least one illegal drug and it’s overuse is perhaps, at least in part, responsible for many of the health issues in the United States and in some other countries. Caffeine may or may not be a drug, but it’s overuse can also be a problem, and more and more young people are using higher and higher amounts, with the abundance of energy drinks that are now available.<\/p>\n\n\n\n<p><strong>Cigarettes<\/strong><br>Even without the health issues, cigarettes are an expensive addiction, likely costing smokers an average of at least $100 a month. To the non-smoker, smoke doesn’t smell very good. Smokers have to isolate themselves from non-smokers because of the evidence that even second hand smoke can be harmful. Then there are the health issues: breathing problems, cancer and even death. Smokers give up a lot more than they realize to hold onto this addiction.<\/p>\n\n\n\n<p><strong>Alcohol<\/strong><br>Drinking is a major addiction, affecting both the rich and the poor, alike. It not only harms the body but may cause health issues, even if the one who drinks stops drinking. Drinking isn’t cheap, and it can cost in lost days at work, higher insurance rates, time in prison and even in the lives of others, due to accidents. Alcoholism can lead to abuse, divorce and isolation.<\/p>\n\n\n\n<p><strong>Drugs<\/strong><br>Some drugs are legal, now, but many still are not. Drugs not only cost the user but cost employers lost revenue. Drugs can be a self imposed prison that takes away the desire to do anything but get that next high. Dealers may be able to make a pretty penny, but it can end in a prison term that can leave a lasting record and it, too, can lead to death. Too many users fall victim to their addiction, and too many dealers die at the hands of their competitors. The cost of drug addiction may not be fully know, but it is almost certainly higher than we can even comprehend.<\/p>\n\n\n\n<p><strong>Porn and sexual addiction<\/strong><br>The Bible warns us not to awaken love before it is time, but the commercialization of sex has long been an issue that, at least in part, can help bring a nation down. It costs the user in loneliness and isolation, the family in separation and brokenness, and it is one of the main causes of divorce. This addiction also fuels the porn and sex trade and, unfortunately, many of those caught in the sex trade are not there willingly.<\/p>\n\n\n\n<p>There are other addictions that are lesser known. In most cases, moderation is the rule. Unfortunately, addiction often strikes when we are young and unable to understand the consequences of what we are getting ourselves into.<\/p>\n\n\n\n<p>The object isn’t to be perfect. None of us are prefect. The thing that we need to do is to recognize if we have an addiction and, if so, admit it and try to get help. No one else can force us to admit us to ourselves that we have a problem. We have to take responsibility for our own lives, hopefully before the cost becomes too high, not only for ourselves but for those who love us.<\/p>\n\n\n\n<p>There is help out there. Will we ever fully overcome addiction and its effects. Not likely. But there is hope: hope for the individual and for the family. My prayer for you, my prayer for myself, is that we will look to God, the one who makes all things new. God promises a new life to those who believe, who seek after him with all of their heart. A new day, a new life, a new chance: this is a good place to start.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I think that most or all of us understand the cost of addiction to at least some extent. Either we have an addiction of our own or we know someone who does. Addition can not only affect the addict but can affect others around him.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-cost-of-addction\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":644,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[51],"tags":[3],"class_list":["post-643","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-personal-growth","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/643","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=643"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/643\/revisions"}],"predecessor-version":[{"id":645,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/643\/revisions\/645"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/644"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=643"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=643"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=643"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}