{"id":646,"date":"2023-03-30T16:41:58","date_gmt":"2023-03-30T16:41:58","guid":{"rendered":"https:\/\/llgt.cafe\/?p=646"},"modified":"2023-03-30T16:41:58","modified_gmt":"2023-03-30T16:41:58","slug":"identity-crisis","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/identity-crisis","title":{"rendered":"Identity Crisis"},"content":{"rendered":"\n<p>It seems that I’ve made yet another mistake. Now, am I going to let it bother me? Likely. Am I going to shape how I see myself? Less likely. I know how this thing goes. I make a mistake, and depending on how bad it is, I think about it for a short or long while and then I set it asked to go on with my life. I never really forget, but I try to learn from my mistakes and move on.<\/p>\n\n\n\n<p>I have learned, over the years, that who I am does’t change by every little circumstance. Adding a picture to a wall, a new couch, or a drawing to the refrigerator, these little changes don’t make the home. It’s the people who live in the house that make a home.<\/p>\n\n\n\n<p>Now, I don’t watch much television, so I’m not sure of the latest trends. But I do remember a trend by news media to call people, at least in the USA, consumers. No, not people. And not even producers, but consumers. I’m not sure what they would call us, today.<\/p>\n\n\n\n<p>A lack of a personal identity can lead to things like depression and to other issues. Depression can express itself in isolation, anger, and even in violence — towards ourselves or towards others.<\/p>\n\n\n\n<p>One current trend seems to be to question who we are. Schools have already taught for years that we came from primordial ooze, that we have no creator, and that we have no greater purpose than to live for today. In fact, one popular preacher says that we can live our best lives, now. I’m sure I can work on improving this life, but my hope is that my best life is yet to come.<\/p>\n\n\n\n<p>Genesis is clear that God created everything and that we are His creation. Our purpose and meaning come not from the latest trend, or even our last thing that we did but from the God who created us. At least they should. It’s up to us to decide whether we believe God or what we hear: what we feel. Psalm 139:14 says that, “I am fearfully and wonderfully made.” First John 4:19 (KJV) tells that, “We love him, because he first loved us.” Luke 12: 7 tells us that God knows us so well that He knows the number of hairs on our head. God made us, he knows us and, still, He loves us. How many of us could say that, either about ourselves or about others.<\/p>\n\n\n\n<p>Our identity ought not come from what we do, what we own, or who we know. Our identity should come from the knowledge that God created us, not from apes, but in His image. And it should come from the belief that God loves us and has a plan for each one of us.<\/p>\n\n\n\n<p>Now, I’m still going to make mistakes. But I try not to let it see how I see myself. Instead, I have to realize that we all make mistakes and that’s how we learn. I try not to base my value on what others say about me or even what I say about myself. I have a creator who loved me enough to send His son to die for my sins so that I could have the hope of eternal life, which is where I hope to live my best life.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It seems that I’ve made yet another mistake. Now, am I going to let it bother me? Likely. Am I going to shape how I see myself? Less likely. I know how this thing goes. I make a mistake, and depending on how bad it&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/identity-crisis\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":647,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14,29],"tags":[33,8,7,5,3],"class_list":["post-646","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","category-think-about-it","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/646","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=646"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/646\/revisions"}],"predecessor-version":[{"id":648,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/646\/revisions\/648"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/647"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=646"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=646"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=646"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}