{"id":649,"date":"2023-03-31T16:13:12","date_gmt":"2023-03-31T16:13:12","guid":{"rendered":"https:\/\/llgt.cafe\/?p=649"},"modified":"2023-03-31T16:13:12","modified_gmt":"2023-03-31T16:13:12","slug":"photography-then-and-now","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/photography-then-and-now","title":{"rendered":"Photography, Then and Now"},"content":{"rendered":"\n<p>I’m not exactly sure how old I was when I took my first photograph. I know that my dad had a camera and took pictures of the family as well as for work. I also know that some time around 1980, my mom took a photograph class at the university and that’s about the time I became interested in taking pictures.<\/p>\n\n\n\n<p>A lot has changed over the years in the area of photography. For example, it seems that just about everyone has access to a camera these days. They’re on phones and security devices, drones and computers. When I started taking pictures, it wasn’t that way. There were no digital cameras and, if there were, they weren’t available to the general public. There were fewer photographers, especially in photography’s early years and even fewer who stood out for the work they did. Now, it seems that we’re all photographers and, it would seem, that it is even harder to stand out among other photographers.<\/p>\n\n\n\n<p>Photography has always been fairly expensive. Companies like Eastman Kodak made it easier for families to own cameras in 1888 with the introduction of the Kodak. The Brownie was another film camera. Now, there are actually more camera companies, and a lot more cameras and camera types to choose from. And, though there isn’t the price of film and developing to keep in mind, but there is the price of the price of the camera, itself, memory cards, batteries and anything else that you care to add. Oh, and the first digital cameras — the first DSLRs — they had a price tag of about $5,000.<\/p>\n\n\n\n<p>The quality of cameras and the photographs that they take has changed over the years. The first cameras were actually boxes with just a hole for a lens. An artist had to draw or paint the image. Film was later introduced and now we have film and digital. And the quality of both has greatly increased over time. That DSLR that cost $5,000 would have hardly produced a picture any larger than a post card. And it wasn’t until around the year 2000 that digital cameras even came close to producing the quality of images that a film camera could do. Now, we can do things with digital cameras that one could hardly imagine doing with film.<\/p>\n\n\n\n<p>When I started taking pictures, I also learned how to develop black and white film and prints. I had access to a darkroom and supplies and I could spend hours working on just a few images. It was by no means, instant and color film could take a week or more to get back for a photo lab. With film, with the exception of instant cameras, there was no way to check the quality of your pictures until you developed the film or had someone else develop it. Now, we just have to look at the back of our camera or on our smart phone. We can even have a camera set up remotely and check the images on a smart device.<\/p>\n\n\n\n<p>Laws have changed somewhat over the years. It’s still legal to photograph others in public. But it’s harder, in some cases to use these pictures. Rules of courtesy haven’t changed. Rules of composition and what makes a “good” photograph still hasn’t changed. And everyone is a great photographer until he or she begins comparing their work to the work of other, more experienced, photographers.<\/p>\n\n\n\n<p>There are more ways to make money as a photographer, now, but there is also more competition. A single photographer can produce hundreds of thousands of images and sell them online, yet there there is still a need to fill photography gaps. Anyone can photograph a wedding, but only one photographer may have the style that suits a particular customer’s needs. It takes time and effort to get into photography as a career these days. It takes time to develop one’s style and to make significant improvement in image quality. Then it takes time for others to get to know and appreciate your work. And, if you want to make big bucks, you have to find clients with the needs and the resources to pay that money.<\/p>\n\n\n\n<p>I still own a film camera — a Minox —but I don’t really use it. The last pictures I took were black and white and, without access to a dark room, these pictures took at least 2 weeks to get back. Also, when I got the pictures back, they were badly underexposed. I don’t know, but it was a fairly recent purchase and I think there is a problem with the light meter. I have a really nice camera, now. It’s the nicest camera I’ve ever had. But, these days, I get most of my pictures with my phone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’m not exactly sure how old I was when I took my first photograph. I know that my dad had a camera and took pictures of the family as well as for work. I also know that some time around 1980, my mom took a&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/photography-then-and-now\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":650,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28,27,53,40,52],"tags":[3],"class_list":["post-649","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","category-fun-facts","category-hobbies","category-making-money","category-photography","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/649","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=649"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/649\/revisions"}],"predecessor-version":[{"id":651,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/649\/revisions\/651"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/650"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=649"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=649"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=649"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}