{"id":655,"date":"2023-04-01T15:48:59","date_gmt":"2023-04-01T15:48:59","guid":{"rendered":"https:\/\/llgt.cafe\/?p=655"},"modified":"2023-04-23T16:53:18","modified_gmt":"2023-04-23T16:53:18","slug":"col1972","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/col1972","title":{"rendered":"COL1972"},"content":{"rendered":"\n<p>In October 2019, I had the opportunity to publish an article on COL1972, a clothing company in Pennsylvania that, in 2019 was less than a year old. Col stands for Culture Of Life and the year 1972 is the year when abortion became legal in the United States of America. COL1972 uses part of its profits to support mothers who decide against abortion but need financial or other help with their pregnancy.<\/p>\n\n\n\n<p>“The supreme court ruled that our tiniest Americans could be denied the right to life,” said Carla D’Addesi, in our first interview. “Since 1973, 60 million American children have been denied the right to life,” continued D’Addesi. “We hope to return to a culture of life and that year 1972, which symbolizes when all life mattered.”<br>COL1972 still sells women’s clothing, men’s clothing, and jewelry through their online store. The clothing and jewelry are designed by D’Addesi and her three daughters. The original LLGT website was closed but returned in October of 2022. Recently, I contacted D’Addesi to see if she would do another interview and she agreed.<br>“My daughters and I created the name COL1972, “ said D’Addesi. “It is a great conversational piece; people ask all the time what does COL 1972 mean. This gives us the opportunity to share that 1972 was the last year we enjoyed a culture of life in the United States of America.”<br>In 2019, COL1972 D’Addesi was running the business with the help of her three daughters. “My husband (my daughters dad) helps on occasion. We have a fulfillment center that packaged and ships all our items. We have a web designer. But my daughters and I do all the marketing and designing of our brand on a mission.” Now, COL1972, after a few years of slow and steady growth has been able to add two part-time employees.<br>“My three daughters still work for the company although my oldest is now a first year law student and our middle daughter is a second year nursing student, my baby who is now a senior in high school is enjoying Liberty University online Academy, and is really a huge help to Culture Of Life 1972.”<\/p>\n\n\n\n<p>In the,October 2019 interview, D’Addesi said that she and her daughters came up with the name for business. &nbsp;I asked D’Addesi if she had considered changing the name of her business since the overturn of Roe V. Wade. “We considered changing the name of our business after June 24, 2022 decision, however we decided to just incorporate some 2022 styles and jewelry items. Our life tribe is wearing the 1972 and 2022 pieces together it really shares a wonderful story about the culture of life and our country.”<\/p>\n\n\n\n<p>“After much discussion in prayer we decided to keep 1972 and incorporate 2022 as the year 1972 is still a historical moment for the culture of life tribe. Our country had 50 dark years between 1972-2022. May we strive to win a culture of life in all 50 States today.”<\/p>\n\n\n\n<p>D’Addesi says that her customer tends to be “conservative stylish woman who wants USA made products that giveback to life. We have business casual, bump-friendly for our moms and comfy clothes for our homeschoolers.”<br>When asked what she might have done differently, D’Addes said, “I would not have wasted money in a business consultant. I learned that I can learn everything that I need for my online boutique on YouTube. I would not have wasted money advertising in fancy Christian Magazines. Posting for free on all our social media got more sales and growth than paying for fancy ads.”<br>What advice would D’Addesi give to anyone wanting to start a similar business? “Pray about your new business and speak to others that have a successful business that you desire to have. Successful business owners advice is priceless. They are always willing to share with someone who desires to learn. Be patient! 2023 is our 5th year in business. We just finished our 4th year. Be patient! Businesses take time. Don’t believe a person who tells you that you should be hitting these numbers or have this many followers by year one. Slow and steady wins the race!”<\/p>\n\n\n\n<p>D’Addesi compares her customers to family, saying, “We get thank you notes often. They also share their dreams and fears with us. We love them and we hope we have earned their respect and love. Even if you never purchase with us again, we are praying for you and we ask you keep us in your prayers.”<br>“I was asked to speak about COL1972 at Liberty University Convocation in February 2020,” said D’Addesi. “This is the largest gathering of Christians weekly. I was honored to speak to 15,000 students live and was streamed live to 1 million viewers. &nbsp;Liberty invited us to do a fashion show for 500 students the following day. This opened the door for other similar events.”<\/p>\n\n\n\n<p>COL1972 gives majority of our 10% back to life turning point in Philadelphia and Blue Ridge Pregnancy Center in Lynchburg, Va. in previous years we have divided our fun — sometimes to over 50 pregnancy centers and pro-life causes.”<\/p>\n\n\n\n<p>D’Addesi says that she is very involved with her church. “We enjoy a small group each Sunday evening.” D’Addesi also enjoys tennis and skiing as a family. “Our extended family all live in our state so I am very busy with nieces and nephews activities as well. Faith, family and you can also say fashion is everything to me.”<\/p>\n\n\n\n<p>“My daughters had a brilliant idea to purchase a Jeep that they had wrapped pink cheetah with our logo,” said D’Addesi. “We needed something to transport inventory for pop-up shops and fashion shows. It brings a smile to people’s faces even those who don’t know who we are. God thing.”<\/p>\n\n\n\n<p>You can find out more about COL1072 through the following links:<br>col1972.com<br>https:\/\/mobile.twitter.com\/COL1972official\/status\/1631715970057134081<br>Facebook @COL1972<br>Instagram @COL1972official<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In October 2019, I had the opportunity to publish an article on COL1972, a clothing company in Pennsylvania that, in 2019 was less than a year old. Col stands for Culture Of Life and the year 1972 is the year when abortion became legal in&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/col1972\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":656,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17,69],"tags":[3],"class_list":["post-655","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-business","category-community","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/655","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=655"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/655\/revisions"}],"predecessor-version":[{"id":657,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/655\/revisions\/657"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/656"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}