{"id":664,"date":"2023-04-02T16:59:54","date_gmt":"2023-04-02T16:59:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=664"},"modified":"2023-04-02T16:59:54","modified_gmt":"2023-04-02T16:59:54","slug":"health-inequality","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/health-inequality","title":{"rendered":"Health Inequality"},"content":{"rendered":"\n<p>The Declaration of Independence states that “all men are created equal”, but when it comes to healthcare and hearth in general, not all men are treated equally.<\/p>\n\n\n\n<p>Some times, it’s the “luck of the draw”. It’s a matter of where you are born and the family that you are born into. Some people have issues that come from family genes, but what I’m talking about is money. Some families have more money and, therefore, may have greater access to resources. Some people grow up in areas where there are more or fewer options available. Healthcare or dietary options aren’t always divided equally.<\/p>\n\n\n\n<p>People can usually only select from what’s available. In most areas, there is a wide variety of foods to choose from, including a number of fresh fruit and vegetables. But in some areas, the availability of fruits and vegetables are limited and, perhaps, these items aren’t available at all. Instead, stores in these areas may carry only prepared foods. I heard about one community that started their own community garden because stores in their area didn’t have any produce.<\/p>\n\n\n\n<p>I know that, in the south, there is a tradition of fried foods. In California, there is a greater focus on physical health, and there is a wider range of fresh produce to choose from. Some areas of the United States have more wheat, while other areas have more meat or potatoes. The areas that are close to the coast have access to fresh and wild caught fish.<\/p>\n\n\n\n<p>Education also plays a role in health, as knowing more about health can lead to individuals making better choices. On the other hand, larger cities may not offer the environment that allows people to relax as easily. Traffic, smog, a lack of forested areas or a place to jest get away from it all can all be detrimental to ones health. In addition, it may not be cheap to get away from it all, and not everyone can afford such luxuries.<\/p>\n\n\n\n<p>A lack of money can also cause additional stress. And, depending on where you are born, there may be greater or fewer options in career and earning potential. Fortunately, this is one of the easiest barriers to overcome, if you put your mind to it.<\/p>\n\n\n\n<p>You can change things, and you can work with others to make greater changes. You may be at disadvantage when it comes to healthcare and dietary options, but it doesn’t have to stay that way. Talk with others, plan and take action. You can make a difference. But no one is going to do it for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Declaration of Independence states that “all men are created equal”, but when it comes to healthcare and hearth in general, not all men are treated equally. Some times, it’s the “luck of the draw”. It’s a matter of where you are born and the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/health-inequality\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":665,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[16],"tags":[3],"class_list":["post-664","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-health","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/664","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=664"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/664\/revisions"}],"predecessor-version":[{"id":666,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/664\/revisions\/666"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/665"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=664"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=664"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=664"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}