{"id":667,"date":"2023-04-03T16:21:29","date_gmt":"2023-04-03T16:21:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=667"},"modified":"2023-04-03T16:21:29","modified_gmt":"2023-04-03T16:21:29","slug":"its-a-choice","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/its-a-choice","title":{"rendered":"It&#8217;s a Choice"},"content":{"rendered":"\n<p>“How are you?”<\/p>\n\n\n\n<p>“I’m fine.”<\/p>\n\n\n\n<p>It’s an easy question and an easy answer. It fulfills our obligation to care about the other person, and it’s an easy answer that’s just vague enough to get by.<\/p>\n\n\n\n<p>Often, however, there are deeper needs that never get addressed. There are struggles and concerns, feelings of loneliness and other needs that never come out into the open. Why is that?<\/p>\n\n\n\n<p>All of us have unmet needs on one area or another. We can look to others to meet these needs for us. We might even look within to find what we need to meet our needs. Or we can look to the one who created us, the God who loves us, to meet our needs.<\/p>\n\n\n\n<p>The sad truth is that, if we have all of our needs met, we tend to forget God. If we don’t need anything, we won’t seek after him. And when we loose something or someone that matters to us, we get mad at God and blame him, forgetting that everyone and everything belongs to him, anyway.<\/p>\n\n\n\n<p>The best we can do is to learn to be content with what we have. We don’t always need to have more, we don’t always need to win, and we don’t always need the best. Some times we just need to pray, wait, and thank God for whatever happens.<\/p>\n\n\n\n<p>Things aren’t always going to go as we had hoped. And it’s easy to be resentful or to get frustrated. But we can, by faith, decide that we are going to be thankful for whatever comes our way.<\/p>\n\n\n\n<p>Thankfulness is a positive state. It builds us up and makes us stronger. Bitterness, jealousy and resentment are negative emotions that tear us and those around us down. And whether we realize it or not, the choice is ours to make.<\/p>\n\n\n\n<p>Too often, we let our circumstances dictate how we feel. And it’s not a problem as long as things are going well. Yet, when things don’t go our way, it’s easy to get depressed and start feeling sorry for ourselves.<\/p>\n\n\n\n<p>I can’t tell anyone that he needs to change, that she needs to be less grumpy and more thankful. I can try, but I can’t make anyone change. I have a hard enough time trying to change myself.<\/p>\n\n\n\n<p>My advise: listen to yourself. Listen to the words that you use all of the time. What are you saying and what do you think about all of the time? Is it how things aren’t right and how things will never get better, or is it thoughts of thankfulness? It’s a question that only we can answer. And it’s a choice that only we can make. Happiness can come and go, but joy is a choice. How do you want to feel? If I had my way, I would feel great. But, again, it’s my choice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“How are you?” “I’m fine.” It’s an easy question and an easy answer. It fulfills our obligation to care about the other person, and it’s an easy answer that’s just vague enough to get by. Often, however, there are deeper needs that never get addressed.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/its-a-choice\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":668,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,14],"tags":[8,3],"class_list":["post-667","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-spiritual","tag-god","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/667","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=667"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/667\/revisions"}],"predecessor-version":[{"id":669,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/667\/revisions\/669"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/668"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=667"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=667"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=667"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}