{"id":682,"date":"2023-04-04T17:12:38","date_gmt":"2023-04-04T17:12:38","guid":{"rendered":"https:\/\/llgt.cafe\/?p=682"},"modified":"2023-04-04T17:12:38","modified_gmt":"2023-04-04T17:12:38","slug":"learned-habits","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/learned-habits","title":{"rendered":"Learned Habits"},"content":{"rendered":"\n<p>There are a lot of things that we can learn. If there is something that we do on a regular basis, assuming that it’s not something we do for work, it may be a habit. There are bad habits, and they can be hard to break but there are also habits that can be good to have.<\/p>\n\n\n\n<p>Bing organized is one good habit. Being organized means not spending too much time going over and over the same things. It means having a place for everything and putting everything in it’s place. It also means not hanging onto “trash” or the things that are no longer useful, and recognizing what is still needed and what is not. It means making the best use of ones time, energy and resources. Lists may help and organizers may also help but these tools won’t help everyone.<\/p>\n\n\n\n<p>Getting exercise on a regular basis and making healthy choices when it comes to eating are both good habits that we could all work on. It’s not always easy. There may be circumstances where it’s hard to get out and walk or make it to the gym, and it may be difficult to find time to prepare a healthy meal, but unhealthy choices should be the exception rather than the norm.<\/p>\n\n\n\n<p>Just trying to have a positive attitude is one habit that we could all have. Yes, there is a lot of negative in the world but it’s easier to find what we spend our time thinking about. If we spend our time thinking about the things that we don’t have, we are likely to find more lack. If we focus not the things that we do have, and are intentionally thankful for what we do have, that is likely what we will find more of.<\/p>\n\n\n\n<p>It’s good to stay busy. I understand the benefits of having things to do to help pass time. But there are also benefits to just doing nothing. It helps us to unwind, and allows us to be more creative. It allows the body to get the rest it needs and, if we focus on the right things, mentally, we may find that we are able to think more clearly and get more done when we do need to work.<\/p>\n\n\n\n<p>Learning can also be an intentional habit. There are so many things that we can learn that can keep us stronger mentally or help in other ways. Some people learn a new word every day. Others memorize Bible verses or poems. Some people are able to learn a foreign language. Other people are able to make more money by going back to school and learning a new skill or adding to a skill base that they already have. In some career fields, if you don’t keep up with the latest technology, you’re falling behind the crowd.<\/p>\n\n\n\n<p>Finally, people skills are good skills to learn. Just listening, really listening and trying harder to understand than to be understood is one skill that can help throughout ones life. It’s also a skill that, seemingly, is never ever perfected.<\/p>\n\n\n\n<p>Want to learn a new habit? Start small. Leave notes for yourself if it helps, and remember to reward yourself for “small” accomplishments. A pat on the back or a “Yeah me” can actually go a lot further than we realize in helping us start a new habit.<\/p>\n\n\n\n<p>Maybe there’s a habit that you would like to start working on, either improving or adding entirely. There might be several, but it’s probably best to work on just one or two at a time. Perhaps there’s one that I missed that you would like to add to the list. Don’t be shy; we would love to hear from you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are a lot of things that we can learn. If there is something that we do on a regular basis, assuming that it’s not something we do for work, it may be a habit. There are bad habits, and they can be hard to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/learned-habits\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":677,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[53],"tags":[3],"class_list":["post-682","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hobbies","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/682","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=682"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/682\/revisions"}],"predecessor-version":[{"id":683,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/682\/revisions\/683"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/677"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=682"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=682"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=682"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}