{"id":684,"date":"2023-04-05T16:45:01","date_gmt":"2023-04-05T16:45:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=684"},"modified":"2023-04-05T16:45:01","modified_gmt":"2023-04-05T16:45:01","slug":"making-a-positive-difference","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/making-a-positive-difference","title":{"rendered":"Making a Positive Difference"},"content":{"rendered":"\n<p>If you could choose any career where you could make the most difference, what would you choose? It’s not as if there are any jobs that don’t make a difference in the lives of others — from doctors to trash collectors — but there are some that seemingly make a greater difference. Which one might you choose?<\/p>\n\n\n\n<p>Teaching is one career that has the potential to impact a number of people. It can be a positive impact, but teachers can also have a negative impact on some of their students. Not everyone learns the same and not every teacher can reach every student, but the potential to reach students, to impact their lives well into the future is still great.<\/p>\n\n\n\n<p>Someone in the medical field also may have a chance to impact the lives of others, whether shot tor long term. It’s a demanding job that may pay well, but can bring with it a great deal of stress. It’s a hard job to stay with long term but can have its rewards as well as its drawbacks. And it’s easy to get into debt to complete one’s education.<\/p>\n\n\n\n<p>Journalists have the opportunity to tell stories: to let others know what is happening in the world around them. Its the rare story that makes a real impact in the lives of others, and many stories go unread by the masses, but there is still that chance to break that story or share that truth that could make a difference.<\/p>\n\n\n\n<p>Law enforcement have a job that I don’t envy. Their job is to fix things when they go wrong and to find criminals. We know what happens when things go wrong: the wrong person is arrested or the innocent is killed. But there are times when people’s lives are saved, people are protected, and there are times when justice is served.<\/p>\n\n\n\n<p>Inventors have an opportunity to change the future. Usually, those who invent don’t work alone but work for a larger company or alongside others who help them. It takes people with an inventive mind to create better transportation, easier ways to do things and new ways to save lives. There is almost no limit to want inventors can come up with.<\/p>\n\n\n\n<p>Athletes have a unique opportunity. Those who make it to the professional level can not only make better than average salaries, but they can use their notoriety to help others: raising funds to help those in need, visiting children and their families in hospitals, and just encouraging young people to go further.<\/p>\n\n\n\n<p>Politicians can have a major impact on a countries future. We tend to think of today’s politicians as crooks, seeking only after their own interests, but there are good politicians out there, making a positive difference, going against the crowd to help others.<\/p>\n\n\n\n<p>I would love to find a way to help children. I once had the idea to put together a photo book to sell and raise money to help these homeless children, but nothing ever came of it. What would you do? Maybe you are already making a positive impact on the lives of those around you. One of the places that we can make the biggest difference is in the home. It cannot be understated the difference that a mother, a father or a guardian can have on children, and it can’t be underestimated the power that families have on a nation. We can make a positive change or we can make a negative one. Which would you choose?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you could choose any career where you could make the most difference, what would you choose? It’s not as if there are any jobs that don’t make a difference in the lives of others — from doctors to trash collectors — but there are&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/making-a-positive-difference\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":686,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,35],"tags":[3],"class_list":["post-684","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/684","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=684"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/684\/revisions"}],"predecessor-version":[{"id":687,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/684\/revisions\/687"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/686"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=684"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=684"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=684"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}