{"id":689,"date":"2023-04-06T17:40:44","date_gmt":"2023-04-06T17:40:44","guid":{"rendered":"https:\/\/llgt.cafe\/?p=689"},"modified":"2023-04-06T17:40:44","modified_gmt":"2023-04-06T17:40:44","slug":"trust-the-pessimist","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/trust-the-pessimist","title":{"rendered":"Trust the Pessimist"},"content":{"rendered":"\n<p>The other day, I made an attempt to fix something on my own. One of my friends had said that it would be easy and all I needed was a kit. Another friend said that he had it done professionally. So, with kit in hand, I made my attempt — and failed miserably. In fact, my attempt made things worse and brought down my outlook for the rest of the day.<\/p>\n\n\n\n<p>When I was getting ready to go to culinary school, I had friends on both sides of the fence. So, I prayed about it, asking God to show me which direction I should go. So, with what seemed like a green light, I went for it. I have to say that the degree led me down a road that I probably would have not been able to take had I not had taken that path but, at the same time, the student loan was a heavy burden to carry.<\/p>\n\n\n\n<p>It’s hard to know who to listen to at times. You want to believe the positive report, but it can sometimes be better to trust the negative. It can can be a difficult choice to make. And the problem goes back to the Garden of Eden, when Adam and Eve had to ask themselves, “Do I truest God or this talking serpent?”<\/p>\n\n\n\n<p>On more than one occasion, the Hebrews had to choose who to listen to. Some times, the report was good — in spite of how bad things looked. On one occasion, Israel was surrounded. Things looked hopeless, but a single angle destroyed the enemy overnight. On other occasions, however, God tried to warn His people, but they would not listen. And, in the end, they suffered for their disobedience.<\/p>\n\n\n\n<p>For years, God has been warning America, pleading for it’s people to return to Him. And God’s warning largely been ignored or even rejected. God wants us to return to Him and many have turned and run the other way. And, in so many ways, things are getting worse.<\/p>\n\n\n\n<p>Now, God doesn’t have to punish us in order for us to suffer. All he needs to do is to let us have our own way and we will suffer the consequences of our own decisions. You may, for example, decide that you want to take a corner at 90 miles per hour when it is posted at 45. Who will know or care. Does it really matter? But if you wind up in the hospital or worse, it will matter to you.<\/p>\n\n\n\n<p>At some point, however, God does judge. It may be in 20 days or 20 years, but it eventually comes around to the fact that it is God — not us — who is in control.<\/p>\n\n\n\n<p>This week, we celebrate the fact that God sent His Son, not just to be a good example or to show us how we ought to live our lives, but to take our sins to the cross: to take the judgment that we deserve. God is still seeking those who will return to Him, to put their trust in Him. And, even when things look the bleakest, we know that God is trustworthy. We can know that God loves us. Believe it or not, He even likes us. And He has what is best for us in mind. All we have to do is believe what He tells us.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The other day, I made an attempt to fix something on my own. One of my friends had said that it would be easy and all I needed was a kit. Another friend said that he had it done professionally. So, with kit in hand,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/trust-the-pessimist\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":690,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[8,7,3],"class_list":["post-689","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/689","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=689"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/689\/revisions"}],"predecessor-version":[{"id":691,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/689\/revisions\/691"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/690"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=689"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=689"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=689"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}