{"id":69,"date":"2022-10-31T16:40:30","date_gmt":"2022-10-31T16:40:30","guid":{"rendered":"https:\/\/llgt.cafe\/?p=69"},"modified":"2022-10-31T16:40:30","modified_gmt":"2022-10-31T16:40:30","slug":"my-thoughts","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/my-thoughts","title":{"rendered":"My Thoughts"},"content":{"rendered":"\n<p>“Let the words of my mouth, and the meditation of my heart, be acceptable in thy sight, O Lord, my strength, and my redeemer.” — Psalm 19:14 (KJV)<\/p>\n\n\n\n<p>This is one area where I really struggle. It seems that the time I spent in my last job hearing all of the swearing, along with the frustrations of everyday life has taken a toll on my speech. It seems that, as much as I try, I cannot seem to erase certain words from my vocabulary.<\/p>\n\n\n\n<p>The seed of thoughts that we continue to go back to are the ones that grow. While seeds of love and respect, contentment, faith and hope will build up our minds, seeds of fear, doubt, bitterness, lust, or malice will tear us down.<\/p>\n\n\n\n<p>Over time, these negative feelings can produce harmful effects in our bodies. Fear, for example, is known to produce cortisol, which may cause high blood pressure and prolonged exposure can have harmful effects on the mind and body.<\/p>\n\n\n\n<p>Conversely, positive thoughts are likely to be beneficial for both the mind and body. “A merry heart doeth good like a medicine,…” — Proverbs 17:22 (KJV)<\/p>\n\n\n\n<p>One problem is that it can be all too easy to not even be aware of what we are thinking about. I find that, often, my body is in one place while my mind is in another. I may be doing a particular task at work, but I may be thinking about what I I hope to do the following weekend. Or, I may be thinking about lunch.<\/p>\n\n\n\n<p>It seems that there are so many voices clamoring for our attention, from news to television shows, advertising and so much more. While some of these things try to build us up, much of what is produced is aimed at our base emotions of fear, feelings of inferiority and a desire to have more. If someone can produce a need in their lives, they can also sell us the cure.<\/p>\n\n\n\n<p>These days, I’m careful what I listen to. I don’t watch television and I’m careful what music I listen to. I try to pay attention to the words that go into my ears, especially the ones that are coming out of my own mouth.<\/p>\n\n\n\n<p>I’m just stating to understand the importance of starting my day right: not only choosing the right foods to put into my body, but being selective in the thoughts that I put into my mind at the beginning of the day. I can also change how I think about things. James 1: 2-3 (KJV) tells us, “My brethren, count it all joy when ye fall into divers temptations; Knowing this, that the trying of your faith worketh patience.”<\/p>\n\n\n\n<p>I can’t say that I’ve reach the point of counting it “all joy,” but I am working on it. Perhaps, you would like to add your thoughts. I would love to hear from you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Let the words of my mouth, and the meditation of my heart, be acceptable in thy sight, O Lord, my strength, and my redeemer.” — Psalm 19:14 (KJV) This is one area where I really struggle. It seems that the time I spent in my&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/my-thoughts\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":70,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,16,14],"tags":[5],"class_list":["post-69","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotional","category-health","category-spiritual","tag-king-james-bible"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/69","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=69"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/69\/revisions"}],"predecessor-version":[{"id":71,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/69\/revisions\/71"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/70"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=69"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=69"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=69"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}