{"id":695,"date":"2023-04-08T13:56:45","date_gmt":"2023-04-08T13:56:45","guid":{"rendered":"https:\/\/llgt.cafe\/?p=695"},"modified":"2023-04-08T13:56:45","modified_gmt":"2023-04-08T13:56:45","slug":"dear-god","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/dear-god","title":{"rendered":"Dear God"},"content":{"rendered":"\n<p>Dear God,<\/p>\n\n\n\n<p>Thank You for your last letter — the book of Revelation. I have to admit that it was hard to understand, especially when I first read it. But though the years, others have helped me to understand a little more here and there. I think time has helped us all understand a little better.<\/p>\n\n\n\n<p>Thank You for sending Your Son, Jesus. A lot has changed since Jesus left (some time around 2,000 years ago). Now, I know that You have been keeping up on current events. In fact, You knew everything that would happen before it happened. And You know what is still to come. And, though You give your Holy Spirit to believers to comfort us, I have to admit that parts of my life have been hard and some have been harder than others. Now, the things that You said would happen in the “last days” seem to be happening at an alarming rate. This comes as no surprise to You, but I find myself a little, perhaps stressed at times.<\/p>\n\n\n\n<p>I remember what You said about loving one another and building up one another. Yet, it seems that there are so many divisions amongst believers and life in general keeps us too busy to have any time to build each other up. I found a good church — one that teaches Your Word — and there is some fellowship. But I spend a lot of time alone — just me and the Holy Spirit — and He doesn’t really say much.<\/p>\n\n\n\n<p>I have to admit that Your letters were hard to understand until I learned who some of the letters were too, who they were about and how the intended recipients would have understood their meaning. The more I understand about Your Word, the less I feel like I know. What I know is that You sent Your son, Jesus, fully God, to become fully man, to be born of a virgin, to live a perfect and sinless life, so that He could willingly give His life on a cross — the price of my redemption. Jesus was buried and, on the third day, rose again. It is by believing this that I am able to have eternal life. As Romans 10:9 (KJV) says, “That if thou shalt confess with thy mouth the Lord Jesus, and shalt believe in thine heart that God hath raised him from the dead, thou shalt be saved.”<\/p>\n\n\n\n<p>It seems that things in this world are getting worse. I know that You have seen it before. But Jesus has been gone a long time. At least it seems like a long time to me. There are wars and rumors of wars, and the app on my phone tells me of strong quakes in diverse places just about every day. There are the tornadoes and don’t get me stated on politics. Not to mention, food and petrol prices are going up, again. If I have any requests, it is that You would help those in need, of which I know that You are fully aware.<\/p>\n\n\n\n<p>There is much debate and division on the return of Your Son. In fact, though I could be wrong, I don’t think many are even aware that Jesus is even going to come back. And, it seems, that there is little agreement over any of what is written in Your Word. I try to — as Your Word says — love You with all of my heart and my neighbor as myself. Yet, probably more often than not, I fail. I look forward to Jesus’ return but know that, whatever happens, You and Your Holy Spirit will be there with me to get me though it.<\/p>\n\n\n\n<p>One question: who wrote Hebrews? Thank You for Your amazing love and for Your amazing grace, which I will fully understand one day. May I help send Your love and Your Word though out this world.<\/p>\n\n\n\n<p>Your servant,<\/p>\n\n\n\n<p>Ralph<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dear God, Thank You for your last letter — the book of Revelation. I have to admit that it was hard to understand, especially when I first read it. But though the years, others have helped me to understand a little more here and there.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/dear-god\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":696,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,8,7,5,3],"class_list":["post-695","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/695","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=695"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/695\/revisions"}],"predecessor-version":[{"id":697,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/695\/revisions\/697"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/696"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=695"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=695"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=695"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}