{"id":698,"date":"2023-04-09T14:46:11","date_gmt":"2023-04-09T14:46:11","guid":{"rendered":"https:\/\/llgt.cafe\/?p=698"},"modified":"2023-04-09T14:46:11","modified_gmt":"2023-04-09T14:46:11","slug":"growing-imagination","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/growing-imagination","title":{"rendered":"Growing Imagination"},"content":{"rendered":"\n<p>“Imagination is more important than knowledge. Knowledge is limited. Imagination encircles the world.” ―Albert Einstein<\/p>\n\n\n\n<p>Imagination is built on what we know. But it may also be limited by what we know. It’s taking what we know, and asking the what if questions. What if we put these two things together. What if we made this smaller. What if we used this instead of that.<\/p>\n\n\n\n<p>“Imagination is the source of every form of human achievement. And it&#8217;s the one thing that I believe we are systematically jeopardizing in the way we educate our children and ourselves.”<br>― Sir Ken Robinson<\/p>\n\n\n\n<p>The more we know, the more we have to work with. Yet, imagination is not necessarily limited by our knowledge. It is limited only by our desire to try new things. It is not necessarily limited by our resources, but by our ability to believe in what we can and cannot do.<\/p>\n\n\n\n<p>Children have some of the most active imaginations. As children, there seems to be no limit to what we can do, who we can be, or what we can create. But there are certain things that we need in order to exercise our imaginations.<\/p>\n\n\n\n<p>For one, we need to put the right things into our minds, or our imaginations will take us down the wrong path. Reading, exploring, and listening are just a few things that we can do to help build our imaginations.<\/p>\n\n\n\n<p>Having a safe place is another thing that we need in order to activate our imaginations. We can’t be worried about our own safety and use our imaginations at the same time. If we worry about what tomorrow might bring, we may be using our imagination, but probably in the wrong way. We need a place that we can get away from the worry and the business of the world around us so that we can imagine what could be.<\/p>\n\n\n\n<p>A safe place may be out in the woods, your favorite chair at your favorite cafe, your own bed. For those who choose meditation, they find their safe place in their mind. A safe place is some place that we are free to think, free to ask questions and, most importantly, it’s a place that we are free from judgment.<\/p>\n\n\n\n<p>We also need time: time to think, to dream, to ask questions and to wonder “what if.” If we’re too busy, have too many things on our mind, or just too tired to think, we won’t be able to creatively use our imaginations.<\/p>\n\n\n\n<p>If our imagination is to be successful, we will also need the freedom to try, to experiment, to create hypotheses and to test them. We need the freedom to try new things. And we need the freedom to fail, or just to find out what doesn’t work, depending on how you look at it.<\/p>\n\n\n\n<p>If we are to accomplish greater things, we will need to combine our resources and use the imaginations of others. Others can bring their own understanding as well as knowledge that we may lack. And together, we can find answers that we might never find on our own.<\/p>\n\n\n\n<p>Imagination may just be the start, but it’s where everything starts. Every actin, every invention, and every work of art began as a though or a question. How are you using your imagination? What are you dreaming of?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Imagination is more important than knowledge. Knowledge is limited. Imagination encircles the world.” ―Albert Einstein Imagination is built on what we know. But it may also be limited by what we know. It’s taking what we know, and asking the what if questions. What if&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/growing-imagination\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":699,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28,51],"tags":[3],"class_list":["post-698","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","category-personal-growth","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/698","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=698"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/698\/revisions"}],"predecessor-version":[{"id":700,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/698\/revisions\/700"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/699"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=698"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=698"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=698"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}