{"id":703,"date":"2023-04-10T14:35:18","date_gmt":"2023-04-10T14:35:18","guid":{"rendered":"https:\/\/llgt.cafe\/?p=703"},"modified":"2023-04-10T14:35:18","modified_gmt":"2023-04-10T14:35:18","slug":"money-and-values","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/money-and-values","title":{"rendered":"Money and Values"},"content":{"rendered":"\n<p>Money and values<br>Did you know that the Bible mentions money more than 800 times? Money does several things. It is a tool that allows us to do the things that we want to do, taking place of the barter system. But money also shows us what is important to us.<\/p>\n\n\n\n<p>When we get paid, if we work for someone else, we pay a portion of our income to our government in the form of taxes. This amount varies in amounts and in percentages. Many of us get money back at the end of the year, while others winding up having to send in a check, but taxes always have to be paid.<\/p>\n\n\n\n<p>Some people give away a percentage of their income. If you give a tenth of your income, to a church or some other charitable organization, it’s called a tithe. The Bible tells us that everything that we receive, whether we realize it or not, comes from God and that we should give a portion back to him. Some say that it should be 10 percent, but others say that it is “whatever God puts on your heart to give.” I admit that it’s not always easy to give, but it is always a good idea.<\/p>\n\n\n\n<p>Next, one should “pay” him or herself. This means taking money and setting it aside for the future. It can be in the form of an emergency fund, a fun fund, or something to be used to build up investments that, hopefully, outdo inflation.<\/p>\n\n\n\n<p>One of the most important things that a person needs to survive is shelter, so rent or a mortgage would come next. And, so you don’t loose your property at some point in the future, it’s a good idea to include taxes in the equation, if applicable.<\/p>\n\n\n\n<p>Utilities come next, unless you want to be cold in the winter or hot in the summer. There’s also water and, if you like, telephone and internet. Cable would likely fall under entertainment.<\/p>\n\n\n\n<p>It’s also a good idea to spend a portion of your income on food, unless you are the Dragon Warrior (from “Kung Fu Panda”). I know that a person can survive on about $20 US a month on Raman noodles, but that kind of diet isn’t going to lend to long term health, and peanut butter and jelly isn’t much better. How much you want to spend on food is up to you. Consider your overall budget and use your best judgment.<\/p>\n\n\n\n<p>There are going to be other bills: petrol or travel, auto repairs or bus fair. Car insurgence may be one of the bills. You may think that you don’t need money for entertainment, but you likely will. And clothes wear out, so include it.<\/p>\n\n\n\n<p>Debts should be a small part of what our money goes to. Unfortunately, credit card companies, who will give a credit card even to a dog, make it super easy to get into debt at a young age, and make it very hard to get out. In addition, the cost of education has gone through the roof and can make it hard to set any money aside at the time when we most need to start investing.<\/p>\n\n\n\n<p>Finally, there are things. We all want things, but we have to consider what they are worth to us. Not only do “things” take away the money that we could give back to God, but they take away from the money that we can invest in ourselves and in our future. If we put our money in things, unless they are truly investments, we are putting money into things that won’t last, will need repair and that will need to be taken care of. It’s okay to have things, but not at the cost of our freedom.<\/p>\n\n\n\n<p>A budget is a good way to track all of this spending. It can be as complicated as software that helps us track where our money is going, or as simple as a system using envelopes that hold cash for each category of spending. Whoever you spend your money shows what you really value. As Matthew 6:21 (KJV) puts it, “For where your treasure is, there will your heart be also.”<\/p>\n\n\n\n<p>Where are your treasures? Do you put your money in things that will or will not last. It’s okay to have some of each but, remember, that balance is key. And the choices are up to you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Money and valuesDid you know that the Bible mentions money more than 800 times? Money does several things. It is a tool that allows us to do the things that we want to do, taking place of the barter system. But money also shows us&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/money-and-values\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":704,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,62,38,14],"tags":[33,20,3],"class_list":["post-703","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-finances","category-money","category-spiritual","tag-bible","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/703","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=703"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/703\/revisions"}],"predecessor-version":[{"id":705,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/703\/revisions\/705"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/704"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=703"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=703"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=703"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}