{"id":706,"date":"2023-04-11T15:59:12","date_gmt":"2023-04-11T15:59:12","guid":{"rendered":"https:\/\/llgt.cafe\/?p=706"},"modified":"2023-04-11T15:59:12","modified_gmt":"2023-04-11T15:59:12","slug":"toxic-people","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/toxic-people","title":{"rendered":"Toxic People"},"content":{"rendered":"\n<p>I love the mountains. They are so beautiful — the high mountains that you can see from miles away — especially in the winter, when the fresh snow covers their tops. These mountains can be so beautiful, but that doesn’t mean that I want to be up on top of those mountains, up where the snow is.<\/p>\n\n\n\n<p>You see, it’s cold in them thar hills, and there are some hidden dangers on top of some of those mountains: cold temperatures, challenging conditions and wild animals that can come out of nowhere. So it is with some relationships. You may think you know someone, and you may enjoy spending time with that person, but there may be hidden dangers that lie unseen, or just ignored. Such it is with toxic relationships.<\/p>\n\n\n\n<p>Toxic people use others, they manipulate others by their words. Toxic people may be physically abusive, but they may be emotionally abusive. They may lack self control, or they may just know how to take advantage of others. And toxic people can be so subtle that they can be difficult to spot.<\/p>\n\n\n\n<p>I can’t say that it is entirely the fault of the toxic person. Children who grow up without proper boundaries, who grow up without the same, who never learn to say no and are not able to accept this two letter word may find themselves at a disadvantage when it comes to building relationships as adults.<\/p>\n\n\n\n<p>Fortunately, toxic relationships don’t come along very often. At best, these relationships just end. At worst, they can end in the death of one or more people. And, most often, the victim is the one to blame, at least in the eyes of the guilty.<\/p>\n\n\n\n<p>We can’t avoid toxic people, entirely. But, perhaps, we can pay better attention to that inner voice that tells us to stay away from someone. Prayer also helps. King David was always asking for protection from his enemies. Prayer can go a long way to protect us from our blind spots.<\/p>\n\n\n\n<p>It’s said that we are going to like the people who we spend the most time with. I’m not saying that we shouldn’t spend time with people who don’t meet certain standards. Some times we need to build others up and some times we will need others to build us up. But we can’t ignore other’s behavior that could be destructive, either to us or to the other person.<\/p>\n\n\n\n<p>People aren’t always what they appear to be. Sometimes we just need to learn our lessons and move on. Be careful not to let bitterness settle in your own heart, though. If we aren’t carful, we can allow bitterness to make us toxic, too.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I love the mountains. They are so beautiful — the high mountains that you can see from miles away — especially in the winter, when the fresh snow covers their tops. These mountains can be so beautiful, but that doesn’t mean that I want to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/toxic-people\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":707,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[51,47],"tags":[3],"class_list":["post-706","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-personal-growth","category-relational","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/706","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=706"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/706\/revisions"}],"predecessor-version":[{"id":708,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/706\/revisions\/708"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/707"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=706"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=706"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=706"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}