{"id":709,"date":"2023-04-12T15:47:01","date_gmt":"2023-04-12T15:47:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=709"},"modified":"2023-04-12T15:47:01","modified_gmt":"2023-04-12T15:47:01","slug":"puzzle-pieces","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/puzzle-pieces","title":{"rendered":"Puzzle Pieces"},"content":{"rendered":"\n<p>I find myself — we find ourselves — in strange times. To me, it feel like I’m trying to put together a large puzzle, but pieces from more than one puzzle have been put into the same box. I can’t seem to get many of the pieces to come together.<\/p>\n\n\n\n<p>There are going to be times when things don’t make sense in our own minds. We can’t figure out the whys or the whens or the where or what, at least not yet.<\/p>\n\n\n\n<p>Right now, I find myself in a place where I don’t intend to stay any longer than necessary. But I’m not sure where I might be going next. I do have a few ideas, and I’m looking for other options. But I don’t know how it will all turn out.<\/p>\n\n\n\n<p>Romans 8:28 (KJV) says, “And we know that all things work together for good to them that love God, to them who are the called according to his purpose.”<\/p>\n\n\n\n<p>It’s pretty straight forward. The truths of the Bible are straight forward enough for a child to understand, but deep and rich enough for anyone who wants to grow in knowledge or wisdom. Yet, at the same time, it’s easy to question and doubt the truths of the Bible because of a lack of faith.<\/p>\n\n\n\n<p>The Bible tells us that each of us is given a measure of faith. Still, we don’t all use our faith as we should, and faith is often mixed with things like doubt, worry and the concerns of the world. On top of that, there is the particular view that various religions offer which differ from one another.<\/p>\n\n\n\n<p>I don’t have all the answers. There are some things that I believe to be true, but there are things that I still don’t have the answer for. These are the things that I know.<\/p>\n\n\n\n<p>God is good. And, by God’s standards, only God is good. I don’t know about you, but I realize that, if there is any good thing in my life, any good that comes from me, it comes from God’s work in and through my life.<\/p>\n\n\n\n<p>God is truth and light. Aside from God, there is no truth. We may think that we know the truth, and we may get a lot of people to agree with us, but that doesn’t mean that we are right.<\/p>\n\n\n\n<p>God is love. Out of all God’s attributes, this may be the hardest to comprehend. We cannot see God. We cannot truly feel his presence. Our only understanding of God’s love may come from our own family and from the world around us. The things that we see can easily give us a tainted view of God’s love.<\/p>\n\n\n\n<p>Things don’t always go the way that we would want them to. And we certainly don’t always get our way. There are going to be times that prayers will seem to go unanswered, and there are going to be times when it seems that God is silent.<\/p>\n\n\n\n<p>We can trust one thing though: God is always the same. He never changes. Our circumstances may change, but God’s love never changes. His truth never changes and God is always good. The world may throw things at us and try to break us, but God can take even those pieces and make something beautiful out of it.<\/p>\n\n\n\n<p>Proverbs 3:5-6 (KJV) says, “Trust in the Lord with all thine heart; and lean not unto thine own understanding. In all thy ways acknowledge him, and he shall direct thy paths.”<\/p>\n\n\n\n<p>It may be difficult at times, but we can trust God. We can know that God loves us and that his ways are true. And we may not understand everything right now. but it will work out in the end. It will all work out.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I find myself — we find ourselves — in strange times. To me, it feel like I’m trying to put together a large puzzle, but pieces from more than one puzzle have been put into the same box. I can’t seem to get many of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/puzzle-pieces\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":710,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,8,3],"class_list":["post-709","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-god","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/709","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=709"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/709\/revisions"}],"predecessor-version":[{"id":711,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/709\/revisions\/711"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/710"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=709"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=709"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=709"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}