{"id":716,"date":"2023-04-14T17:50:38","date_gmt":"2023-04-14T17:50:38","guid":{"rendered":"https:\/\/llgt.cafe\/?p=716"},"modified":"2023-04-14T17:50:38","modified_gmt":"2023-04-14T17:50:38","slug":"unreal-jobs","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/unreal-jobs","title":{"rendered":"Unreal Jobs"},"content":{"rendered":"\n<p>Below is a list of unreal jobs. Yes, they are completely made up. I got the idea for a couple of them from outside sources, but made the rest of them up myself.<\/p>\n\n\n\n<p><strong>Dropped call sweep<\/strong><br>Will be part of a team responsible for cleaning up all dropped called within the city of Spokane. No one wants to see those unsightly dropped calls and, over time, they can build up. Tools will be provided, though employees will need their own transportation. Pay will be based on the number of dropped calls collected.<\/p>\n\n\n\n<p><strong>Mask aligner<\/strong><br>This is a full time job making sure that people who are wearing masks have them properly aligned. Good communication skills are a must as the alignment must be done verbally and from a safe social distance. Speaking French or Spanish is a plus. Pay will be based on experience and will start out at least $15\/hour.<\/p>\n\n\n\n<p><strong>Labalogist<\/strong><br>Applicants will be required to apply labels to specified objects as needed. Persons referring to labels as stickers will not be considered for employment. Standing long hours will be required and the ability to do repetitive work is a must. Employees are expected to stick to one job at a time and adhere to all company rules. Pays $14 per hour.<\/p>\n\n\n\n<p><strong>Soda bottle cap sniffer<\/strong><br>Wanting to bring soda up to the level of wine, we are bringing the art of soda cap sniffing to our company. We’re looking for someone with a keen sense of smell who can differentiate the smell of a high class soda from a run of the mill drink. Pay starts at $15 per hour with quarterly bonuses and benefits.<\/p>\n\n\n\n<p><strong>Vowel sales<\/strong><br>Selling vowels isn’t just for game shows any more. There are a lot of vowels out there and who is going to answer the call if someone needs to buy a vowel. That’s right, you. This is a limited time opportunity. Work from the convenience of your own home and set your own hours. The earning potential is unlimited. Apply now.<\/p>\n\n\n\n<p><strong>Fact checker checker<\/strong><br>Check the facts of those who fact check. There is a never-ending of false information but even those who fact check stories need to be fact checked. What is the story behind the fact check, what are the hidden facts, and who is paying the initial fact checker. Then, after you’ve checked the fact checker’s facts, check your own facts. In fact, triple check them. Pays $22 an hour.<\/p>\n\n\n\n<p><strong>Whale nose cleaner<\/strong><br>Get back to nature. You may not know it, but whales have noses too. The only problem is that they can’t clean out their own nose. We are hiring whale nose cleaners to begin immediately. Applicants must provide their own SCUBA gear and must be licensed to work in close contact with whales. Salary is $43.885324342352342 to $54.5234523652345 thousand per year.<\/p>\n\n\n\n<p><strong>Gum recyclist<\/strong><br>Start an exciting career in gum recycling. Collect gum from under desks, beds and stadium seats and bring it to gum recycling centers or recycle it yourself. There’s no reason all that used gum should go to waste. Start doing your part today, and make extra money in the process. Join the millions who are already recycling gum. Don’t wait.<\/p>\n\n\n\n<p><strong>Dog loan officer<\/strong><br>I bet you thought that dogs just got credit card offers by accident. No. We need an enthusiastic go getter to pursue dogs and family pets who need credit cards and personal loans. Maybe there’s a dog out there that needs a new dog house, or just needs some vacation time. You can help and the rewards can be more than doggy treats. Apply today and see what you can do to help dogs around the world<\/p>\n\n\n\n<p><strong>Spaghetti farmer<\/strong><br>Spaghetti farming is a wave of the future. We’ll even help you get started with a supply of spaghetti seed. Feeling ambitious, try growing linguine, fettuccini and other delicious pastas. We supply the seed. You plant the seeds and just watch your profits grow. We buy the finished product and distribute it to the stores. Contact us today for more information.<\/p>\n\n\n\n<p><strong>Fish tuner<\/strong><br>We&#8217;ve all heard of tuna fish, but did you know that fish can get out of tune. It’s true. And we’re looking for people who can get these out of tune fish back on key. Underwater work is necessary, and an ear for pitch is necessary. If you think you have what it takes to tune fish, contact us. We are an equal opportunity employer.<\/p>\n\n\n\n<p><strong>Soap Bubble restorer<\/strong><br>Soap bubbles burst all of the time. We’re looking for someone with the patients to be able to reassemble these burst bubble, piece by piece, to their original form. If you think you have what it takes to resemble popped soap bubbles, contact us, today. One year experience is required. Pays $16 per hour.<\/p>\n\n\n\n<p>Apply in person.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Below is a list of unreal jobs. Yes, they are completely made up. I got the idea for a couple of them from outside sources, but made the rest of them up myself. Dropped call sweepWill be part of a team responsible for cleaning up&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/unreal-jobs\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":717,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[50],"tags":[3],"class_list":["post-716","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-humor","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/716","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=716"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/716\/revisions"}],"predecessor-version":[{"id":718,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/716\/revisions\/718"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/717"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}