{"id":719,"date":"2023-04-15T15:51:59","date_gmt":"2023-04-15T15:51:59","guid":{"rendered":"https:\/\/llgt.cafe\/?p=719"},"modified":"2023-04-15T15:51:59","modified_gmt":"2023-04-15T15:51:59","slug":"waiting-patiently","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/waiting-patiently","title":{"rendered":"Waiting Patiently"},"content":{"rendered":"\n<p>I am reminded that, at times, there are limits to my patients. My “last straw” isn&#8217;t the same as yours and the things that bother you aren’t necessarily the the same things that bother me. As hard as I may try to be patient, some people still seem to be able to find the limits of what I can tolerate.<\/p>\n\n\n\n<p>The Bible says that love is patient. Maybe I just don’t love enough and that’s why I grown impatient some times. But even God has limits to his patients. The thing is that God is just and he alone is able to judge rightly. When I grow impatient, it’s mostly for selfish reasons.<\/p>\n\n\n\n<p>Part of being a Christian is instant. By faith, I am made new. I am adopted by God and become one of his children. Salvation comes instantly. Change, however — becoming more like Christ — takes time. And, instead of a straight path, it’s often a case of one step forward, two steps back.<\/p>\n\n\n\n<p>I wait patiently but, more often, impatiently, for the Lord’s return. Jesus promised that he would come back for his bride, the church. It’s been a long time and we know that Christ could come back at any time but here were are, still waiting: still watching.<\/p>\n\n\n\n<p>“For we know that the whole creation groaneth and travaileth in pain together until now. And not only they, but ourselves also, which have the firstfruits of the Spirit, even we ourselves groan within ourselves, waiting for the adoption, to wit, the redemption of our body.” — Romans 8:22-23 (KJV)<\/p>\n\n\n\n<p>Each year, at Christmas, my family drove from Fayetteville, Arkansas to New Orleans, Louisiana. It was a longer drive than it is, now: about 12 hours. There were seven of us packed in a Rambler station-wagon. I’m sure that, at least on one occasion, I uttered the words “Are we there yet.” The thing is that, whatever it is that we are looking for,” it does eventually come (usually).<\/p>\n\n\n\n<p>Jesus promised that he would return, and he will. That doesn’t mean that life is going to be peaches and cream till then. There are going to be hard times. And, until that time, we just have to trust that God’s word is true.<\/p>\n\n\n\n<p>“In a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed.” — 1 Corinthians 15:52 (KJV)<\/p>\n\n\n\n<p>Jesus will come one day. We will be changed, never to be the same. And the reward for our patients: the rest of eternity with God. Till then, we wait.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I am reminded that, at times, there are limits to my patients. My “last straw” isn&#8217;t the same as yours and the things that bother you aren’t necessarily the the same things that bother me. As hard as I may try to be patient, some&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/waiting-patiently\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":720,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,7,3],"class_list":["post-719","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/719","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=719"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/719\/revisions"}],"predecessor-version":[{"id":721,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/719\/revisions\/721"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/720"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=719"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=719"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=719"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}