{"id":728,"date":"2023-04-18T16:16:23","date_gmt":"2023-04-18T16:16:23","guid":{"rendered":"https:\/\/llgt.cafe\/?p=728"},"modified":"2023-04-18T16:16:23","modified_gmt":"2023-04-18T16:16:23","slug":"a-little-more","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/a-little-more","title":{"rendered":"A Little More"},"content":{"rendered":"\n<p>As human beings, it’s easy to want a little more: a little more sleep, a few more things, a little more money and a little more of whatever you want to add to the list. We all want more of something. But, as Christians, we are meant to be different.<\/p>\n\n\n\n<p>“Because it is written, Be ye holy; for I am holy.” — 1 Peter 1:16 (KJV)<\/p>\n\n\n\n<p>A simple definition of holy is to be set apart: to be different. If the world is goes one way, we are supposed to go another way. The world wants entertainment that is more graphic, more realistic and more violence. The world wants clothes that are more revealing and less responsibility for our choices. But the Bible tells us that each of us is responsible for his actions and to stay away from the things of this world.<\/p>\n\n\n\n<p>A little more sleep sounds good, but Proverbs 6:10-11 tells us, “Yet a little sleep, a little slumber, a little folding of the hands to sleep: So shall thy poverty come as one that travelleth, and thy want as an armed man.”<\/p>\n\n\n\n<p>The world tells us to get everything that we can, now. Matthew 6:19-20 says, “Lay not up for yourselves treasures upon earth, where moth and rust doth corrupt, and where thieves break through and steal: But lay up for yourselves treasures in heaven, where neither moth nor rust doth corrupt, and where thieves do not break through nor steal.”<\/p>\n\n\n\n<p>As Christians, our desire should be to be closer to God and more like his Son. We should be more loving (patient, kind and long suffering). As believers in Jesus, we need to remember that each day brings us closer to our eternal home. Our hope isn’t in this world but in the world to come.<\/p>\n\n\n\n<p>The world tells us that we cannot be happy without more, but God tells us to be content with what we have: to be thankful for all that God has given us. We’re not to waste what we have or deny the things that we are given. Yet, above all else, we are to love God.<\/p>\n\n\n\n<p>Instead of looking for more of the things that take us away from God, Christians need to seek after things that will bring us closer to God. We should spend more time in prayer, reading the Bible and time with other Christians.<\/p>\n\n\n\n<p>“Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things.” — Philippians 4:8 (KJV)<\/p>\n\n\n\n<p>Jesus compares his follows to salt and light. As salt, we are to make a positive difference everywhere we go. As light, we are to make a real difference in a dark world. But how can we make a positive difference if we are just like the world.<\/p>\n\n\n\n<p>Remember, God loves you. If you have put your faith in the Lord Jesus Christ, God will begin to work in your life. Things won’t always be easy. In fact, we are promised to have difficult times. “Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ.” — Philippians 1:6 (KJV)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As human beings, it’s easy to want a little more: a little more sleep, a few more things, a little more money and a little more of whatever you want to add to the list. We all want more of something. But, as Christians, we&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/a-little-more\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":729,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,25,14],"tags":[33,8,7,5,3],"class_list":["post-728","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotional","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/728","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=728"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/728\/revisions"}],"predecessor-version":[{"id":730,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/728\/revisions\/730"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/729"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=728"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=728"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=728"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}