{"id":73,"date":"2022-11-01T16:38:29","date_gmt":"2022-11-01T16:38:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=73"},"modified":"2022-11-01T16:38:29","modified_gmt":"2022-11-01T16:38:29","slug":"starting-a-business","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/starting-a-business","title":{"rendered":"Starting a Business"},"content":{"rendered":"\n<p>So, you want to start a business. Great. There can many benefits to running a business, from making extra money to doing something that you enjoy — along with offering a product or service that can help others.<\/p>\n\n\n\n<p>I’m not going into all of the details of starting a business, but you will find a list of at least some of the questions that you may need to answer before starting a business. And, if you’re like me, many of these answers will change over time.<\/p>\n\n\n\n<p>Are you offering a product or service (or both)?<\/p>\n\n\n\n<p>Who are your intended customers?<\/p>\n\n\n\n<p>How will you reach your customers?<\/p>\n\n\n\n<p>How will you reach new customers?<\/p>\n\n\n\n<p>Who is your competition?<\/p>\n\n\n\n<p>How are you unique compared to others who are offering the same product or service?<\/p>\n\n\n\n<p>Do you need to go to pay for schooling to learn your trade?<\/p>\n\n\n\n<p>Are there ways, other than school that can help your learn your trade?<\/p>\n\n\n\n<p>How much time and money are you willing to spend reaching new customers?<\/p>\n\n\n\n<p>Will you be keeping your “day job”, or are is this going to be your only source of income?<\/p>\n\n\n\n<p>If this is going to be your only income, are there ways that you can bring in money quickly?<\/p>\n\n\n\n<p>What resources do you have: time, money, friends who can help, skills that others need and such?<\/p>\n\n\n\n<p>Do you need a license for your business?<\/p>\n\n\n\n<p>Do you need insurance for your business?<\/p>\n\n\n\n<p>Do you need a business account to keep your business earnings separate from your other money?<\/p>\n\n\n\n<p>What will you name your business?<\/p>\n\n\n\n<p>Why?<\/p>\n\n\n\n<p>Do you need an assumed business name, or “doing business as” papers, which are filed with local your local government?<\/p>\n\n\n\n<p>Do you need an earned income number (EIN) from the Internal Revenue Service (IRS)?<\/p>\n\n\n\n<p>Do you need a sales tax number for collecting sales tax?<\/p>\n\n\n\n<p>Will you need to borrow money to get started<\/p>\n\n\n\n<p>Do you have a business plan?<\/p>\n\n\n\n<p>Do you need a business plan?<\/p>\n\n\n\n<p>Will you be sole proprietor, a partnership, a limited liability company (LLC) or some other form of business?<\/p>\n\n\n\n<p>Do you know people who are already interested in your product and\/or service?<\/p>\n\n\n\n<p>Will your your intended customers be able to afford what you are selling?<\/p>\n\n\n\n<p>What are your own financial needs?<\/p>\n\n\n\n<p>Do I need to pay for someone to help with taxes for legal advice?<\/p>\n\n\n\n<p>How are you spending most of your time?<\/p>\n\n\n\n<p>Who are you spending most of your time with?<\/p>\n\n\n\n<p>What changes might you need to make in your life?<\/p>\n\n\n\n<p>There are probably other questions that you can ask yourself, but this is a good place to start, as these may be things that you haven’t yet thought about. There are so many books on starting a business: books listing 101 ideas for a home based business to how to write a business plan, morning meditations for the entrepreneur and so on.<\/p>\n\n\n\n<p>Be aware that it is probably going to take more time, money and\/or energy than you realize to get started. My advise: know yourself. You have to know that you have a product or service that is worth buying and that there are customers who want and are willing to spend their money on what you have to offer. It’s up to you to find those customers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So, you want to start a business. Great. There can many benefits to running a business, from making extra money to doing something that you enjoy — along with offering a product or service that can help others. I’m not going into all of the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/starting-a-business\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":74,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[17],"tags":[18,3],"class_list":["post-73","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-business","tag-business","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/73","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=73"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/73\/revisions"}],"predecessor-version":[{"id":75,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/73\/revisions\/75"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/74"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=73"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=73"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=73"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}