{"id":731,"date":"2023-04-19T16:04:26","date_gmt":"2023-04-19T16:04:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=731"},"modified":"2023-04-19T16:04:26","modified_gmt":"2023-04-19T16:04:26","slug":"best-friends","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/best-friends","title":{"rendered":"Best Friends"},"content":{"rendered":"\n<p>There are friends that I’ve known for close to 30 years. But there is someone I’ve known for longer than that, and he has known me for a lot longer than that.<\/p>\n\n\n\n<p>It was nearly 42 years ago that I became a Christian: the day that I learned what Jesus had done by dying on a cross and rising again so that I might know and have a relationship with the living God.<\/p>\n\n\n\n<p>God knows everything about me, and it’s not because I tell him everything. King David said that God knew him when he was knit in his mothers womb, but the Bible tells us that God knew us even before then. What is perhaps more amazing than the fact that God knows us is how much God loves us. But more than loving us, God is love.<\/p>\n\n\n\n<p>God may know everything about me but, in reality, I still know very little about God. I know way more than I did all those years ago, but there are things that remain a mystery. And they will remain a mystery, at least in this lifetime.<\/p>\n\n\n\n<p>Wherever I go, there God is. It’s kind of nice that, if I go to a movie, I still only have to pay for one person. And God isn’t one of those friends who is always asking for things. No, that would be me. I’m usually the one who wants things. I’m like the little kid who’s always asking questions.<\/p>\n\n\n\n<p>God is, perhaps, misunderstood more than anyone else. I heard a story about an atheist&#8217;s son who asked his father if he thought that God knew that they didn’t believe in him. There are countless of religions and, by comparison, only a few who share my beliefs. Even within Christianity, there are different thoughts about who God is and how to get to Heaven.<\/p>\n\n\n\n<p>I wasn’t really looking for God. He is the one who came after me. And God promises that no one can take me out of his hands. There are those who say that I could get away on my own, but I don’t believe that. Besides, I really don’t want to.<\/p>\n\n\n\n<p>Yes, it’s all by faith. I cannot see God. I can see what he has made though. I cannot see the wind, but I can see what it does, and I can feel it against my skin. I would rather put my faith in an unseen God than to think that, somehow, I can earn my way into Heaven.<\/p>\n\n\n\n<p>Yes, God really is my best friend. I may not be the best friend in return. There have certainly been times when I questioned God’s love. But he still loves me. One day, Heaven will be a reality. As the words to the song go, “Jesus love me, this I know, for the Bible tells me so.” And one day, I will see God. One day, I will know as I am known. How do I know? The Bible tells me so.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are friends that I’ve known for close to 30 years. But there is someone I’ve known for longer than that, and he has known me for a lot longer than that. It was nearly 42 years ago that I became a Christian: the day&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/best-friends\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":732,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,47,14],"tags":[8,7,3],"class_list":["post-731","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-relational","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/731","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=731"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/731\/revisions"}],"predecessor-version":[{"id":733,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/731\/revisions\/733"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/732"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}