{"id":734,"date":"2023-04-20T17:58:06","date_gmt":"2023-04-20T17:58:06","guid":{"rendered":"https:\/\/llgt.cafe\/?p=734"},"modified":"2023-04-20T17:58:06","modified_gmt":"2023-04-20T17:58:06","slug":"being-creative","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/being-creative","title":{"rendered":"Being Creative"},"content":{"rendered":"\n<p>Creativity is something that we are born with. And as soon as we are able, with few exceptions, we all start creating things. it may be finger paints or the drawing on the hallway wall. It’s very unlikely that, at the age of six, we are creating masterpieces but, given the resources, being creative is something that comes natural.<\/p>\n\n\n\n<p>The problem is that, with age, many of us loose the desire to be creative. In jr. high, I really enjoyed drawing. And when I had a decent teacher, I did fairly well. But there were things that made me decide not to pursue art in high school. At the same time, I picked up on photography and never let it go.<\/p>\n\n\n\n<p>As far as drawing, it is something that I would really have to work at. And, right now, I don’t really have the desire.<\/p>\n\n\n\n<p>Creativity may be something that comes, but skill is something that we have to work on. Some people pick up on a form of art more easily but whatever we choose to do, we have to work on it, practicing to get better and better.<\/p>\n\n\n\n<p>Focusing on the tools of the craft — cameras for photographers, brushes for painters and microphones for singers — may be exciting, but the most important tool is the mind. It’s the ability to think of new ways of doing things and the desire to learn new techniques that helps us to stand out.<\/p>\n\n\n\n<p>For many, the art that we create matter only to us. Some are able to become professionals in their craft. Few have had their work stand the test of time. Yet, it’s important that we are able to find a way to express ourselves in one way or another.<\/p>\n\n\n\n<p>If you find yourself unable to get out, now may be a perfect time to sharpen your skills. Even with restrictions, I’m still able to get out and take pictures. And, if I really worked at it, I could find things to photograph indoors.<\/p>\n\n\n\n<p>Right now, I’m working more on my writing. I’m not sure whether I’m getting better or not, but it’s something that I enjoy doing. If someone else enjoys reading what I have to write, that’s just an added bonus.<\/p>\n\n\n\n<p>What is it that you enjoy doing? Is there something that you used to do that you would like to get back to doing? Maybe there is something that you can teach to others. Or maybe you can just hone your skills.<\/p>\n\n\n\n<p>Your work may just matter to you, but it still matters. You may not have the skills of a master, but don’t compare yourself with others. Your job is to get better than you wire yesterday, or a hundred yesterdays ago. And, whatever your skill level, don’t give up.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Creativity is something that we are born with. And as soon as we are able, with few exceptions, we all start creating things. it may be finger paints or the drawing on the hallway wall. It’s very unlikely that, at the age of six, we&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/being-creative\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":735,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[3],"class_list":["post-734","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/734","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=734"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/734\/revisions"}],"predecessor-version":[{"id":736,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/734\/revisions\/736"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/735"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=734"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=734"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=734"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}