{"id":737,"date":"2023-04-21T16:29:30","date_gmt":"2023-04-21T16:29:30","guid":{"rendered":"https:\/\/llgt.cafe\/?p=737"},"modified":"2023-04-21T16:29:30","modified_gmt":"2023-04-21T16:29:30","slug":"magic-formula","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/magic-formula","title":{"rendered":"Magic Formula"},"content":{"rendered":"\n<p>I once heard the formula for making money: buy (low), sell (at a profit) and repeat. It’s pretty easy, if you can find a product or a number of products that sell well. And there are a number things to choose from.<\/p>\n\n\n\n<p>Services<br>A service is something that you do over and over. You have a trade that someone else needs — plumbing, electrical work, auto repair, doctoring, or accounting — and you provide high quality service that people are willing to pay for.<\/p>\n\n\n\n<p>Product<br>This may be something that you make yourself or something that you buy from a manufacturer. In case of a grocery or other store, you may deal with one or more vendors. More and more, stores are moving out of traditional brick and mortar stores and moving online, having either items in a warehouse, such as Amazon, or made to order and shipped to customers.<\/p>\n\n\n\n<p>Investing<br>There are different items that individuals usually invest in. One is making a financial investment, usually through the purchase of stocks or bonds. Investors like Warren Buffett have a unique way of investing. Initially, Mr. Buffett purchased stocks, When he had enough money, he purchased the company Berkshire Hathaway, and consolidated all of his money into this company. Over time, Mr. Buffett has added more and more companies into his company and, at times, has been the richest man in the United States.<\/p>\n\n\n\n<p>Another type of investment is real estate. Someone buys a type of some type of property, such as a house, apartment complex or a mall and uses to this property to make money. Some people fix up a piece of property and sell it for a profit. Others collect properties and use rent money, not only for paying back any loans, but also for making a profit.<\/p>\n\n\n\n<p>It’s said that fortune favors the wealthy. The good news is that anyone with the desire to do so can put in the effort and amass wealth of some type. Countless individuals have moved to the United States with nearly nothing and have been able to build wealth for themselves and their family. Others have gone from being homeless to having millions in investments. But these stores are few and far between.<\/p>\n\n\n\n<p>Yes, there are dangers in investing or selling, but there is also a danger in doing nothing. Over time, money looses it’s value and, if we don’t have a plan to grow our money, the money that we have today won’t buy as much as much tomorrow.<\/p>\n\n\n\n<p>Unfortunately, many of us think that we need to have everything now and that credit is required to buy what we need. This has allowed manufactures to raise the prices on goods and creators to make millions of dollars off of those whom they lend their money to. This may be good for the banker, but it can put individuals into a vicious cycle that can be difficult to get out of.<\/p>\n\n\n\n<p>My advise, and I’ve learned this from making numerous mistakes of my own, is to start small and grow over time. Yes, there are the people like Sam Walton who took our millions of dollars of loans to start Walmart. It helped that he was the loan officer who loaned himself that much money. But for every story of a Sam Walton, there are numerous others who crashed and burned.<\/p>\n\n\n\n<p>An oak tree starts as a small seed. In the first few years, it hardly seems like anything at all but, given time, it becomes a mighty oak tree. The thing isn’t to start big but to just get started. And the earlier that one gets started, the better. But be careful, it’s just as easy to get started with debt, and once someone gets into debt, it’s hard to get out.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I once heard the formula for making money: buy (low), sell (at a profit) and repeat. It’s pretty easy, if you can find a product or a number of products that sell well. And there are a number things to choose from. ServicesA service is&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/magic-formula\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":738,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62,40,38],"tags":[20,3],"class_list":["post-737","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-finances","category-making-money","category-money","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/737","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=737"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/737\/revisions"}],"predecessor-version":[{"id":739,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/737\/revisions\/739"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/738"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=737"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=737"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=737"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}