{"id":741,"date":"2023-04-22T16:01:54","date_gmt":"2023-04-22T16:01:54","guid":{"rendered":"https:\/\/llgt.cafe\/?p=741"},"modified":"2023-04-22T16:01:54","modified_gmt":"2023-04-22T16:01:54","slug":"no-one","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/no-one","title":{"rendered":"No One?"},"content":{"rendered":"\n<p>I saw an ad online that said “No one can change the world”. It it true? I get their point. What they are trying to say is that no one person can do it alone. Yet, each of us, in our own way can change the world in one way or another. We may not be able to change the whole world, but we can change a small part of it.<\/p>\n\n\n\n<p>Manoj Bhargava has used his billions of dollars that came from the 5-Hour Energy drink to help change the world. He has developed equipment and methods, along with scientists that can help people in rural and poverty stricken areas of the world, places where things like power and fertilizer are hard to come by or can be expensive.<\/p>\n\n\n\n<p>Mother Theresa is well known for all of the things that she did, mainly giving dignity to the dying in India in God’s name. She helped individuals, along with the others who worked with her, that no one else would help.<\/p>\n\n\n\n<p>Steve Jobs used technology to help so many with disabilities to make lives easier for so many, especially those with disabilities. The Apple watch, which the company that he founded, has even been credited with saving lives.<\/p>\n\n\n\n<p>The guy who made individual cups of coffee possible through those little containers change the world. I heard that he regrets his invention do to all the plastic that is now being thrown away, but some times one invention leads to another.<\/p>\n\n\n\n<p>Numerous people have tried to change the world in one way another: through charities, civil and governmental organizations as well as in churches. Some people write books while others teach others how they can change their own lives. But whether we know thousands of people or just a few, whether we age able to do a lot or just a little, each of us, in our own way, can change the world.<\/p>\n\n\n\n<p>Jesus changed the world. No, he didn’t work alone either. But he did something that no one else could have done. He came down from Heaven and lived a perfect life. Jesus fulfilled all of the promises of a coming Messiah, dying on the cross and rising again. Those who believe on him are promised eternal life. Jesus can no only change the world in this lifetime, but he can change our eternity.<\/p>\n\n\n\n<p>Some times this life can seem to go on forever. In God’s eyes, our lives are just a vapor, a puff of smoke when compared to eternity. The lives that we live now may seem like they will continue to go on, that the good will stay or that the problems that we have won’t go away. But this life that we live does eventually come to an end. After that, what? Jesus promises eternal life to those who put their faith in him. Can anyone else say that?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I saw an ad online that said “No one can change the world”. It it true? I get their point. What they are trying to say is that no one person can do it alone. Yet, each of us, in our own way can change&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/no-one\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":742,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[69,25,35,14],"tags":[8,7,3],"class_list":["post-741","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-community","category-faith","category-question","category-spiritual","tag-god","tag-jesus","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/741","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=741"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/741\/revisions"}],"predecessor-version":[{"id":743,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/741\/revisions\/743"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/742"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=741"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=741"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=741"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}