{"id":744,"date":"2023-04-23T16:38:05","date_gmt":"2023-04-23T16:38:05","guid":{"rendered":"https:\/\/llgt.cafe\/?p=744"},"modified":"2023-04-23T16:38:05","modified_gmt":"2023-04-23T16:38:05","slug":"fact-or-fiction","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/fact-or-fiction","title":{"rendered":"Fact or Fiction"},"content":{"rendered":"\n<p>It can be difficult to know what foods and supplements are okay and which are not as good for you. Most of the things that someone can find in a health food store haven’t been clinically tested because of the cost and, all too often, the things that have been tested come back later, showing to cause cancer in lab rats.<\/p>\n\n\n\n<p>I go into the health food store from time to time and see all of the health supplements on the shelves but have no idea what many of them do. Most of them aren’t cheap, either, so there’s no chance of trying these things for the fun of it, especially when any improvement may not be immediately evident.<\/p>\n\n\n\n<p>Even if you can find something that works immediately, it’s hard to get others to try it. People are reluctant to try new things, especially when they don’t know much about it and haven’t done the research on their own.<\/p>\n\n\n\n<p>Diets are much the same. A diet may work well, but someone may have heard something bad about that diet, so they don’t w want to try it. And like supplements, diets aren’t clinically tested because there is no one to pay the hundreds of thousands of dollars needed to conduct the trials.<\/p>\n\n\n\n<p>Another problem is that the things that are “good for you” are often more expensive. I tried the keto diet for about nine months and I lost about 35 pounds. Yet, it was costing me around $300 per month in food and supplements. And when circumstances changed, I wasn’t able to follow the diet any more.<\/p>\n\n\n\n<p>It used to be that snake oil salesmen went from town to town trying to make money off of unsuspecting individuals. These salesmen would make claims about a product that they were selling that were just plain fraud. These days, a company can’t label his product as healthy due to regulations, but another can label label its product as all natural because part of the product is natural.<\/p>\n\n\n\n<p>My advise: do your own research. You can try to educate others, but don’t be surprised if they aren’t interested. In the end, it’s best to not spend too much time worrying about it because worry and stress isn’t good for the body, either. Find someone you trust or check out different sources, then you decide what’s best.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It can be difficult to know what foods and supplements are okay and which are not as good for you. Most of the things that someone can find in a health food store haven’t been clinically tested because of the cost and, all too often,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/fact-or-fiction\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":745,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,16],"tags":[22,3],"class_list":["post-744","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-health","tag-health","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/744","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=744"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/744\/revisions"}],"predecessor-version":[{"id":746,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/744\/revisions\/746"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/745"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=744"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=744"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=744"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}