{"id":753,"date":"2023-04-24T15:32:10","date_gmt":"2023-04-24T15:32:10","guid":{"rendered":"https:\/\/llgt.cafe\/?p=753"},"modified":"2023-04-24T15:32:10","modified_gmt":"2023-04-24T15:32:10","slug":"controlling-our-emotions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/controlling-our-emotions","title":{"rendered":"Controlling Our Emotions"},"content":{"rendered":"\n<p>Dr. James Dobson wrote a book asking whether or not we could trust our emotions. In summation, his conclusion was “no”. And yet, it can be easy to base what we do on our emotions.<\/p>\n\n\n\n<p>Emotions can be hard to understand, and it can take a lifetime to learn how to deal with them. From birth, we cry to let others know that something is wrong. Yet, when we are born, we are made to cry as a reminder that we are to breath.<\/p>\n\n\n\n<p>We think of some emotions as positive and some as negate, but is it the emotion that is either good or bad, or is it how we react to test emotions. All of us experience different emotions at times: joy, love, fear and anger. What many of us don’t realize is that we have the ability to choose how we deal with these emotions.<\/p>\n\n\n\n<p>There are different ways that we can deal with our emotions. One way is to express how we feel. If we feel happy, we smile or laugh. And there’s nothing wrong with that. But if someone angers us, we may strike out at that person which is something that doesn’t often help.<\/p>\n\n\n\n<p>We can suppress our feelings. Rather than deal with pain, it might be easier just to avoid emotions all together. If there’s one emotion that overwhelms us, maybe we can learn to just hide all of them and not deal with any of them.<\/p>\n\n\n\n<p>Or, we can learn to deal with our emotions. Our emotions still have something to tell us, that things are going well, that something needs to be fixed or that there is a need for healing.<\/p>\n\n\n\n<p>It may take someone else to help us understand our emotions. The anger that we feel now may be based at least in part on something that happened earlier. One thing can build upon another and, before we know it, our emotions are out of control<\/p>\n\n\n\n<p>Each of us needs to learn to control our emotions, but burying them isn’t the answer. It’s likely not properly dealing with our emotions is what leads to most addictions. The answer begins when we start asking questions like:<\/p>\n\n\n\n<p>What’s really bothering me?<br>Is there something that hasn’t been dealt with?<br>What would I need to do to improve my mood?<br>What am I thankful for?<br>What really matters?<br>Is what I believe about something really true?<\/p>\n\n\n\n<p>It helps to know what we are loved. Whether we realize it or not, someone love us. Whether we know it or not, God loves us. Just remember that, even in these hard times, you are not — I am not — alone.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dr. James Dobson wrote a book asking whether or not we could trust our emotions. In summation, his conclusion was “no”. And yet, it can be easy to base what we do on our emotions. Emotions can be hard to understand, and it can take&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/controlling-our-emotions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":754,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26],"tags":[3],"class_list":["post-753","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/753","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=753"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/753\/revisions"}],"predecessor-version":[{"id":755,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/753\/revisions\/755"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/754"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=753"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=753"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=753"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}