{"id":756,"date":"2023-04-25T17:10:21","date_gmt":"2023-04-25T17:10:21","guid":{"rendered":"https:\/\/llgt.cafe\/?p=756"},"modified":"2023-04-25T17:10:21","modified_gmt":"2023-04-25T17:10:21","slug":"serving-others","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/serving-others","title":{"rendered":"Serving Others"},"content":{"rendered":"\n<p>What’s it like being a chef? I can’t say that I really know. I tried being a sous chef for a while, but it didn’t work out very well. The closest I’ve come was when during the five years that I ran a small soup kitchen in northern Idaho, one day a week except for major holidays. During that time, I planned the menu, purchased the groceries or used what was donated to make a meal, along with the two or more others who volunteered their time. Mostly, it was pretty laid back and the main objective, besides bringing glory to God, was to create a good meal for those who stopped by.<\/p>\n\n\n\n<p>Normally, a chef’s main job is to direct his staff and create meals that customers are eager to come back for again and again, and to make money. The more money a restaurant can make, the better chance it has to stay around. There is a fine balance between spending on the ingredients and the amount of money that is taken in. And a small percentage in the profit, either way, can mean the difference between success and a restaurant closing it’s doors for good.<\/p>\n\n\n\n<p>In my work in the soup kitchen, the budget was very limited. I had the money that was donated, any food that was donated, and a small amount of money from the church where the meals were served.<\/p>\n\n\n\n<p>Most restaurants don’t allow for much creativity. There might be one item on a menu that changes from day to day if there is something that needs to be used, or if there is a special purchase. Most restaurants have the same menu day after day. New items are rarely added to most menus and they are usually dropped if the profit margin is too low to keep that item, even if it is a popular item.<\/p>\n\n\n\n<p>A friend observed that just after Christmas, a lot of fast food restraints come out with their own version of a chicken sandwich. There is a certain amount of competition in the restaurant business, though many of the fast food restaurants are owned by the same company.<\/p>\n\n\n\n<p>Hiring and keeping a staff is one of the major issues in the services industry. When I was in cooking school, I had heard that the turnover rate was as high as 300%. During my time in the soup kitchen, I had the same two people helping me in the kitchen the whole time. We did have others who helped. One of the men who helped had a niece who would help and there were others.<\/p>\n\n\n\n<p>I can’t say that I envy those at the top in the restaurant business. Drinking is just one of the problems that is common as the stress can be very high. One mistake by one of the staff can cost the restaurant in the millions. And, now, more restaurants are struggling than ever, as are other businesses, especially the small ones.<\/p>\n\n\n\n<p>At the same time, soup kitchens and food pantries are in greater demand in many places. Even schools are starting to send food to homes where children are not attending classes while the need for meals still exists.<\/p>\n\n\n\n<p>Chef is just a fancy word for chief: the one in charge. In a lot of jobs you will find that there are too many chiefs and not enough Indians. That’s because we forget that being in charge means serving others, and not about getting our own way. That’s what I miss about being in the soup kitchen: serving others.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What’s it like being a chef? I can’t say that I really know. I tried being a sous chef for a while, but it didn’t work out very well. The closest I’ve come was when during the five years that I ran a small soup&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/serving-others\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":757,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44],"tags":[3],"class_list":["post-756","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/756","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=756"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/756\/revisions"}],"predecessor-version":[{"id":758,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/756\/revisions\/758"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/757"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=756"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=756"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=756"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}