{"id":759,"date":"2023-04-26T16:28:43","date_gmt":"2023-04-26T16:28:43","guid":{"rendered":"https:\/\/llgt.cafe\/?p=759"},"modified":"2023-04-26T16:28:43","modified_gmt":"2023-04-26T16:28:43","slug":"gods-design","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/gods-design","title":{"rendered":"God&#8217;s Design"},"content":{"rendered":"\n<p>What is the most important system in our body? Is it the nervous system. Maybe it’s the respiratory system or the system of veins and arteries that carries blood through our bodies. The truth is that every part of our body serves some sort of function. And, though, we can live without certain parts of our body, no part of the body can be discounted as unimportant.<\/p>\n\n\n\n<p>Our nervous system not only allows us to do all of the things that we do consciously but also runs the parts of the body that happen without out thinking about them.<\/p>\n\n\n\n<p>Our digestive system takes nutrients and helps feed each and every cell of our body, and it is the blood that is carried though veins that brings this food to the cells.<\/p>\n\n\n\n<p>It is the respiratory system that brings oxygen to our cells, without which we cannot survive. But even the smallest part of our body serve a purpose.<\/p>\n\n\n\n<p>The human body is pretty forgiving, allowing us to make unwise choices for some time. Yet, over time, these choices take a toll on our body. Smoking limits our ability to breath properly, poor diet choices can lead to having extra weight, diabetes, and other issues. A lack of exercise can also negatively affect our health and, as we get older, it can be difficult to overcome the effects of the choices that we have made in the past.<\/p>\n\n\n\n<p>Think of it as financial investing. The earlier we get started making the right choices, the better off we will be in the long run. That isn’t to say that things don’t happen that are out of our control. Cancer can come along and take anyone down. Sickness and disease don’t care who you are. But the better we take care of ourselves, the better the choices that we make, the better a chance of living healthy lives as we grow older.<\/p>\n\n\n\n<p>Here is another: “Honour thy father and thy mother: that thy days may be long upon the land which the Lord thy God giveth thee.” — Exodus 20:12 (KJV) How we treat others, especially our parents, has an impact on our health. Our thought lead to actions, our actions lead to routines and our routines help determine our quality of life.<\/p>\n\n\n\n<p>And don’t forget sleep. Our bodies also need rest. On the seventh day, God rested from the work that he had done, and our bodies and minds need rest too. Speaking of which, I think there’s still enough time for a nap.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is the most important system in our body? Is it the nervous system. Maybe it’s the respiratory system or the system of veins and arteries that carries blood through our bodies. The truth is that every part of our body serves some sort of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/gods-design\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":760,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,16,14],"tags":[8,5,3],"class_list":["post-759","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-health","category-spiritual","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/759","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=759"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/759\/revisions"}],"predecessor-version":[{"id":761,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/759\/revisions\/761"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/760"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=759"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=759"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=759"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}