{"id":762,"date":"2023-04-27T17:22:57","date_gmt":"2023-04-27T17:22:57","guid":{"rendered":"https:\/\/llgt.cafe\/?p=762"},"modified":"2023-04-27T17:22:57","modified_gmt":"2023-04-27T17:22:57","slug":"does-potential-expire","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/does-potential-expire","title":{"rendered":"Does Potential Expire?"},"content":{"rendered":"\n<p>I used to tell management at the store that I thought they should look at the dates on the wine bottles because, “I think they’ve expired.” Is it possible to die with ones song still inside? Is it possible for our potential to expire? It’s been said that the richest place is the graveyard because it is full of so much unused potential.<\/p>\n\n\n\n<p>We get just one chance at this life. It may seem to stretch out for some time and there are times when the clock seems like it is broken. Yet, we only get one shot at this life and there is no going back.<\/p>\n\n\n\n<p>There may be a book inside of me but, after at least a few attempts, it seems as though it’s never going to come out. Instead, for now, I write my blog and enjoy taking pictures while I go on long walks. These may not be things that I have to do, but they are things that I want to do.<\/p>\n\n\n\n<p>Each of us express ourselves in unique ways. It may be through some form of art, in song, in writing, or in some other way. And for every expression, there is someone who is meant to hear or see it. Just because I don’t enjoy certain music does’t mean that someone else doesn’t. As beauty is in the eye of the beholder, so our unique expression of who we are is beautiful to someone else.<\/p>\n\n\n\n<p>Each of us is given the same twenty-four hours in a day and, yet, some people seem to be able to do so much more within that time. Some people make way more money that others, while other people are able to create such astounding works of art.<\/p>\n\n\n\n<p>The thing that we often forget is that whatever we are able to do or not able to do does not establish our value; God does. God created everything and, because we are made in the image of God, we are also creative.<\/p>\n\n\n\n<p>What is sad is not that we might die with our creativity still in us but that many people use their creativity for the wrong thing. Too many use their creativity and their intelligence to come up with new ways to steel from others.<\/p>\n\n\n\n<p>Probably the greatest treasure isn’t found in cemeteries but in Heaven. Not only does Heaven have at least one street made of gold, but God paid a great price to get those who are in Heaven there by sending his Son to die on a cross.<\/p>\n\n\n\n<p>I’ve heard that we’ll still get to use our gifts in Heaven, that we will use the gif that God gave us on earth in Heaven. There are a lot of things that I like to do. I wonder which of my gifts I might be able to use in Heaven.<\/p>\n\n\n\n<p>My friends have a little girl who has never been able to do anything in her whole life other than lay there. I wonder what she might be able to do in Heaven after she gets her new body. In the eyes of the world, she hasn’t contributed anything. But she is still very much loved and she is still special. It’s not always what the world sees that matters. It is what God sees that counts.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I used to tell management at the store that I thought they should look at the dates on the wine bottles because, “I think they’ve expired.” Is it possible to die with ones song still inside? Is it possible for our potential to expire? It’s&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/does-potential-expire\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":763,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28,25,35,14],"tags":[8,3],"class_list":["post-762","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","category-faith","category-question","category-spiritual","tag-god","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/762","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=762"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/762\/revisions"}],"predecessor-version":[{"id":764,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/762\/revisions\/764"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/763"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=762"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=762"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=762"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}