{"id":765,"date":"2023-04-28T17:02:42","date_gmt":"2023-04-28T17:02:42","guid":{"rendered":"https:\/\/llgt.cafe\/?p=765"},"modified":"2023-04-28T17:02:42","modified_gmt":"2023-04-28T17:02:42","slug":"partly-cloudy-emotions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/partly-cloudy-emotions","title":{"rendered":"Partly Cloudy Emotions"},"content":{"rendered":"\n<p>I think I know how the Hebrews felt: you know, the ones who had lived in Egypt and God brought them out and led them into the wilderness. God had promised to bring the Hebrews into the promise land, but they didn’t believe him and, more than once, began to complain about Moses and about what God was doing.<\/p>\n\n\n\n<p>There are several things that can cloud our judgment. Fear is a bid one. Most often, the things that we fear aren’t real, but our bodies and our minds can react to things that are not real in the same way as things that are.<\/p>\n\n\n\n<p>Fear can freeze us in inaction or it can cause us to run away. It can be something that we fear will happen or something that we fear won’t happen. It can even be something that has happened and we fear what might happen next.<\/p>\n\n\n\n<p>Anger can cause us to do irrational things. Unfortunately, most of the time, anger is caused by a miscommunication or a misunderstanding. Anger is responsible for fights and, in the worst cases, murder.<\/p>\n\n\n\n<p>One of the best ways to counter anger is with humility. We have to realize that we don’t know everything and try to get to the root of the anger, whether it is our own anger or someone else’s.<\/p>\n\n\n\n<p>Sadness and loneliness can also affect our thinking. These feelings can lead to depression. The worst part is that the depressed person tends to be a loner and doesn’t often seek help.<\/p>\n\n\n\n<p>Love can also cloud our vision. What I mean is the kind of love that makes us feel funny or all warm inside. This kind of love can cause us to do things that we wouldn’t otherwise do. And, believe me, I’ve been there more often than I care to admit.<\/p>\n\n\n\n<p>Perhaps the best thing we can do when we have these emotions is to begin to ask ourselves questions. Are the things that we are feeling reasonable? Is it possible that our thinking is wrong? What are these emotions doing to me? If possible, find someone else to help explore these questions: someone whom you trust to help find the right answers.<\/p>\n\n\n\n<p>Emotions in themselves aren’t bad. Even the Bible tells us that it is okay to be angry, but it warns us not to sin and not to let the sun go down on our anger. The thing is to learn to control our emotions, instead of letting them control us. When we can do that, the happier — or at least content — we are likely to be.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I think I know how the Hebrews felt: you know, the ones who had lived in Egypt and God brought them out and led them into the wilderness. God had promised to bring the Hebrews into the promise land, but they didn’t believe him and,&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/partly-cloudy-emotions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":766,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,26],"tags":[3],"class_list":["post-765","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotional","category-emotions","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/765","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=765"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/765\/revisions"}],"predecessor-version":[{"id":767,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/765\/revisions\/767"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/766"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=765"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=765"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=765"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}