{"id":768,"date":"2023-04-29T16:03:16","date_gmt":"2023-04-29T16:03:16","guid":{"rendered":"https:\/\/llgt.cafe\/?p=768"},"modified":"2023-04-29T16:03:16","modified_gmt":"2023-04-29T16:03:16","slug":"who-or-what","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/who-or-what","title":{"rendered":"Who or What?"},"content":{"rendered":"\n<p>“It’s not what you know, but who you know.” I’m sure that these words have been uttered more than once, but is it true?<\/p>\n\n\n\n<p>Honestly, of all the jobs that I’ve worked, I can only think of one job that I had where this might have applied. It was a part time job and the person who hired me and I had worked together before. But was it really because of who I know or who knew me and what she knew about me.<\/p>\n\n\n\n<p>Yes, there are going to be times when a person is going to get a job just because of the person that he knows, but that probably doesn’t happen very often. That friend of mine who gave me a job probably wouldn’t have given me the job if she thought that I was always going to be late, called in a lot or didn’t work very hard.<\/p>\n\n\n\n<p>How did I get most of my jobs? I took a chance. I put in my application and\/or resume and interviewed like anyone else. At the same time, those who hired me took the same chance hiring me. Wherever I work, I always try to do my best and, if my best is good enough, then the employer keeps me. If not, or if I’m not happy with the job, I move on and try something else.<\/p>\n\n\n\n<p>It is through hard work and determination that most people succeed. But success isn’t measured solely by the amount of money that someone is bringing in. Success is also measured by our contribution to the world around us and the enjoyment that we get out of doing the work that we are doing. It is easy enough to find people who hate their jobs who won’t do something else because they need the money. To me, this is just being lazy because these people aren’t willing to look for work that they might actually enjoy. Either that, or these people would be miserable no matter what they did.<\/p>\n\n\n\n<p>Whether we work for someone else or have our own business, it’s not who we know but what others know about us. Do others see us as trustworthy, hard working, caring and dependable? Then they will want to do business with us. Do others see us as lazy, uncaring or undependable? Then they are much less likely to want to associate with us.<\/p>\n\n\n\n<p>If someone tells you that you need to work on something, don’t react negatively to it. Take advise as being helpful, because that’s what it usually is. Yes, there will be people who will offer negative criticism, but try not to take it personally. Negative criticism almost always says more about the person doing the criticizing than the one being criticized.<\/p>\n\n\n\n<p>Remember, always do your best, whatever you do. Colossians 3:23 (KJV) says, “ And whatsoever ye do, do it heartily, as to the Lord, and not unto men.” If you always do your best, you are going to feel better about yourself. If you do your best, you are more likely to succeed. That’s what matters most.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“It’s not what you know, but who you know.” I’m sure that these words have been uttered more than once, but is it true? Honestly, of all the jobs that I’ve worked, I can only think of one job that I had where this might&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/who-or-what\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":769,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44],"tags":[3],"class_list":["post-768","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/768","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=768"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/768\/revisions"}],"predecessor-version":[{"id":770,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/768\/revisions\/770"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/769"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=768"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=768"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=768"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}