{"id":771,"date":"2023-04-30T11:39:13","date_gmt":"2023-04-30T11:39:13","guid":{"rendered":"https:\/\/llgt.cafe\/?p=771"},"modified":"2023-04-30T11:39:13","modified_gmt":"2023-04-30T11:39:13","slug":"something-a-little-bird-told-me","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/something-a-little-bird-told-me","title":{"rendered":"Something a Little Bird Told Me"},"content":{"rendered":"\n<p>I saw a calendar that had on the cover “I’m very busy.” It seems to be something that a lot of people brag about. But does staying busy mean that we are getting more done or that the work that we are doing is of greater value?<\/p>\n\n\n\n<p>In life, it’s easy to get distracted. It’s usually the shiny, the impressive or the urgent that catch our attention and take us away from the things that matter. It’s the fact that we are busy that makes us think that what we are doing is of significance. And it may be. Only we can answer that question.<\/p>\n\n\n\n<p>I was out taking pictures with an old digital camera that I have and one of the pictures that I got has two important lessons for each and ever one of us when it comes to our career or to our creative life, and probably our life in general.<\/p>\n\n\n\n<p>The first lesson is to stay focused. It’s kind of a play on words, because the picture is out of focus. The idea is that we, at some point in our lives, need to decide what is most important and try to rid our lives of the things that aren’t as important. This can be material possessions, but it can also be activities that keep us from doing what really matters.<\/p>\n\n\n\n<p>Some time ago, I stopped watching television. That isn’t to say that I don’t watch things online. Yet, I try to reduce the amount of mindless things that I watch and watch more of the things that will help build my knowledge base. If I put on the mindless stuff, it’s usually just to have some noise in the background when I’m doing something else.<\/p>\n\n\n\n<p>The other thing that this picture illustrates is that we shouldn’t bite off more than we can chew. Okay, so this bird more than likely can eat the large seed in its beak, after it removes the outer shell. Still, it may be tempting to take on more than we can do.<\/p>\n\n\n\n<p>Taking on more than we should not only keeps us from doing what is important, but it can add unneeded stress to our lives. Over time, this stress can be hard on our minds and bodies.<\/p>\n\n\n\n<p>As a whole, at least in the United States, we have become consumers. We spend all of our time, buying things and consuming or taking in things of very little value. Being creative, doing work that matters, whether it’s creating a great work of art or raising a family, takes time. It takes commitment and focus to get the absolute best that we can get out of what we are doing.<\/p>\n\n\n\n<p>It’s not possible to know what our future selves might tell ourselves. I heard one lady on the radio say that she would tell her past self to have more fun, to enjoy the time that she spent with her little children more, because the things that mattered then aren’t the things that matter now.<\/p>\n\n\n\n<p>Take the advise of a little bird. As much as possible, stay focused on the things that matter most. It may cost some of the things that we think are important, now. Second, don’t bite off more than you can chew. You may have to work on that as time goes. Don’t be afraid to put things off, to discontinue them or even ask for help from others. Your future self may thank you for it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I saw a calendar that had on the cover “I’m very busy.” It seems to be something that a lot of people brag about. But does staying busy mean that we are getting more done or that the work that we are doing is of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/something-a-little-bird-told-me\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":772,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,28,70],"tags":[3],"class_list":["post-771","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-creativity","category-lifestyle","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/771","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=771"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/771\/revisions"}],"predecessor-version":[{"id":773,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/771\/revisions\/773"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/772"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=771"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=771"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=771"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}