{"id":775,"date":"2023-05-01T16:15:42","date_gmt":"2023-05-01T16:15:42","guid":{"rendered":"https:\/\/llgt.cafe\/?p=775"},"modified":"2023-05-01T16:15:42","modified_gmt":"2023-05-01T16:15:42","slug":"what-is-going-on","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-is-going-on","title":{"rendered":"What is going on?"},"content":{"rendered":"\n<p>What’s going on in this world? It seems like a simple question. But in all honesty, I don’t really know. I only know about my very small part of this very large world. And what is going on with the rest of the world — it really depends on who you ask.<\/p>\n\n\n\n<p>If you watch television, well, again, it depends on what you watch and on your perspective on what you see. If you watch the news, it will tend to shift your view of things in one direction or another. It may have you thinking that, well, I’m glad I’m no so-and-so. Or, it may have you believe that, if that person does (fill in the blank), it must be okay for me, too. Or you may believe the lies and half truths that many of the advertisements present.<\/p>\n\n\n\n<p>On the other hand, you may see a television show and not have the perspective of those who usually watch such shows. For example, someone in another country could watch an American sitcom in another country and think that that is what Americans are like. Or I could watch a British sitcom and think that was what the British are like. But it would be inaccurate for me to think that.<\/p>\n\n\n\n<p>You could stick to social media and think that the pictures and video present a complete and accurate picture of the world. They don’t. Or, worse, you could believe that porn sights and the images that they present offer show the reality of what relationships should look like. They certainly don’t. Unfortunately, it seems that many of us don’t even learn what relationships ought to look like in our own homes, and schools certainly don’t teach us.<\/p>\n\n\n\n<p>Depending on what church you find yourself in, if you dare go, you may find a loving or a judging God. You may find someone who knows how to teach God’s Word, or you may find someone who just knows how to draw a crowd. You may find a church that God is using to build His kingdom, or you may find people who are busy building their own kingdom here on earth. I think I’m pretty fortunate to be in a church right now that is focused on Jesus and on His kingdom. It’s growing — not because of popular teaching like how to live your best life now — but because people need Jesus. We need to find hope, not only for this life, but the promise of eternal life that only Jesus can bring.<\/p>\n\n\n\n<p>What’s going on in this world? Honestly, all I can say is that those who are running from God will keep running from God until, or unless, in running from Him, they eventually run into Him. Those who seek God — and not gods, with a little “g” — will likely keep growing closer to God.<\/p>\n\n\n\n<p>Are things going to get better or worse? Are things going to stay the same? I don’t know the answer to that. It depends who you — or I — listen to.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What’s going on in this world? It seems like a simple question. But in all honesty, I don’t really know. I only know about my very small part of this very large world. And what is going on with the rest of the world —&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-is-going-on\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":776,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,13,35,14],"tags":[3],"class_list":["post-775","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-open-for-discussion","category-question","category-spiritual","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/775","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=775"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/775\/revisions"}],"predecessor-version":[{"id":777,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/775\/revisions\/777"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/776"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=775"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=775"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=775"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}