{"id":778,"date":"2023-05-02T16:52:38","date_gmt":"2023-05-02T16:52:38","guid":{"rendered":"https:\/\/llgt.cafe\/?p=778"},"modified":"2023-05-02T16:52:38","modified_gmt":"2023-05-02T16:52:38","slug":"character-building","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/character-building","title":{"rendered":"Character Building"},"content":{"rendered":"\n<p>It wasn’t until I reached my early twenties that I was introduced to the idea of character. I knew some of the qualities that I liked in others, but I hadn’t spent much time wondering about the qualities that I was building in my own life.<\/p>\n\n\n\n<p>I had gone into he military and, it was during a time of intense training that I first truly learned anything about character. I could say that this was a really hard time for me. Yet, hard times can do one or two things.<\/p>\n\n\n\n<p>First, they can show us what is already inside us. As the saying goes, squeeze a lemon and you get lemon juice. It’s these times when life quizzes us that we find out what and who we are on the inside. Do we quit, do we give up or try to get away, or do we press on no matter what? And how do we find ourselves treating others?<\/p>\n\n\n\n<p>Secondly, hard times can help us build our character. The Bible tells us in the first chapter of James that we ought to be glad when we face difficulty in our lives because we know that the outcome can be that we become more patient. Yet, in order to do that, we have to take our eyes off of ourselves and the misery that we are facing and place our hope in God’s Word.<\/p>\n\n\n\n<p>Unfortunately, the only thing that this world can teach us is how to look good on the outside. If we live in the right house in the right neighborhood, have the right friends, make the grades and get the right job, drive the right car and so on, we must be good. Right?<\/p>\n\n\n\n<p>Except, my life and the lives of some others that I know, we don’t quite measure up. Fortunately, it’s people like me that God can take, that He can begin to mold and that He can begin to use. You see, it’s not the strongest or the smartest, the best looking or the most talented that God uses. He might. But it’s often those who are available. God will take us wherever we are — and, with the help of the Holy Spirt, He will begin to shape our character. As for me, I still need a lot of work.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It wasn’t until I reached my early twenties that I was introduced to the idea of character. I knew some of the qualities that I liked in others, but I hadn’t spent much time wondering about the qualities that I was building in my own&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/character-building\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":779,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,51,14],"tags":[3],"class_list":["post-778","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-personal-growth","category-spiritual","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/778","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=778"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/778\/revisions"}],"predecessor-version":[{"id":780,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/778\/revisions\/780"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/779"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=778"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=778"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=778"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}