{"id":781,"date":"2023-05-03T16:57:47","date_gmt":"2023-05-03T16:57:47","guid":{"rendered":"https:\/\/llgt.cafe\/?p=781"},"modified":"2023-05-03T16:57:47","modified_gmt":"2023-05-03T16:57:47","slug":"menu-planning","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/menu-planning","title":{"rendered":"Menu Planning"},"content":{"rendered":"\n<p>It’s that time of week and, once again, I find my self preparing food for the rest of my week. For now, this means that I’m preparing one item that will serve as “dinner” for the rest of the week. No, I’m not just eating one meal a day, though I have done something similar to that in the past. I am eating smaller meals. And, other than my one main meal, I have snacks and meals like breakfast that are quick and easy.<\/p>\n\n\n\n<p>Now, there are a few ways to prepare ahead. If you want, you can buy your foods already prepared. This is, for various reasons, something that I try to avoid. I may get some good ideas looking through my grocer’s frozen food section but that’s where it usually ends. Yet, that’s okay because I enjoy taking my time to shop for the things I need, and I enjoy cooking. Not everyone does.<\/p>\n\n\n\n<p>Right now, I’m making one of those one pot dishes. Some of the ingredients stated out in a frying pan, but all of of the ingredients will eventually wind up in one pot.<\/p>\n\n\n\n<p>As stated, there is more than one way to prepare ahead. The first is to have all of your ingredients ready. You can make up a menu and purchase your food based on that menu, or you can just have enough of everything that you can make whatever you want. I tend to do a little of both. I will buy some ingredients so that I can make specific meals. Yet, I also keep things like flour, eggs, baking powder and other ingredients on hand so I can make other things.<\/p>\n\n\n\n<p>It’s just me so I don’t have to worry about the dietary needs or wants of others. Yet, I do have time and financial restraints. Simply put, I cannot afford steak and lobster every night. Also, I find that the physically demanding work that I do does not allow me to eat a heavy meal, especially since there’s no time for a nap after I eat.<\/p>\n\n\n\n<p>What I do some times is I make one meal, a stew, a casserole or something of that nature, and I bring it to work with me — just enough for one light meal. If I rather, I can buy something like sliced meats and cheeses, along with bread, and make sandwiches.<\/p>\n\n\n\n<p>Another option is to prepare items separately — things like rice, pasta, a broth or even dry mixes — can be made up ahead of time. With minimal effort, I can turn these things into a meal. Last week, for example, I cooked some ground pork, adding to it a salsa and some cooked pasta that I had cooked separately. Before laving for work, I took enough for one meal and put it into my container, along with some cheese sauce. This week, I’m doing something similar, but I’m adding lentils and kale to the mix and will later add rice — or not. I have a rice pudding (with stevia) that I might like to make.<\/p>\n\n\n\n<p>Menu planning can, in the long run, not only save time can help save money. It just might help in avoiding some of the less healthy dietary options. And what we put into our bodies is a large part of how our bodies hold up, especially as we grow older.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s that time of week and, once again, I find my self preparing food for the rest of my week. For now, this means that I’m preparing one item that will serve as “dinner” for the rest of the week. No, I’m not just eating&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/menu-planning\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":782,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,70],"tags":[3],"class_list":["post-781","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-lifestyle","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/781","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=781"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/781\/revisions"}],"predecessor-version":[{"id":783,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/781\/revisions\/783"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/782"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=781"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=781"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=781"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}