{"id":784,"date":"2023-05-04T16:40:58","date_gmt":"2023-05-04T16:40:58","guid":{"rendered":"https:\/\/llgt.cafe\/?p=784"},"modified":"2023-05-04T16:40:58","modified_gmt":"2023-05-04T16:40:58","slug":"learning-something-new","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/learning-something-new","title":{"rendered":"Learning Something New"},"content":{"rendered":"\n<p>Is there something keeping you from learning? Perhaps you think you’re not smart enough. Or maybe you think that you’re too old to try something new. Maybe you just don’t know what you might be interested in or what you might like to learn next.<\/p>\n\n\n\n<p>Note that I didn’t mention that you may not know what you might be good at. There are very few things that any of us are good at the very first time we try and, for the majority of us, it takes a lot of practice before anyone outside of our own immediate family will tell us we’re good at something.<\/p>\n\n\n\n<p>I have, for example, worked on my writing for years — mostly in private journals and such. Likewise, I spent years refining my cooking skills. And as far as my photography, it has taken me most of my lifetime to get close to as good as I thought I was when I first picked up a camera. There will always be the critic that will let us know that we aren’t as good at somethings as we think we are. Yet, there are few who will let us know that we can and will get better at whatever we work at.<\/p>\n\n\n\n<p>Not smart enough? Says who? Albert Einstein was not the top student in his early years. Walt Disney failed at least twice before opening Disney. And Steve Jobs was fired from his job at Apple. You may have to adapt your method of learning in order to study a subject, but that doesn&#8217;t mean that you can’t learn.<\/p>\n\n\n\n<p>I’ll never make it on to a professional football\/baseball\/hockey team, but that doesn’t mean that I cannot throw a ball. The problem isn’t that we’re not good enough. More likely than not, as we get older, we began to compare our work to the work of others, and if our work doesn’t measure up to the work of others, we may get discouraged and give up. Yet, we often fail to take into consideration the time and effort that someone else may have put into doing something, like bounding a ball and putting it though a hoop.<\/p>\n\n\n\n<p>Too old? There are far too many stories — told and untold — of those who began something new or finished something that they started long before, even in their latter years. Likely, however, there are just as many stories of those who gave up while they were still in their youth. Yet, I believe that we are never too old to learn something new.<\/p>\n\n\n\n<p>Maybe you just don’t know where to start. You can look at what you are already doing and go from there. You may also do some research to find out what is being taught in your area or find someone who is willing to teach you what he or she already knows. And, just as we are not as good as we could be at something when we first start, we may not know how enjoyable something might be until we have done it for a while. I, for example, hated typing class. I wasn’t any good at it, and my teacher and I couldn’t seem to see eye to eye. Now, I do much more typing than I do writing by hand. And I kind of enjoy it. It’s the same with the work I now do. I hated some of the lines that I worked on — until I began to get better at it.<\/p>\n\n\n\n<p>Can we do everything? Certainly not. But I believe that most of us can do far more than we ever imagined. At least that’s what experience has taught me.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is there something keeping you from learning? Perhaps you think you’re not smart enough. Or maybe you think that you’re too old to try something new. Maybe you just don’t know what you might be interested in or what you might like to learn next.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/learning-something-new\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":785,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,19,53,70,51],"tags":[3],"class_list":["post-784","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-education","category-hobbies","category-lifestyle","category-personal-growth","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/784","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=784"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/784\/revisions"}],"predecessor-version":[{"id":786,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/784\/revisions\/786"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/785"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=784"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=784"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=784"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}