{"id":79,"date":"2022-11-03T17:11:57","date_gmt":"2022-11-03T17:11:57","guid":{"rendered":"https:\/\/llgt.cafe\/?p=79"},"modified":"2022-11-03T17:11:57","modified_gmt":"2022-11-03T17:11:57","slug":"things-they-dont-teach-in-school","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/things-they-dont-teach-in-school","title":{"rendered":"Things They Don&#8217;t  Teach in School"},"content":{"rendered":"\n<p>There are things that I wish that they would teach us in school, or at least maybe do a better job at teaching. I’m not sure it would have done any good, but the lack of education in these areas could very well have negative side affects which could be difficult to overcome.<\/p>\n\n\n\n<p><strong>Finances<\/strong><br>I wish that schools spent a little more time teaching people how to deal with money. They certainly teach us how to figure the circumference of a triangle (that’s a joke) and how to keep score at the Friday night football game, but don’t rally teach students how to properly handle money.<\/p>\n\n\n\n<p>My grandfather was good at handling money, and so is my father. Me, I didn’t get any of that passed down. And I didn’t learn anything in the public schools about handling money, how to get it, how to grow it or how to hang on to it. The worst part is that I’ve since had people show me how to handle money and, for me, it’s one of those areas where it’s much easier said than done.<\/p>\n\n\n\n<p><strong>Health<\/strong><br>Now, I did spend some time on the swim team when I was in high school, and I was average at best. I expect that it helped over the long run, but I haven’t swam like that in years. In fact, the last time I swam in a competition was nearly 30 years ago. I remember being as high as a kite on endorphins. It’s kind of funny, now that I think about it.<\/p>\n\n\n\n<p>Most of us don’t get enough information on physical fitness, or on the benefits of a healthy diet. We are fed, however, a constant diet of commercials about fast food and kept on a treadmill that limits that amount of time that we have to enjoy a proper meal. And real exercise is almost out of the question unless we force ourselves to make that choice.<\/p>\n\n\n\n<p><strong>Communication<\/strong><br>It seems like a simple skill, but fewer things can casue more problems in life than a failure to properly communicate: to both understand and be understood. A lack of communication skills likely cost US businesses millions, if not billions of dollars, and is likely responsible for much of the divorce that occurs in the Untied States.<\/p>\n\n\n\n<p>Unfortunately, it seems that this skill isn’t getting any more prolific but is on the decline. Rather than being kind to one another, it’s more common to be angry or resentful, or down right nasty to one another. Common courteously just isn’t as common as it used to be.<\/p>\n\n\n\n<p>There is good news. It we can still learn how to be better with finances. We can improve our health. And we can learn better ways of communication. It’s not to late to start making changes in our lives that can make our lives better in all sorts of ways. Yet, I cannot expect you to make the necessary changes in my life. I can’t just sit around, blaming others for my own shortcomings. It’s up to me to take the initiative. I have to take the first steps to start my own journey.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are things that I wish that they would teach us in school, or at least maybe do a better job at teaching. I’m not sure it would have done any good, but the lack of education in these areas could very well have negative&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/things-they-dont-teach-in-school\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":80,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[23,20,22,21],"class_list":["post-79","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-communication","tag-finances","tag-health","tag-money"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/79","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=79"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/79\/revisions"}],"predecessor-version":[{"id":81,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/79\/revisions\/81"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/80"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=79"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=79"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=79"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}