{"id":793,"date":"2023-05-06T13:52:39","date_gmt":"2023-05-06T13:52:39","guid":{"rendered":"https:\/\/llgt.cafe\/?p=793"},"modified":"2023-05-06T13:52:39","modified_gmt":"2023-05-06T13:52:39","slug":"god-is-love","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/god-is-love","title":{"rendered":"God is love"},"content":{"rendered":"\n<p>It would be great if I always felt God’s love and His presence. In fact, there have been many times that I haven’t.<\/p>\n\n\n\n<p>The truth is that God is love. It’s not because of anything that we do or don’t do that God loves us but because of who he is. God not only loves us because he created us but because we are uniquely created in his image. And God is love.<\/p>\n\n\n\n<p>It’s hard for us to understand this, or it is for me, how much God loves us. Now, I understand a little about love, for I have loved. But my love is nowhere near as great as God’s love. “ For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:16 (KJV)<\/p>\n\n\n\n<p>Now, I tend to give love “because”: because you are family, or you are my friend. And I tend to feel loved because of my circumstances. Yet, God loves us all of the time, and it has nothing to do with our circumstances or how we feel.<\/p>\n\n\n\n<p>I’ve been staying with my sister and her family for just over a month now. My sister’s daughter, son-in-law and grandchildren are here, too. One night, my sister brought her grandson downstairs to be with her husband to be with her husband so that she could spend time with her daughter. Now, the three year old grandson started crying because he wanted to be with his grandmother.<\/p>\n\n\n\n<p>Now, this is like our relationship with God. God is above all things, and we long to be with him. But just because we are not together does not mean that God does not love us. It is by faith, therefore, that we must trust that God loves us and has our best interest in mind, regardless of our circumstances.<\/p>\n\n\n\n<p>One more thing. For those who put their faith in Christ, Earth is the closest that we will come to hell and separation from God. For those who reject Christ, Earth is the closest that they will come to heaven. I hope that you will put your faith in Jesus Christ. God tells us that he loves us and you can believe him because God never lies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It would be great if I always felt God’s love and His presence. In fact, there have been many times that I haven’t. The truth is that God is love. It’s not because of anything that we do or don’t do that God loves us&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/god-is-love\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":794,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,41,14],"tags":[8,5,3],"class_list":["post-793","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-family","category-spiritual","tag-god","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/793","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=793"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/793\/revisions"}],"predecessor-version":[{"id":795,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/793\/revisions\/795"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/794"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=793"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=793"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=793"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}