{"id":796,"date":"2023-05-07T17:21:07","date_gmt":"2023-05-07T17:21:07","guid":{"rendered":"https:\/\/llgt.cafe\/?p=796"},"modified":"2023-05-07T17:21:07","modified_gmt":"2023-05-07T17:21:07","slug":"asking-questions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/asking-questions","title":{"rendered":"Asking Questions"},"content":{"rendered":"\n<p>Learning begins with questions. I remember asking a lot of questions when I was little. It’s pretty common. I don’t remember asking why the sky was blue, but I do remember asking how long it took for light from the sun to reach the earth. I was a little older at the time. Older than when I was pointing and asking “what’s that?”<\/p>\n\n\n\n<p>Everything that we know, or at least those things that we think we know, began with a question. When we are little, we all ask lots of questions, including wondering why the sky is blue. And we try to find answers. We may not always get the right answer, but when we are young, we tend to believe what we are told.<\/p>\n\n\n\n<p>The important thing is that we ask questions, and we need to ask the right questions. Don’t ask “why am I so stupid,” or “why do I make so many mistakes.” Instead, ask “what can I learn from my mistakes?” We all make mistakes. Thomas Edison, when inventing the light bulb didn’t see a thousand failures but a thousand experiments that pointed out elements that didn’t work.<\/p>\n\n\n\n<p>They say that necessity is the mother of invention. Something goes wrong or we need to do something faster. Maybe we just need to do something a little differently. There are lots of questions we could ask: “what if…., how would making this change affect that?, or what if I just started all over?”<\/p>\n\n\n\n<p>“Imagination is more important than knowledge. Knowledge is limited. Imagination encircles the world.” — Albert Einstein<\/p>\n\n\n\n<p>It takes quite an imagination to ask questions. That’s why children ask so many questions because the are so curious about everything and everything is still so new. It’s amazing, however, how quickly things become mundane. We stop exploring and we stop asking questions.<\/p>\n\n\n\n<p>None of us know everything, but I think that we often think that we know enough. And it has become so easy to find answers to the questions that we seek though a book or video. In fact, we can find just about any answer that we want on the small computer in our pocket. But that doesn’t mean that we should stop asking questions.<\/p>\n\n\n\n<p>There is one more thing. If we ask someone else a question, we need to listen, even if that person’s option differs from our own. Listing without judging and only ask questions to clarify. Avoid building your own argument when the other person is talking. Other people can often see things that we cannot see and they have a perspective that is different from ours. And the strangest part of all is that they may be right, too, or they may be right and we may be wrong. Be open to asking questions. It’s okay if we don’t find the answer right away.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Learning begins with questions. I remember asking a lot of questions when I was little. It’s pretty common. I don’t remember asking why the sky was blue, but I do remember asking how long it took for light from the sun to reach the earth.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/asking-questions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":797,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19],"tags":[3],"class_list":["post-796","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/796","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=796"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/796\/revisions"}],"predecessor-version":[{"id":798,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/796\/revisions\/798"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/797"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=796"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=796"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=796"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}