{"id":803,"date":"2023-05-09T16:11:07","date_gmt":"2023-05-09T16:11:07","guid":{"rendered":"https:\/\/llgt.cafe\/?p=803"},"modified":"2023-05-09T16:11:07","modified_gmt":"2023-05-09T16:11:07","slug":"five-lessons-from-peppa-pig","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/five-lessons-from-peppa-pig","title":{"rendered":"Five Lessons From Peppa Pig"},"content":{"rendered":"\n<p>If you don’t know who Peppa Pig is, ask a five year old. Peppa Pig is a children’s show that starts out with a little pig named Peppa Pig introducing herself and the rest of her family. Her best friend is a rabbit and. It’s a British show that I think can teach us all a few things.<\/p>\n\n\n\n<p><strong>Be respectful<\/strong><br>Along with trust, respect is among the most important parts of any relationship. It is something that we should show others right away instead of, as some think, that it has to be earned before it can be given.<\/p>\n\n\n\n<p>In order to give respect, however, we have to know what respect is and what is not. And we must first have respect for ourselves. We show respect by understanding that our value comes from our creator. It does not mean giving in to what others want, whatever the cost. It requires trust and honesty and caring for the good of ourselves and of others. To show respect for ourselves and others, we must know when to say “yes” and “no.”<\/p>\n\n\n\n<p><strong>Ask questions<\/strong><br>Along the same lines as respect, we ought to be able to ask questions. Avoid questions like “Why are you so fat,” and “How could you be such an idiot”. “What do you mean,” and “How did you come to that conclusion” might be better questions. The thing that we want to do is to clarify, to learn more while avoiding making assumptions.<\/p>\n\n\n\n<p><strong>Make up quickly<\/strong><br>Friends or family may hurt us and sometimes do. Yet, it is almost never done with the intention of causing physical or emotional harm. Avoid cutting off communication. Instead, try to be the first to open up. Talk about your feelings and avoid calling the other person names or attacking someone personally. Just because that person hurt you in some way doesn’t give you permission to hurt them in in return. Your goal is to restore the relationship, not to get even.<\/p>\n\n\n\n<p><strong>Look for ways to help others<\/strong><br>We all need help at one time or another. Social distancing and pride may make it harder to discover ways that we can help each other, but it’s not impossible. We may be able to find a place where we can volunteer or we may just keep our eyes open to be able to spot some place where we can help.<\/p>\n\n\n\n<p><strong>Have fun<\/strong><br>Finally, have fun. Find things that you like doing together, even if it’s jumping in muddy puddles. You can always find things that you like doing alone, but try to find things that you enjoy doing with others. And remember “When you jump in muddy puddles, you have to wear your boots.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you don’t know who Peppa Pig is, ask a five year old. Peppa Pig is a children’s show that starts out with a little pig named Peppa Pig introducing herself and the rest of her family. Her best friend is a rabbit and. It’s&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/five-lessons-from-peppa-pig\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":804,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[60,69,67,51],"tags":[3],"class_list":["post-803","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-communication","category-community","category-habits","category-personal-growth","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/803","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=803"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/803\/revisions"}],"predecessor-version":[{"id":805,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/803\/revisions\/805"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/804"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=803"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=803"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=803"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}