{"id":806,"date":"2023-05-10T16:22:34","date_gmt":"2023-05-10T16:22:34","guid":{"rendered":"https:\/\/llgt.cafe\/?p=806"},"modified":"2023-05-10T16:22:34","modified_gmt":"2023-05-10T16:22:34","slug":"a-little-more-2","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/a-little-more-2","title":{"rendered":"A Little More"},"content":{"rendered":"\n<p>The Lord is my shepherd; I shall not want. — Psalm 23:1 (KJV)<\/p>\n\n\n\n<p>Even as a child, I had seen these words, but I didn’t really understand them — until recently.<\/p>\n\n\n\n<p>We are, it seems, constantly bombarded with the message that we just need a little more. We need a little more money so that we can buy the latest tech. We need a little more fame and a little more popularity. We need a little more power, either over others or to control our own lives. You name it, whatever it is, it seems that we never have enough.<\/p>\n\n\n\n<p>The need can become so great that we can spend our whole life looking for just a little more. Some will use and abuse others to get just a little more, while others will destroy whoever or whatever stands in the way of getting what they want. For some, it’s one more high, while for others, it’s one more drink to dull the pain. It’s why human trafficking, sex trafficking, the porn industry, drug wars and wars in general exist.<\/p>\n\n\n\n<p>James 4:1-3 says, “From whence come wars and fightings among you? come they not hence, even of your lusts that war in your members? Ye lust, and have not: ye kill, and desire to have, and cannot obtain: ye fight and war, yet ye have not, because ye ask not. Ye ask, and receive not, because ye ask amiss, that ye may consume it upon your lusts.”<br>From the beginning, God promised that, if we put our faith in Him, He would provide all that we need; He would withhold no good thing. Yet, along came the serpent, when things were perfect, Adam and Eve believed the lie that they could have just a little more. So, we’ve been falling for the lie ever since.<br>The truth is, God really does love us and He really does want what is best for us. Oh, a little more can satisfy. But it doesn’t last. Snickers satisfy, but we still need to eat again an hour or two later. It’s the need for a little more — just a little — that’s never satisfied. It’s when we turn our eyes from God our provider and begin searching for a little more that our lives begin to lack the satisfaction that we all desire.<br>What can we do? Just knowing this can help. In John 10:10 (KJV), Jesus tells us that, “The thief cometh not, but for to steal, and to kill, and to destroy: I am come that they might have life, and that they might have it more abundantly.” I trust God. Do you?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Lord is my shepherd; I shall not want. — Psalm 23:1 (KJV) Even as a child, I had seen these words, but I didn’t really understand them — until recently. We are, it seems, constantly bombarded with the message that we just need a&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/a-little-more-2\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":807,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14,63],"tags":[33,8,7,5,3],"class_list":["post-806","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","category-wants","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/806","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=806"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/806\/revisions"}],"predecessor-version":[{"id":808,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/806\/revisions\/808"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/807"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=806"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=806"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=806"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}