{"id":809,"date":"2023-05-11T17:14:57","date_gmt":"2023-05-11T17:14:57","guid":{"rendered":"https:\/\/llgt.cafe\/?p=809"},"modified":"2023-05-11T17:14:57","modified_gmt":"2023-05-11T17:14:57","slug":"creativity-killers","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/creativity-killers","title":{"rendered":"Creativity Killers"},"content":{"rendered":"\n<p>There are at least three things that can keep us from being creative. Being too busy, stress and self doubt are some of the worst. But there are things that we can do.<\/p>\n\n\n\n<p><strong>Busyness<\/strong><br>It’s easy to be too busy. We have one thing after another to take care of and, before we know it, the day is gone and it’s time to go to bed. Life just needs to have so many demands.<\/p>\n\n\n\n<p>If we want to be creative, especially if this is how we earn our money, we have to set time aside to be creative. It may just take an hour or so, but if we don’t make a conscious effort, it isn’t going to happen on it’s own. Some people have been know to set aside not only a time to be creative, but also have a particular place where they do their creative work. Others have even left familiar surroundings to find time to be creative — a cabin in the woods or some other place.<\/p>\n\n\n\n<p><strong>Stress<\/strong><br>Stress and worry are big creativity killers. They seem to take up all of our thoughts and make it difficult to do anything but worry. Often, the things that we worry about are nothing we can change, but that doesn’t keep us from worrying about them, anyway.<\/p>\n\n\n\n<p>One thing that helps me when I have a lot on my mind is to just take time to write about them. Somehow, getting things on paper, or into a journal on my computer, often helps clear my mind. The nice thing is that it not only helps me to be creative, but it can help me sleep better at night.<\/p>\n\n\n\n<p>Talking with someone about the things that are bothering you may help, too, and may even provide insights that we might have otherwise missed. It may be good to talk not only about the things that are bothering you but also the work that you need to accomplish. Who knows what ideas you may be able to come up with together.<\/p>\n\n\n\n<p><strong>Self doubt<\/strong><br>You can always find someone to tell you that you’re not good at something. Dr. James Dobson was told that he couldn’t write, but that was before he published several best selling books. If someone else doesn’t tell us that we’re no good at something, we might just tell ourselves that.<\/p>\n\n\n\n<p>In reality, very few pick up a paint brush or any other tool and are immediately amazing artists. That doesn’t mean that we should give up. I tried several things before I began writing and, really, I do it just because I enjoy it. I also enjoy taking pictures. Certainly, not all of my photos are of museum quality, but that doesn’t stop me.<\/p>\n\n\n\n<p>Don’t forget, there are ways to learn to get better at whatever you want to do. You can read books or watch videos. You can even take classes and have someone teach you in person. The main thing is that you are practicing you art.<\/p>\n\n\n\n<p>Being creative may or may not help us make a living. One of my favorite photographers, David Burnett, was already a well known and well published photographer, but that didn’t keep him from trying new things that would make his work stand out from the rest. The important thing isn’t the tools we own but the brain that we have that imagines the work that can be done and makes the commitment to do that work. And if we make a real commitment, almost nothing can stop us.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are at least three things that can keep us from being creative. Being too busy, stress and self doubt are some of the worst. But there are things that we can do. BusynessIt’s easy to be too busy. We have one thing after another&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/creativity-killers\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":810,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[28],"tags":[3],"class_list":["post-809","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-creativity","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/809","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=809"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/809\/revisions"}],"predecessor-version":[{"id":811,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/809\/revisions\/811"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/810"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=809"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=809"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=809"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}