{"id":815,"date":"2023-05-13T16:05:01","date_gmt":"2023-05-13T16:05:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=815"},"modified":"2023-05-13T16:05:01","modified_gmt":"2023-05-13T16:05:01","slug":"thoughts-on-food","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/thoughts-on-food","title":{"rendered":"Thoughts on Food"},"content":{"rendered":"\n<p>The cooking school that I went to put quotes of well known chefs up on its walls. Food is such a big part of our lives. It’s not only part of survival, but it can be a big part of our memory. The tastes and smells, along with the shared moments, can build memories that will last a lifetime. Below are just a few food quotes.<\/p>\n\n\n\n<p>“My favorite time of day is to get up and eat leftovers from dinner, especially spicy food. “<br>— David Byrne<\/p>\n\n\n\n<p>My favorite time of the day is meal time. After that, bed time. Part of the reason I look forward to meal time is that it can be a welcome break from whatever it is that I’m doing. I remember being in basic training and how much I looked forward to dinner, as we ran another lap.<\/p>\n\n\n\n<p>“Eating is not merely a material pleasure. Eating well gives a spectacular joy to life and contributes immensely to goodwill and happy companionship. It is of great importance to the morale.”<br>— Elsa Schiaparelli<\/p>\n\n\n\n<p>Eating well doesn’t have to be a huge steak and baked potato. One of my favorite foods is fresh berries, right off of the tree or vine. Some times the simple things are the best of all. Yet, better than having good food is having someone to share it with.<\/p>\n\n\n\n<p>It’s amazing how many of us think that our parents or guardians are the best cooks in the world. Some may realize that this is not true and may have taken to cooking for ourselves. I don’t think it’s because they are actually the best cook in the world but how that person and his or her food makes you feel. After all, cooking should be done with love.<\/p>\n\n\n\n<p>“Food should be fun.”<br>— Thomas Keller<\/p>\n\n\n\n<p>Food should be fun. I like cooking and I like eating. I have to admit that some times I eat when I’m depressed. It doesn’t really help. I enjoy the planning, the purchasing, the preparing and she sharing. To me, it’s all fun.<\/p>\n\n\n\n<p>“If you can&#8217;t feed a hundred people, then feed just one.”<br>— Mother Teresa<\/p>\n\n\n\n<p>This isn’t to say that we should just feed ourselves. To me, it is important that others have something to eat, too. Maybe we cannot feel the masses as Jesus did, but perhaps we can make sure that at least one other person has something to eat.<\/p>\n\n\n\n<p>“If you really want to make a friend, go to someone’s house and eat. The people who give you their food give you their heart.”<br>– Cesar Chavez<\/p>\n\n\n\n<p>Food really is about the heart. It’s not always the food or the time to cook it that matters but the love that is put into it. If the love is missing, it shows. I hope that you find love in all of your meals and that the time you spend eating them is worth remembering. After all, you are not likely to remember what you ate but how it makes you feel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The cooking school that I went to put quotes of well known chefs up on its walls. Food is such a big part of our lives. It’s not only part of survival, but it can be a big part of our memory. The tastes and&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/thoughts-on-food\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":816,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43],"tags":[3],"class_list":["post-815","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/815","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=815"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/815\/revisions"}],"predecessor-version":[{"id":817,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/815\/revisions\/817"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/816"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=815"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=815"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=815"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}