{"id":818,"date":"2023-05-14T16:34:26","date_gmt":"2023-05-14T16:34:26","guid":{"rendered":"https:\/\/llgt.cafe\/?p=818"},"modified":"2023-05-14T16:34:26","modified_gmt":"2023-05-14T16:34:26","slug":"a-daughters-story","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/a-daughters-story","title":{"rendered":"A Daughter&#8217;s Story"},"content":{"rendered":"\n<p><strong>&#8221; To describe my mother would be to write about a hurricane in its perfect power. Or the climbing, falling colors of a rainbow.&#8221;<br>-Maya Angelou<\/strong><br>I have always sought the meaning of love. Trying hard to see how much of it exists in this world we live in, but most times, all I have to do is look at my mother. I behold her, and my eyes sting from the emotions I try so hard to restrain. She is the epitome of true love.<br>Sometimes, it breaks my heart when I think of how I have done so little… not enough to show my gratitude for all the things she&#8217;s done for me.It&#8217;s not like she is plagued with entitlement to bother about returns, it is just the way she is.<\/p>\n\n\n\n<p><br>As I through my thoughts, my sight is brightened with colors: colors that paint beautiful pictures of the love, warmth, and care I have received from my mother.<\/p>\n\n\n\n<p><br>Patient, caring and kind are cliches used to describe a good person, and so I remember this particular day, years ago when I was so small and naive. I had just finished my exams in pre-school and my results were given to me. I was overwhelmed with joy as I thought about the little booklet in my hands. The teacher had said, &#8220;give this to your mother when you get home.&#8221; And I couldn&#8217;t wait to deliver the message. Finally! Something, -a gift I thought- to give my parents.<\/p>\n\n\n\n<p><br>I can&#8217;t remember what took place, but according to my mother, I approached her almost breathlessly to hand over my results. My eyes were bright and full of delight. She hurriedly opened the booklet. My excitement had affected her, and she was as eager as I was.<\/p>\n\n\n\n<p><br>What she saw was heartbreaking. I had performed poorly in class, so poorly, I came second from the last. She stared at my pretty face and saw a bright smile. At that point, she realized I had no clue about what was going on. Overcome with emotions she broke down in tears. Not because she was angry or offended, but because she was moved by my innocence. At that point, I also blurted out in tears, I was confused as my little brain then could not understand why my mum would cry. I hated to see her sad.<br>Funnily anytime she tells that story, I fight down the surging emotions that overwhelm me. And that story always reveals something deep to me about motherhood.<\/p>\n\n\n\n<p><br>You see, my mom has always been a smart kid. Always took the first position, and always got the prize for best student in her class. She used to say, everybody would call her name even before the result was announced. They would call, sing and praise her. She did well throughout secondary school, but couldn&#8217;t go to the university because of the lack of funds and support. She went on to work so she could cater to her siblings and parents. She has always carried the burden of her family on herself.<br>She worked hard to earn enough to sponsor her siblings to school due to her zeal and passion to help them become the best for themselves, and for society at large. The life of my mother has taught me so much that I would like to talk about.<\/p>\n\n\n\n<p><br>Firstly, she is patient in every sense of the word. Life has been fair because she cares. It always amazes me the way she tends to others more than they do to themselves. She has nurtured and protected the life of the people around her from the harshness of society.<\/p>\n\n\n\n<p><br>I realize that when the heat pours, and my heart is torn, her arms are where I find the comfort I need. Her soothing words have always been the ointment I need to heal. Whenever I go through tough times, I remember her words, &#8220;you can do this,&#8221; &#8220;you are capable of soaring above your limitations,&#8221; and &#8220;The world is waiting for your light.&#8221;<\/p>\n\n\n\n<p><br>She has always spoken positive words to me, and It is at these times, in these moments that I carry on, with the boldness and tenacity of a world champion. It is these words that make me surprise myself with my capabilities &#8211; My superpowers that would otherwise be hidden inside me.<br>I have always been a shy child. Unable to speak up when I should, but her life has taught me the way of the Lord. She trained me to walk on the right path, and this has changed my life forever. It has given me boldness and has made me learn about myself.<\/p>\n\n\n\n<p><br>Secondly, she is kind. I know this not because of how she treats me, but how she relates with everyone in her world. I have seen her bleed for others to feed. I have seen her fast while others get indulge. And even when I am infuriated by her self- sacrificing nature, it is the way she smiles and tells me, &#8220;all will be well,&#8221; That always transforms my anger to wonder at her. To marvel at her tender heart.<br>I love how she mixes such tenderness with zeal and dogma. She will spare no time, and no treasure so those around her can transform into precious jewels. I see her and I check myself, I see her and I adjust my life. As a child, I also remember how she stood for us during the times Dad traveled on long trips. She was our stability. She prayed for us and taught us to pray for ourselves. This also has saved me from terrorizing situations.<\/p>\n\n\n\n<p><br>I have often looked at myself and realized I would have been lazy. But she served as a good example through her relentless effort in all that she did. She moved against all odds to improve herself, to make her life better. I saw this and it made me venture into a business while at school. It gave me the courage to mix and handle two different degrees and my business at the same time. True, it was strenuous and difficult, but I lacked the fear to stop. Her life encouraged me to move on. I saw how she mixed her work, with your school, function in the church, and the ever-demanding role of wife and mother.<br>I also love the way she loves my Father. I see how she sticks with him through the difficult and the easy times. Through the rain and sunshine. I see how she loved him unconditionally and supported him passionately, and tenderly. Her life teaches me faithfulness because I&#8217;m learning how to be a loving and supportive wife to my husband when the time comes.<\/p>\n\n\n\n<p><br>I am grateful to God for her life, and I&#8217;m grateful to her for being such an inspiration. I am thankful to her for being a helper. I Thank her for being a teacher, a supporter, my cheerleader, and my first audience. Thank you Mom for believing in me and for fighting for me. Thank you for loving me. You have set a yardstick in my life and I&#8217;m not confused when I see true love. Thank you for being a good mother to me. I love you.<\/p>\n\n\n\n<p><br>Meet Joy Inegbenose, an exceptional writer and multi-talented freelancer with a passion for creativity and innovation. She has a Bachelor&#8217;s degree in Business Administration and a certification in Data Science and has honed an array of skills that make her stand out in professional settings. <a href=\"https:\/\/www.fiverr.com\/fabulous_write\" target=\"_blank\" rel=\"noreferrer noopener\">https:\/\/www.fiverr.com\/fabulous_write<\/a><\/p>\n\n\n\n<figure class=\"wp-block-image size-full is-resized\"><a href=\"https:\/\/www.fiverr.com\/fabulous_write\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/llgt.cafe\/wp-content\/uploads\/2023\/05\/Screen-Shot-2023-04-22-at-8.39.14-PM.png\" alt=\"\" class=\"wp-image-819\" width=\"176\" height=\"205\" srcset=\"https:\/\/llgt.cafe\/wp-content\/uploads\/2023\/05\/Screen-Shot-2023-04-22-at-8.39.14-PM.png 382w, https:\/\/llgt.cafe\/wp-content\/uploads\/2023\/05\/Screen-Shot-2023-04-22-at-8.39.14-PM-258x300.png 258w\" sizes=\"auto, (max-width: 176px) 100vw, 176px\" \/><\/a><\/figure>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8221; To describe my mother would be to write about a hurricane in its perfect power. Or the climbing, falling colors of a rainbow.&#8221;-Maya AngelouI have always sought the meaning of love. Trying hard to see how much of it exists in this world we&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/a-daughters-story\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":820,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[41,24],"tags":[3],"class_list":["post-818","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-family","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/818","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=818"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/818\/revisions"}],"predecessor-version":[{"id":821,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/818\/revisions\/821"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/820"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=818"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=818"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=818"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}