{"id":82,"date":"2022-11-04T18:14:17","date_gmt":"2022-11-04T18:14:17","guid":{"rendered":"https:\/\/llgt.cafe\/?p=82"},"modified":"2022-11-04T18:14:17","modified_gmt":"2022-11-04T18:14:17","slug":"holidays-i-wont-be-celebrating","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/holidays-i-wont-be-celebrating","title":{"rendered":"Holidays I Won&#8217;t Be Celebrating"},"content":{"rendered":"\n<p>Today is National Skeptics Day. A skeptic is someone who has is a doubter, especially doubling matters that are widely accepted as being true. I, for one, doubt that I will be celebrating this holiday.<\/p>\n\n\n\n<p>There are other holidays that I doubt that I will be celebrating. Beginning with the new year, January 1 brings Polar Bear Swim Day. According to Wikipedia, “A polar bear plunge is an event held during the winter where participants enter a body of water despite the low temperature. In the United States, polar bear plunges are usually held to raise money for a charitable organization. In Canada, polar bear swims are usually held on New Year&#8217;s Day to celebrate the new year.” I think I’ll pass on that one.<\/p>\n\n\n\n<p>February 5 is National Fart Day. Enough said. <a rel=\"noreferrer noopener\" href=\"https:\/\/www.youtube.com\/watch?v=NxO5IAEwpG8\" target=\"_blank\">Check out this video<\/a>.<\/p>\n\n\n\n<p>There have been claims made that March 11 is Debunking Day, but you will have to find out for yourself if this is true or not. I kind of have my doubts.<\/p>\n\n\n\n<p>Can you guess what April 15 is? Give up? It’s Take a Wild Guess Day.<\/p>\n\n\n\n<p>Two days later, on April 17, there’s Bat Appreciation Day. According to Holiday Insights, “Bats can actually be your friend. Bats are nocturnal flyers, emerging after dark, from caves, steeples, and the attics of old buildings. They use a form of radar to seek their favorite food source of mosquitos and other night time insects. Gardeners certainly appreciate bats. Bat guano is among the best manures you can use, in your home garden.” I don’t plan to celebrate.<\/p>\n\n\n\n<p>May 1 is Phone in Sick Day. It’s a day that I hope I don’t need to celebrate.<\/p>\n\n\n\n<p>January 21 is Atheist Solidarity Day. According to the BBC, “Atheists are people who believe that god or gods (or other supernatural beings) are man-made constructs, myths and legends or who believe that these concepts are not meaningful.” No, I won’t be standing with the atheist, unless it’s to pray for them.<\/p>\n\n\n\n<p>I’m afraid I won’t be celebrating Freedom From Fear of Speaking Day, which is on July 2.<\/p>\n\n\n\n<p>August 20 is World Mosquito Day. And, thought the mosquitoes may be celebrating this day, I won’t.<\/p>\n\n\n\n<p>September 6 is Fight Procrastination Day. According to holiday insights, “To many people, aka procrastinators, putting things off is a way of life. The more difficult the action or decision, the easier it is to join the league of procrastinators.” I like the quote by Mark Twain: “Never put off till tomorrow, what you can do the day after tomorrow.”<\/p>\n\n\n\n<p>Finally, there is National Lard Day, celebrated on December 8.<\/p>\n\n\n\n<p>To be honest, I don’t celebrate many holidays. I do celebrate Thanksgiving and Christmas, and I watch the occasional 4th of July fireworks. Yet, if we look for it, I think there we might find something that we can celebrate ever day.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Today is National Skeptics Day. A skeptic is someone who has is a doubter, especially doubling matters that are widely accepted as being true. I, for one, doubt that I will be celebrating this holiday. There are other holidays that I doubt that I will&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/holidays-i-wont-be-celebrating\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":83,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[24],"tags":[3],"class_list":["post-82","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/82","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=82"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/82\/revisions"}],"predecessor-version":[{"id":84,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/82\/revisions\/84"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/83"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=82"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=82"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=82"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}