{"id":822,"date":"2023-05-15T15:36:37","date_gmt":"2023-05-15T15:36:37","guid":{"rendered":"https:\/\/llgt.cafe\/?p=822"},"modified":"2023-05-15T15:36:37","modified_gmt":"2023-05-15T15:36:37","slug":"its-your-choice","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/its-your-choice","title":{"rendered":"It&#8217;s Your Choice"},"content":{"rendered":"\n<p>You could say I’ve had a hard life. It could be said of just about anybody. Live long enough and there are bound to be difficult times, from not getting the new toy that you want to loosing someone you love: even facing your own mortality.<\/p>\n\n\n\n<p>It’s said that for every negative comment, we need ten positive comments to counter the one negative. The negative in our lives just carries more weight in our minds. But it is possible to overcome that tendency.<\/p>\n\n\n\n<p>Every moment of every day, we are choosing what we are focused on. We may be focused on our work, or on the fact that we aren’t able to work right now. We may be focused on someone we love, or we may be focused on the person who cut us off in traffic.<\/p>\n\n\n\n<p>The important thing to remember is that we can choose what we focus on, and what we choose to think about the things that are going on in our lives. Or we can just let our circumstances determine what we think about.<\/p>\n\n\n\n<p>Dan Miller, author of the book “48 Days to the Work You Love”, and creator of the podcast by the same name speaks about the view of the family that he was raised in. He says that his life may have been hard, that he had to do things that he may not have enjoyed doing, that others might complain about, but that these things helped him become the man that he is, today. And he is grateful for this.<\/p>\n\n\n\n<p>James 1:2-3 (KJV) says, “My brethren, count it all joy when ye fall into divers temptations; Knowing this, that the trying of your faith worketh patience.”<\/p>\n\n\n\n<p>I’ll admit that this has been a really difficult verse for me to get a hold of. Yet, after having survived many difficult challenges, I see that these hard times have made me more patient and, perhaps, better able to help others with problems that they are having.<\/p>\n\n\n\n<p>Right now, fear is an emotion that a lot of people are likely dealing with. Fear of sickness, fear of the future, and fear of loss; these can all be difficult to deal with. But there are other things that we can choose to put our attention on.<\/p>\n\n\n\n<p>For one, we can choose to be thankful for what we do have, rather than focus on what we don’t: what we still have, instead of what we’ve lost. Here’s one: we can always have hope.<\/p>\n\n\n\n<p>Another thing we can do is we can make plans. I might not be able to take that trip to Oregon that I was hoping to take, but I can plan to meet with my friend to have pizza for dinner, tomorrow.<\/p>\n\n\n\n<p>You may need to turn off the TV, and stop watching the evening news. You may need to stop listing to some of the negative voices in you life. When someone says or does something that may be hurtful or negative, you can just say “thank you,” and move on. You don’t have to dwell on it so that it ruins your day.<\/p>\n\n\n\n<p>Find one thing that you are truly thankful for and dwell on that. It could be a relationship, a memory, or a future hope. Try and make it something that no one can take away.<\/p>\n\n\n\n<p>Philippians 4:8 (KJV) says, “Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things.”<\/p>\n\n\n\n<p>You can wait for your circumstances to change, or you can begin to make your own changes. It’s your choice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You could say I’ve had a hard life. It could be said of just about anybody. Live long enough and there are bound to be difficult times, from not getting the new toy that you want to loosing someone you love: even facing your own&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/its-your-choice\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":823,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26],"tags":[5,3],"class_list":["post-822","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/822","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=822"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/822\/revisions"}],"predecessor-version":[{"id":824,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/822\/revisions\/824"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/823"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=822"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=822"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=822"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}