{"id":829,"date":"2023-05-17T16:36:20","date_gmt":"2023-05-17T16:36:20","guid":{"rendered":"https:\/\/llgt.cafe\/?p=829"},"modified":"2023-05-17T16:36:20","modified_gmt":"2023-05-17T16:36:20","slug":"rant","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/rant","title":{"rendered":"Rant"},"content":{"rendered":"\n<p>I don’t know about you, but I have trouble getting diversity into my diet. Yellow cheese, white flour, red sauce, brown sausage and black olives isn’t really diversity. Neither is the forty or fifty ingredients found in a bag of chips.<\/p>\n\n\n\n<p>Being single and on a budget, it’s hard to get vegetables into my diet. Don’t get me wrong, I love vegetables. But they are often packaged for a family, and fresh vegetables can have such a short shelf life.<\/p>\n\n\n\n<p>It’s sad that a healthy diet can be so expensive. The price of organic and non-GMO is often higher than other foods, which can be loaded with chemicals, soy, as well as a number of ingredients that you need a degree in chemistry to understand.<\/p>\n\n\n\n<p>Those who sell supplements may remind you that the soil that the produce is grown in has been overworked for years and no longer produces the nutrition that is needed to be of any benefit. Yet, I can’t afford to spend $50 to $100 or more on supplements.<\/p>\n\n\n\n<p>I enjoy shopping the local health food stores, but I have no idea what 95% of the hundreds of supplements are meant to do. And it can be hard to get information because of the fear of making a health claim. And no one is going to do a clinical study on the benefits of cinnamon, because there’s no money in it.<\/p>\n\n\n\n<p>On top of everything else, there are so many opinions then it comes to what we eat. Some times, it seems that no two “experts” can agree entirely on what we should include or exclude in our diet.<\/p>\n\n\n\n<p>Unfortunately, I don’t have an answer. Some times the best I can is to take the latest advice that I see on YouTube. Maybe I see something at the store that catches my attention, so I buy it. Or an informercial offers another “amazing product” that makes claims of being better than all the rest.<\/p>\n\n\n\n<p>I don’t really have any answers. Perhaps in the future, I’ll be able to spend more time and money on eating healthy. Who knows, maybe I could get married and not have to worry about cooking just for myself. Instead, there would be other things to worry about. So my advice is this: be happy where you are at. Don’t worry about the things you can’t change, but work on things that you can. I don’t know about you, but that sounds like advice that I could put into practice.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I don’t know about you, but I have trouble getting diversity into my diet. Yellow cheese, white flour, red sauce, brown sausage and black olives isn’t really diversity. Neither is the forty or fifty ingredients found in a bag of chips. Being single and on&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/rant\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":830,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,70,38,29],"tags":[3],"class_list":["post-829","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-lifestyle","category-money","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/829","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=829"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/829\/revisions"}],"predecessor-version":[{"id":831,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/829\/revisions\/831"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/830"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=829"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=829"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=829"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}