{"id":832,"date":"2023-05-18T17:02:19","date_gmt":"2023-05-18T17:02:19","guid":{"rendered":"https:\/\/llgt.cafe\/?p=832"},"modified":"2023-05-18T17:02:19","modified_gmt":"2023-05-18T17:02:19","slug":"tools-for-learning","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/tools-for-learning","title":{"rendered":"Tools for Learning"},"content":{"rendered":"\n<p>Interested in learning something new? There so many tools that can help speed you along the way. Not only are there the traditional tools, but there are a number of electronic tools that can help you learn and memorize new information. Here are some you can use.<\/p>\n\n\n\n<p>Apps<br>Apps for your phone can be downloaded from your favorite app store and can be easily used. While some are free, they may require some kind of registration. Others, which offer different classes, usually have some sort of cost. Remember, however, that apps like YouTube and iTunes U offer a great deal of free content.<\/p>\n\n\n\n<p>Audio Books<br>One of my favorite way to learn is just to listen to audio books. Subjects include business, health and wellness, history, science and technology, just to name a few. If you have a daily commute or are able to listen to audio books at work, this can be an excellent option.<\/p>\n\n\n\n<p>Chalkboard or dry eraser board<br>One way of memorizing long sentences or phrases is to write it out and read it out loud. Each time you read it, erase one or more words and see if you can remember what the missing words are.<\/p>\n\n\n\n<p>Doodles<br>According to teachwell.com, “Doodling can actually help you focus and make it easier to listen. It can relieve stress and improve productivity. It can also help in memory retention; doodle a number or word or image that pertains to what’s being addressed and it’s more likely to stay with you. And there’s no such thing as a mistake; they are your doodles, and whatever you create is just right.” They do warn, however, that doodling can be a distraction to the one who is speaking or teaching.<\/p>\n\n\n\n<p>Flow charts<br>Unlike traditional note taking, some people prefer to organize their notes into flow charts, bubbles of information, usually connected by lines. You can use notebooks or apps that are designed for putting together flow charts.<\/p>\n\n\n\n<p>Index cards<br>I find that index cards work very well for memorizing large amounts of information. I can have a stack of 100 or more information. Easier cards can be removed from the stack in order to work on information that is harder to memorize. You can, for example, put a word on one side and it’s definition on the other. Index cards can also be shuffled and flipped.<\/p>\n\n\n\n<p>Remember, the mind is the one tool that stays sharper with use. To put something into long term memory, it has to be studied or done repeatedly.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Interested in learning something new? There so many tools that can help speed you along the way. Not only are there the traditional tools, but there are a number of electronic tools that can help you learn and memorize new information. Here are some you&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/tools-for-learning\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":833,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[31,19,35],"tags":[3],"class_list":["post-832","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-did-you-know","category-education","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/832","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=832"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/832\/revisions"}],"predecessor-version":[{"id":834,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/832\/revisions\/834"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/833"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=832"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=832"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=832"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}