{"id":835,"date":"2023-05-19T16:34:00","date_gmt":"2023-05-19T16:34:00","guid":{"rendered":"https:\/\/llgt.cafe\/?p=835"},"modified":"2023-05-19T16:34:00","modified_gmt":"2023-05-19T16:34:00","slug":"the-psalms","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/the-psalms","title":{"rendered":"The Psalms"},"content":{"rendered":"\n<p>One of my favorite books in the Bible is the book of Psalm. In it, King David expresses a range of emotions, for worship and love to anger and vengeance. One of my favorite chapters is Psalm 23. And though I like the book of Psalm, it sometimes brings up more questions than it answers.<\/p>\n\n\n\n<p>It starts out fairly simple: “The Lord is my shepherd; I shall not want.” — Psalm 23:1 (KJV)<\/p>\n\n\n\n<p>My grandmother used to have Psalm 23 in the refrigerator door and, I have to admit, when I was little, I didn’t understand it at all. Now, I think it is less about having everything that we could ever want and more about knowing that we have everything that we need.<\/p>\n\n\n\n<p>The world would tell us that there is always something that we need. Television reminds us that we need the latest car, phone or toys of some sort. Or it reminds us that we need some medication to cure us. Maybe we just need to relax with that beer. It seems that there is always some area of out lives that is incomplete.<\/p>\n\n\n\n<p>But in this chapter, King Davis is saying that he has everything that he needs. Now I know that David went through some very difficult times in his life, especially before he became king, but even afterwards. Sol tried to kill David more than once, one of his sons died as an infant, and another of his sons killed his brother (or maybe half brother).<\/p>\n\n\n\n<p>In the end, however, King David is able to say, “Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the Lord for ever.”<\/p>\n\n\n\n<p>Gratitude is an attitude that goes along with a feeling of abundance. But so are resentment and a feeling of lack. It isn’t really our circumstance that dictate whether we feel gradate or resentment. Rather, it’s a choice that we make.<\/p>\n\n\n\n<p>I’ve seen people who seemed to have everything, yet never seem to have enough. At the same time, I’ve seen people who seem to have lost just about everything who find reason to be thankful in the little they have left.<\/p>\n\n\n\n<p>Some suggest writing out the things that we are thankful for. I wonder if we might also be able to find the good in the things that we aren’t yet thankful for. It’s just a though.<\/p>\n\n\n\n<p>It’s tempting to compare ourselves and our lives with the lives of others and to feel that there’s something missing. The reality is, however, that we don’ t know the full picture. And rather than wanting what someone else has, we should be thankful for the things that we have, whether it be friends and family or material possessions. If you think about it, most of us really do have the things that we need, and maybe enough to share with others.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of my favorite books in the Bible is the book of Psalm. In it, King David expresses a range of emotions, for worship and love to anger and vengeance. One of my favorite chapters is Psalm 23. And though I like the book of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/the-psalms\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":836,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,3],"class_list":["post-835","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/835","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=835"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/835\/revisions"}],"predecessor-version":[{"id":837,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/835\/revisions\/837"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/836"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=835"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=835"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=835"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}