{"id":838,"date":"2023-05-20T15:38:16","date_gmt":"2023-05-20T15:38:16","guid":{"rendered":"https:\/\/llgt.cafe\/?p=838"},"modified":"2023-05-20T15:38:16","modified_gmt":"2023-05-20T15:38:16","slug":"learning-from-our-past","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/learning-from-our-past","title":{"rendered":"Learning from our past"},"content":{"rendered":"\n<p>It would be nice if our future self could come back, at least once, to let us know about some of the dangers ahead. As far as we know this is not yet possible. Or maybe it is and our future selves decided that we just couldn’t handle knowing what might happen.<\/p>\n\n\n\n<p>It is possible, however, that we can learn from our past selves. We are pretty good at learning what we do and do not like: the things that we want to repeat and the things that we want to avoid.<\/p>\n\n\n\n<p>We are fairly good at learning from our own past — at least the things that we can remember and, perhaps even the things that we cannot. We may not be as good at learning from what others have learned, whether they are alive now or lived in the past. Among others, Winston Churchill said, “Those who fail to learn from history are condemned to repeat it.”<\/p>\n\n\n\n<p>We cannot only be blind to our own weaknesses, but we can also be a bit stubborn, thinking that our way is better. Some times, it may be better to learn from our own experience. But this doesn’t always have to be the case. And those who are willing to listen to others, asking questions whenever possible, are much more likely to save a lot of time and money in the process.<\/p>\n\n\n\n<p>So, what is it that our past selves might be able to teach us? I’m not sure. Everyone and every situation is a little different. Still, there are a few questions that we might ask ourselves.<\/p>\n\n\n\n<p>What happened, and what was my part in it taking place? You can blame others for everything that happens. This has become at least somewhat popular, but it does’t really help the situation and it doesn’t help when it comes to making changes in the future.<\/p>\n\n\n\n<p>How have my actions affected others? It may or may not be easy to answer this question, as we may never know how our actions might change someone else’s life. If we can and are willing, it may just be a matter of asking. Still, we may never know.<\/p>\n\n\n\n<p>Is there something that I can or need to change about what happened? Maybe there’s something that needs to be fixed or changed. It might be something that’s simple. If it’s more complex, consider taking baby steps.<\/p>\n\n\n\n<p>Is there a belief that I need to change? The easiest way to go is to blame someone else and to doubt their motives. It may be harder to examine our own motives or how we look at things. It may or may not be our motives that need changing but how we look at the things that happen to us that we need to examine.<\/p>\n\n\n\n<p>What might I do the next time this happens? If we do wind up coming across the same or similar circumstances, we may be able to do something differently to affect the outcome the newt time. There is no guarantee, though.<\/p>\n\n\n\n<p>You may be able to ask these questions in your head, but it may also help to put these questions on paper, or into some sort of document. I find that it helps me to write things out. And you may come up with some other questions.<\/p>\n\n\n\n<p>Much of life, whether we realize it or not, is an experiment. We form a hypothesis of one sort or another and when life permits us to test our theory, then we are able to find out whether we were right or not. And until we find a way for our future selves to teach us something, we at least have our past selves.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It would be nice if our future self could come back, at least once, to let us know about some of the dangers ahead. As far as we know this is not yet possible. Or maybe it is and our future selves decided that we&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/learning-from-our-past\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":839,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[35],"tags":[3],"class_list":["post-838","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/838","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=838"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/838\/revisions"}],"predecessor-version":[{"id":840,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/838\/revisions\/840"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/839"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=838"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=838"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=838"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}