{"id":841,"date":"2023-05-21T16:12:30","date_gmt":"2023-05-21T16:12:30","guid":{"rendered":"https:\/\/llgt.cafe\/?p=841"},"modified":"2023-05-21T16:12:30","modified_gmt":"2023-05-21T16:12:30","slug":"social-life-or-social-media","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/social-life-or-social-media","title":{"rendered":"Social Life or Social Media"},"content":{"rendered":"\n<p>We call it social media, but does it really help our social life? I saw a post on Facebook that said that our phones were keeping us closer to those who are far away but far from those who are close.<\/p>\n\n\n\n<p>Social media isn’t really to blame for keeping those who are physically close at bay and more than the candy at the store makes me buy it. Social media is, however, designed to be easy to use, as is the candy at the store placed in a way that it is easily found.<\/p>\n\n\n\n<p>Yes, social media can be a way in which we can keep in touch with family and friends who are far away. And as much as we move from place to place, it can be good to stay in touch with those we care about.<\/p>\n\n\n\n<p>One problem with social media is that it allows us to put on sort of a mask that can hide reality. We don’t need social media to do this, but it can make it easier. The truth is that our lives aren’t always exciting — I know that mine isn’t — and our lives don’t always turn out the way that we might have wanted. And it can be easy to paint a false image of how well things are going — on social media or otherwise.<\/p>\n\n\n\n<p>Social media tends to be one dimensional, as well, and lacks the true depth of real life. Sure, real life can be can be complicated, but that doesn’t make it bad. And easy isn’t always the best way.<\/p>\n\n\n\n<p>The best way is to be open and real in our relationships. It might be hard, but it may be worth it. Ideally, one place that we ought to be the most welcome is the church. Unfortunately, all too often, this can sometimes can sometimes be one the hardest places to be open about our struggles.<\/p>\n\n\n\n<p>There is a bright side to social media. With many unable to go to church, many churches have taken to the internet and are at least in part meeting online. It may not be the same as meeting in person, but the truth of God’s word may be reaching more people.<\/p>\n\n\n\n<p>It may be a good idea to take a holiday from our electronics now and then. It’s hard to find group of people together where they aren’t all looking at their phones. I think that our phones and other devices have caused us to forget what it really means to be social.<\/p>\n\n\n\n<p>Don’t be afraid to say hi to others. If you have time, you might even be able to ask someone else how she is doing. The problem is, though, that we are all too busy, and much of this business is due to the time we spend on social media<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We call it social media, but does it really help our social life? I saw a post on Facebook that said that our phones were keeping us closer to those who are far away but far from those who are close. Social media isn’t really&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/social-life-or-social-media\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":842,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[69,41,46,35,47],"tags":[3],"class_list":["post-841","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-community","category-family","category-friends","category-question","category-relational","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/841","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=841"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/841\/revisions"}],"predecessor-version":[{"id":843,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/841\/revisions\/843"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/842"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}