{"id":854,"date":"2023-05-22T16:58:01","date_gmt":"2023-05-22T16:58:01","guid":{"rendered":"https:\/\/llgt.cafe\/?p=854"},"modified":"2023-05-22T16:58:01","modified_gmt":"2023-05-22T16:58:01","slug":"saving-money-isnt-exciting","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/saving-money-isnt-exciting","title":{"rendered":"Saving Money Isn&#8217;t Exciting"},"content":{"rendered":"\n<p>Somewhere, someone is working on the latest thing that we all need. It’s faster or smaller than the one before it and it can do things that we only hoped for just a few years ago.<\/p>\n\n\n\n<p>Maybe you find it easy to save money and you enjoy doing it. I have done a little investing, and that’s kind of fun. Trying to pick the right stock and sometimes getting it right is kind of fun. But I don’t find saving all that exciting and, most of the time, I find it really hard.<\/p>\n\n\n\n<p>It’s too easy to focus on the things that I want or need now. When I was in my twenties, I wasn’t thinking about when I would be in my forties or fifties. And when I was in my twenties, I had no idea what I would need at this time of my life.<\/p>\n\n\n\n<p>Schools leave us may teach us the math needed to balance our bank accounts, but the really don’t teach us anything about our finances. For many, college is a time of getting into debt, and credit card companies are happy to give most of us credit as long as we have a pulse.<\/p>\n\n\n\n<p>Maybe what we should do is make saving money fun. Maybe we could find a way to make a game out if it, like a board game or something. Maybe we could compete with others to see who is able to save up the most money. Just a thought.<\/p>\n\n\n\n<p>Really, when it comes to our finances, we need to start with figuring out which direction that we want to take our lives. Without direction, it is hard to get anywhere.<\/p>\n\n\n\n<p>If you truly want to save, it takes a plan. Like taking a road trip, you need to know where you wan to go so that you can make a plan to get there. Remember, however, that plans can change. There may be roadblocks and detours to your financial plans, but that doesn’t mean that you have to give up.<\/p>\n\n\n\n<p>One other thing, whether we have a little or a lot, we need to trust God with our money. After all, it belongs to God, anyway. It may or may not be exciting giving a part of our money back to God and his work though the church, but God does promise a peace that passes all understanding to those who put their trust in him.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Somewhere, someone is working on the latest thing that we all need. It’s faster or smaller than the one before it and it can do things that we only hoped for just a few years ago. Maybe you find it easy to save money and&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/saving-money-isnt-exciting\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":855,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[62,38],"tags":[20,3],"class_list":["post-854","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-finances","category-money","tag-finances","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/854","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=854"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/854\/revisions"}],"predecessor-version":[{"id":856,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/854\/revisions\/856"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/855"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=854"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=854"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=854"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}