{"id":857,"date":"2023-05-23T16:38:31","date_gmt":"2023-05-23T16:38:31","guid":{"rendered":"https:\/\/llgt.cafe\/?p=857"},"modified":"2023-05-23T16:38:31","modified_gmt":"2023-05-23T16:38:31","slug":"faith-is-not-transferable","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/faith-is-not-transferable","title":{"rendered":"Faith is not transferable"},"content":{"rendered":"\n<p>One of my favorite books is “I Love the Word Impossible” by Ann Kiemel Anderson (September 22, 1945 to March 1, 2014). In it, Ann describes believing God for what others believe to be impossible.<\/p>\n\n\n\n<p>It’s hard, if not impossible to have others trust God for what we are believing him for. Whether we find ourselves in a situation where we are having to trust God, or we are trying to share our faith, I don’t think that it is possible for us to convince someone else that what we believe is right or could be true. God has to show each of us, though the Holy Spirit, what the truth is.<\/p>\n\n\n\n<p>“When Jesus came into the coasts of Caesarea Philippi, he asked his disciples, saying, Whom do men say that I the Son of man am? And they said, Some say that thou art John the Baptist: some, Elias; and others, Jeremias, or one of the prophets. He saith unto them, but whom say ye that I am? And Simon Peter answered and said, Thou art the Christ, the Son of the living God.<br>And Jesus answered and said unto him, Blessed art thou, Simon Barjona: for flesh and blood hath not revealed it unto thee, but my Father which is in heaven.” — Matthew 16:13-17 (KJV)<\/p>\n\n\n\n<p>Faith is not transferable. We cannot convince others of what God may be doing in our lives and our faith cannot save someone else: not our children or our grandchildren or anyone else. Each of us must believe on our own that Jesus died for our sins and rose from the dead and that, by his sacrifice, we are able to have eternal life.<\/p>\n\n\n\n<p>Ephesians 2:8-9 tells us, “For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast.” (KJV)<\/p>\n\n\n\n<p>When I was thinking about moving back to Arkansas, I had friends who were concerned. They were afraid that my van might break down or something else might go wrong. I was fairly certain that God would be more than able to take care of me.<\/p>\n\n\n\n<p>I did make it to Arkansas okay. Admittedly, things have not gone as planned. I quit my first job and was let go from my second. My temp agency found another but, for some reason, I haven’t been able to start, yet.<\/p>\n\n\n\n<p>Still, I am trusting that God is able to meet all of my needs. Yet, I cannot make anyone else believe this.<\/p>\n\n\n\n<p>I cannot say that I know why things have turned out as they have, and can only guess. Maybe God is building my faith. Maybe he is building someone else’s faith. I don’t know. I do know that my faith will not help anyone else. Each of us must have our own faith.<\/p>\n\n\n\n<p>“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.” — John 3:16 (KJV) What do you believe?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of my favorite books is “I Love the Word Impossible” by Ann Kiemel Anderson (September 22, 1945 to March 1, 2014). In it, Ann describes believing God for what others believe to be impossible. It’s hard, if not impossible to have others trust God&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/faith-is-not-transferable\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":858,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14],"tags":[33,8,7,5,3],"class_list":["post-857","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","tag-bible","tag-god","tag-jesus","tag-king-james-bible","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/857","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=857"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/857\/revisions"}],"predecessor-version":[{"id":859,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/857\/revisions\/859"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/858"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=857"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=857"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=857"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}