{"id":864,"date":"2023-05-25T16:32:12","date_gmt":"2023-05-25T16:32:12","guid":{"rendered":"https:\/\/llgt.cafe\/?p=864"},"modified":"2023-05-25T16:32:12","modified_gmt":"2023-05-25T16:32:12","slug":"lessons-from-25-years-in-food-service","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/lessons-from-25-years-in-food-service","title":{"rendered":"Lessons from 25 years in food service"},"content":{"rendered":"\n<p>I worked around 25 years in food service before going into assembly and then into manufacturing. Working in food service allowed me to travel to many places that I might not have been, and it has allowed me to meet people that I might have otherwise met.<\/p>\n\n\n\n<p>I think that my travels in time have taught me a more about people than anything else — and even a little about myself — yet there are some things that I have learned about cooking that may be useful.<\/p>\n\n\n\n<p>Perhaps the most important thing that I have learned is the importance of learning the basics. Whether it’s searing the perfect steak or baking a beautiful cake, there are basics to every recipe. It may be a technique for mixing or one for seasoning. These techniques give us a foundation for everything that we cook and can help determine the quality of our food.<\/p>\n\n\n\n<p>Practice, practice, practice. Because most of the things that are done when cooking seem pretty easy, doesn’t mean that we can do them well the first time. Some say that you have to do something a couple of thousand times before you are actually good at it. Others say that you have to spend so many hour doing something new before you master it. Either way, if you want to go from good to great, practice.<\/p>\n\n\n\n<p>There are a number of books and videos that will teach you the basics of cooking. I spent a year in a cooking school learning the basics of French cuisine. None of it is really all that complicated, but the more that you work at the basics, the better you will get.<\/p>\n\n\n\n<p>It is also important to have everything in place when you start cooking. In cooking school, they called it mise en place, which is a fancy French way of saying “get it together.” It begins with planning ahead, making lists and following recipes if needed.<\/p>\n\n\n\n<p>Having things together not only means preparing all of your ingredients and having them in front of you as you prepare to cook, it means being ready mentally. It means having the right tools for the job and having the right attitude.<\/p>\n\n\n\n<p>One of the key ingredients is love, so make sure to use it in everything that you make. Long before I started working in the food service industry, I enjoyed cooking. And I enjoyed serving others, which helps, because food service truly is a service industry. Without love, not only will our cooking suffer, but we will suffer, also.<\/p>\n\n\n\n<p>Clean as you go. It’s not always easy, and it certainly is easier if you have someone to do it for you. Yet, it is important to keep your work area clean. It not only looks better, but it might also help prevent food borne illnesses.<\/p>\n\n\n\n<p>Don’t be afraid to try new things. Personally, I don’t follow recipes all that much. Instead, when I cook, I like to try new things. Just know who you are cooking for. You may not want to try certain things, and you may not want to try something new in a cooking competition.<\/p>\n\n\n\n<p>This last one is less about cooking and more about the people whom you cook for. I found that, if I cook for more than one person, there is at least the possibility that at least one of them will not like something that you made. Just saying, you cannot please all the people all of the time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I worked around 25 years in food service before going into assembly and then into manufacturing. Working in food service allowed me to travel to many places that I might not have been, and it has allowed me to meet people that I might have&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/lessons-from-25-years-in-food-service\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":865,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[43,71,45],"tags":[3],"class_list":["post-864","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-food","category-personal-stories","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/864","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=864"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/864\/revisions"}],"predecessor-version":[{"id":866,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/864\/revisions\/866"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/865"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=864"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=864"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=864"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}