{"id":882,"date":"2023-05-31T15:53:04","date_gmt":"2023-05-31T15:53:04","guid":{"rendered":"https:\/\/llgt.cafe\/?p=882"},"modified":"2023-05-31T15:53:04","modified_gmt":"2023-05-31T15:53:04","slug":"working-from-home","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/working-from-home","title":{"rendered":"Working from Home"},"content":{"rendered":"\n<p>Have you ever wanted to work from home? Maybe you’re wanting to try something new. There are some jobs that work better from home — or on the road. It is not a complete list, and it doesn’t include everything that you will need to know or do to get started, but it should at least help you start thinking about stay-at-home jobs that you might be interested in.<\/p>\n\n\n\n<p><strong>Answering service<\/strong><br>If you are thinking about starting your own answering service, there you are probably going to need a land line. You might also need a computer, and you may need some way to record incoming calls. It’s also a good idea to have a website, you will need to do some research on pricing, you will need to find clients, and you may need to spend money on advertising.<\/p>\n\n\n\n<p><strong>Call center representative or customer service<\/strong><br>This will require pretty much the same equipment as an answering service, but instead of taking messages, you would be answering questions, or taking information on issues that could be passed on for further review. You will still need clients clients whom you will be working for, and you may be able to find one company that will not only hire you, but will pay for the installation of all the equipment.<\/p>\n\n\n\n<p><strong>Graphic design<\/strong><br>There are several types of design that you can do, from logos, to business cards, T-shirts and mugs. One website, fiverr.com, allows you to show off just what you are capable of doing, helps you find clients, and collects the money and pays you for your work. They do, however, take a commission, which is added to the order. It is up to you to set your own price, and you can offer multiple levels of service or features at different price points. You will need a computer and\/or a tablet for creating your artwork, and you will also need some sort of design software.<\/p>\n\n\n\n<p><strong>Product photography<\/strong><br>If you have access to a camera and some products, you may be able to do product photography. You will need to find clients, and you will need to work out the details ahead of time. You will need a place to work, but you may be able to work in your own kitchen or even in your bedroom. Depending on what you are photographing, you will need a little or a lot of space. Besides a camera, you will probably need something to put the product that you are photographing on, as well as a background, and some form of lighting. You may also want to have props. If you choose to do video, you may need things like tripods or sliders. A computer and photo editing software will also be a must. And it will be important to have some place to show off your work.<\/p>\n\n\n\n<p><strong>Technical support<\/strong><br>Technical support is another job that you can do by phone. You can work for an established business, or try to start your own. Whichever you choose to do, you will need a solid knowledge of whatever it is you are attempting to help others figure out. You are likely to need a lot of patients, as the people who call in may already be frustrated because they have not been able to fix the problem themselves.<\/p>\n\n\n\n<p><strong>Vlogger<\/strong><br>If you want to produce a Vlog, such as a YouTube channel, the list of topics that you can choose from is nearly endless. You can do something as broad as cooking videos, or as narrow as the history of dental floss. It’s entirely up to you. You will need a camera that you can use to record video, and you may want more than one. It can be as simple as the camera on your cell phone, or as elaborate as you like. It’s said that sound is 50% of the video, so you will need a decent microphone. You may need a computer, but you may also be able to do all of your editing on a smartphone or a tablet. Video editing software and a way to upload your videos to the internet are also musts.<\/p>\n\n\n\n<p><strong>Website design<\/strong><br>If you already have a working knowledge of web design, this may be the one for you. The more connections you have, the faster you will be able to get started. But remember that your competition could come from half way across the world. If you can find some way that you stand out from the crowd, you may find it easier to find clients. You will need clients, and you will need to figure out your pricing. Along the same lines as web designing is Search Engine Optimization (SEO), which helps existing websites who want to achieve higher rankings on search engines like Google. A computer will come in handy, along with some way to keep in touch with clients.<\/p>\n\n\n\n<p><strong>Writer<\/strong><br>If you enjoy writing, there are several ways that you can use your skills. You can write a book, a blog, you van write for a magazine, or you may write a syndicated column for newspapers. Like vlogging, you can write on whatever topic you choose. And if you have a way of taking pictures, you can combine your writing and your photography skills to open up even more possibilities. A computer will come in handy, and you may need a connection to the Internet. A publication called “The Writer’s Market” can help you find places that you can sell your writing, and offers advice on how to get started.<\/p>\n\n\n\n<p>Whichever work that you are interested in doing from home, you are likely to need some sort of investment in money and\/or time. It takes time to get a business started. Unfortunately, it may take a lot of time — years even — and anyone who says that you can achieve overnight success isn’t telling you the whole story. One other thing you will need is the confidence that you can do it. If you don’t believe in yourself, it’s going to be hard to convince others. Always be honest with yourself and with others. As they say, you only get one chance to make a first impression, and a poor reputation can be nearly impossible to loose.<\/p>\n\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever wanted to work from home? Maybe you’re wanting to try something new. There are some jobs that work better from home — or on the road. It is not a complete list, and it doesn’t include everything that you will need to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/working-from-home\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":883,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[44,35],"tags":[3],"class_list":["post-882","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-career","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/882","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=882"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/882\/revisions"}],"predecessor-version":[{"id":884,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/882\/revisions\/884"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/883"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=882"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=882"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=882"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}