{"id":885,"date":"2023-06-01T16:34:27","date_gmt":"2023-06-01T16:34:27","guid":{"rendered":"https:\/\/llgt.cafe\/?p=885"},"modified":"2023-06-01T16:34:27","modified_gmt":"2023-06-01T16:34:27","slug":"what-comes-first","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/what-comes-first","title":{"rendered":"What comes first?"},"content":{"rendered":"\n<p>I’ve heard it more than once, emotions don’t take the lead. Okay, I’ve never heard those words exactly. The idea is that something else, like faith or action comes before emotions. And I’ll admit it, this is something that I struggle with.<\/p>\n\n\n\n<p>It is much easier, from my experience, to base our actions on how we feel. Take love for example. God’s Word, the Bible, tells us that God loves us and that God, himself, is love. Yet, I’ve found that it is all too easy to forget these words and to tell myself that God could’t love me. But it’s not true. God does love me, and he loves you, too.<\/p>\n\n\n\n<p>Everything that we do starts with something. It can be an event that stirs an emotion, a gut feeling, as when we get up to get something to eat, or just a decision. Say, for example, I decide that I’m going to finish reading the eBook that I bought yesterday as quickly as I can. But today, I don’t feel much like reading. And the subject of the book doesn’t interest me as much as it did, yesterday.<\/p>\n\n\n\n<p>I have a couple of choices. I can go ahead and continue reading the book, or I can add it to my list of things to do “tomorrow.”<\/p>\n\n\n\n<p>Another option is to set aside a particular time, or an amount of time to read this book. If I work at it at least an hour or so per day, after a while I will have read the whole book. This is true with anything that we want to do. We don’t have to spend all of our time on one project, but if we don’t send any time, we won’t get anywhere at all. And if we wait for our emotions to get us going, we may ever start.<\/p>\n\n\n\n<p>One idea is to make a list of things that I want to do and to assign tasks that I can do to help me reach my goals. So far, I’ve got a list of things that I want to do, but nothing in the order of tasks that I can do that might help me reach any of these goals.<\/p>\n\n\n\n<p>Whatever it is that I want to achieve, it also seems that my level of motivation is also an important factor in determining whether or not I will work on my goal. Right now, I have an immediate need to find work or some source of income. My desire to get out and go for long walks is pretty low right now, especially when compared to other times in my life.<\/p>\n\n\n\n<p>It’s people who don’t let their feeling get in the way of their goal that do things like invent the first light-bulb or the first combustion engine. Some of the richest people in the world were tuned down many, many times. It isn’t the writer who quits trying after 500 rejection letters but the one who continues to try, no mater what. Sam Walton couldn’t find anyone who was interested in his idea, so he went out on his own.<\/p>\n\n\n\n<p>Yes, we can let our emotions take the lead, but we aren’t likely to go as far by doing so. The good news is that we can change. We don’t have to change all at once. We can take baby steps. The important thing is that we start now, and don’t w<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve heard it more than once, emotions don’t take the lead. Okay, I’ve never heard those words exactly. The idea is that something else, like faith or action comes before emotions. And I’ll admit it, this is something that I struggle with. It is much&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/what-comes-first\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":886,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[35],"tags":[],"class_list":["post-885","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-question"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/885","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=885"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/885\/revisions"}],"predecessor-version":[{"id":887,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/885\/revisions\/887"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/886"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=885"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=885"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=885"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}