{"id":889,"date":"2023-06-02T16:40:27","date_gmt":"2023-06-02T16:40:27","guid":{"rendered":"https:\/\/llgt.cafe\/?p=889"},"modified":"2023-06-02T16:40:27","modified_gmt":"2023-06-02T16:40:27","slug":"memory-tips","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/memory-tips","title":{"rendered":"Memory Tips"},"content":{"rendered":"\n<p>Is there something that you want to remember? Apple recently came out with a new product called Air Tags. These little disks help you find the things that you may have lost. The aren’t designed to help you remember where you put them but to help you find them when you misplace them or already forgot where you put them.<\/p>\n\n\n\n<p>But what if there’s something that you want to remember? There are a few things that you can do that might help.<\/p>\n\n\n\n<p>Take a picture. In fact, if you can, put together a photo album. Photographs are one thing that can help bring back memories. You may put together a family photo album or an album of your favorite pictures. It may seem small, but you never know when these pictures might come in handy.<\/p>\n\n\n\n<p>Make a list. I use my phone’s note taking app most of the time when I need to make a list. That is, assuming that it is a small list. Other tricks I’ve used is to make a mental note of how many things I intend to buy when I go shopping. If I can remember that I need to buy five things, it’s easier to remember that I need milk, eggs, bread, ground beef and — what’s that last thing — ice cream.<\/p>\n\n\n\n<p>Keep a journal. I have kept several journals over the years. I have a few that are hand written books, stuffed with pictures, scraps of papers and other things. After I bought my last computer, I started doing more of my journaling digitally. I just enjoy writing, though it can help to go back and read what has been written from time to time. I just find it relaxing.<\/p>\n\n\n\n<p>Make a note. I had found that, if I want to remember something, especially a lot of somethings, not cards work well. They can work great if you are still in school. What I do is put one piece of information on one side of the card and another piece of information on the other side. For example, I might put “Toast” on one side of the card and “pain grillé” on the other, if I wanted to learn the French word for toast. I used to carry as many as a hundred or so index cards and take out the ones that I knew as I learned them.<\/p>\n\n\n\n<p>Tell someone else. Some times it helps to just tell someone else what you need to remember. It’s not so much as whether or not the other person remembers as much as hearing ourselves say something can often help us remember things better.<\/p>\n\n\n\n<p>Of course, another way is to just take care of ourselves. Eating a healthy diet, getting adequate exercise and sleep can go a long way to helping us with our memory as we grow older. Keeping an active mind and imagination can also go a long way.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is there something that you want to remember? Apple recently came out with a new product called Air Tags. These little disks help you find the things that you may have lost. The aren’t designed to help you remember where you put them but to&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/memory-tips\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":890,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[45],"tags":[3],"class_list":["post-889","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-tips","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/889","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=889"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/889\/revisions"}],"predecessor-version":[{"id":891,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/889\/revisions\/891"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/890"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=889"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=889"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=889"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}