{"id":895,"date":"2023-06-04T17:35:46","date_gmt":"2023-06-04T17:35:46","guid":{"rendered":"https:\/\/llgt.cafe\/?p=895"},"modified":"2023-06-04T17:35:46","modified_gmt":"2023-06-04T17:35:46","slug":"why-and-other-questions","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/why-and-other-questions","title":{"rendered":"Why, and Other Questions"},"content":{"rendered":"\n<p>My friend’s granddaughter is in that stage where “why” has become her favorite word. She has been quietly learning all of her life, but is now able to ask questions. She’s not yet to the point of being able to ask more complex questions, and may be at a few years away from asking “why not”, but this is her way of learning. And though it may get old after a while, it is an important stage of her growth.<\/p>\n\n\n\n<p>So, why do we stop asking “why”? Do we think that, as some point, we have learned everything that we need to know.<\/p>\n\n\n\n<p>It may be that we fall into the trap of conformation bias. Any information that contradicts what we have already learned tends to be ignored or somehow lost amongst all of the other information. And it doesn’t help that social media is able to learn our habits, and is able to show us only the things that it thinks that we want to see.<\/p>\n\n\n\n<p>I’ll admit that there are several things that I have no interest in learning. Either I’ve tried in the past and found it too difficult, tried and just didn’t enjoy, or was never really introduced to them.<\/p>\n\n\n\n<p>It’s said that the brain is a magnificent thing, able to learn vast amounts of information from the time we are born till we fall in love. As in love, we begin to focus our attention, usually on one thing. We find one or more things that we excel at, and that is what we spend most of our time doing.<\/p>\n\n\n\n<p>But could we spend more time asking “why”, if not out loud, at least in our minds. And could we ask even greater questions, like “what would happen if…?”, and “would it be possible to…?”<\/p>\n\n\n\n<p>Unfortunately, many of us, when we dare to ask why, are left with the answer, “because I said so,” That may be a suitable answer some of the time but, perhaps it is used to frequently. Even many college professors resent being questioned, and new college students can be belittled into just accepting everything that they are taught as truth.<\/p>\n\n\n\n<p>Proverbs teaches us that “The fear of the Lord is the beginning of wisdom,” and that wisdom should be taught in the home. But the schools and the entertainment industry tell us that our parents don’t know anything, and that it’s up to our schools, our friends, and television or the internet to teach us everything that we need to know.<\/p>\n\n\n\n<p>I think that it’s time we start asking why, again. I don’t mean the self pity of “why me” but why are things the way the are, and how can I make thing better for myself and for others. We can ask ourselves, where have we failed, and what can we learn. There are so many questions that we ask, but it all begins with one: “Why”.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>My friend’s granddaughter is in that stage where “why” has become her favorite word. She has been quietly learning all of her life, but is now able to ask questions. She’s not yet to the point of being able to ask more complex questions, and&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/why-and-other-questions\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":896,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[15,46,51,71,35],"tags":[3],"class_list":["post-895","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotional","category-friends","category-personal-growth","category-personal-stories","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/895","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=895"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/895\/revisions"}],"predecessor-version":[{"id":897,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/895\/revisions\/897"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/896"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=895"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=895"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=895"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}