{"id":898,"date":"2023-06-05T16:30:29","date_gmt":"2023-06-05T16:30:29","guid":{"rendered":"https:\/\/llgt.cafe\/?p=898"},"modified":"2023-06-05T16:30:29","modified_gmt":"2023-06-05T16:30:29","slug":"creativity-takes-time","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/creativity-takes-time","title":{"rendered":"Creativity Takes Time"},"content":{"rendered":"\n<p>Is there something that you wanted to learn but just haven’t been able to do? For a time, I wanted to learn how to knit. Or was it crochet? I get the two mixed up. I tried for a while, but couldn’t get past the first row.<\/p>\n\n\n\n<p>Some times, what we need is a little more practice. It can take time to develop muscle memory, and some things may come easier than others. I hated my typing class. Someone told me, years ago, that he used typing nearly every day. Now, I’m using typing every day.<\/p>\n\n\n\n<p>Other times, we just need the right teacher to come along. I loved art class in elementary school, but I didn’t do very well until I got a teacher that knew what she was doing. Trust me, a good teacher can make all of the difference.<\/p>\n\n\n\n<p>Unfortunately, unless our job requires it, we tend to give up on the creative part of us after graduating from school. We probably all use our creative side in one way or another, though, it’s likely that we reserve it for problem solving.<\/p>\n\n\n\n<p>I’ve been taking pictures for over 40 years and it is unlikely that I will ever stop, though my picture taking does slow down at times. These days, I’m doing more writing than I am taking pictures. It wasn’t something that I planned. It just happened that way.<\/p>\n\n\n\n<p>It’s been a while since I’ve had any writing classes. I have listened to a few audio books on the subject. Mostly, I just wrote. This is mostly how I learned photography, and how I learned how to use a computer. I just did it, learning from my mistakes and going on.<\/p>\n\n\n\n<p>It helps to have a teacher, especially if you want to get really good at something. You can find teachers online or in person, in books, magazines and on video. The advantage to having a real person teaching you is that you can get feedback on your work. But you may also learn by just jumping in and doing whatever it is that you want to learn.<\/p>\n\n\n\n<p>If you want to learn photography, I know of no better way than to just go out and start taking pictures. I started out with a camera, shooting film. These days, I take most of my pictures with my phone.<\/p>\n\n\n\n<p>Study composition and look closely at the work of other photographers to see what they might be doing. Try different angles and different lighting. Different filters can also be a big help when it comes to getting better pictures.<\/p>\n\n\n\n<p>If you want to learn how to draw, get some books on the subject. Don’t worry if your first picture is a stick figure or doesn’t look as good as you might want. Don’t compare yourself with others, but compare this year’s work with last years. If you continue to practice, you will get better.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Is there something that you wanted to learn but just haven’t been able to do? For a time, I wanted to learn how to knit. Or was it crochet? I get the two mixed up. I tried for a while, but couldn’t get past the&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/creativity-takes-time\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":899,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[19,67,51,71,35],"tags":[3],"class_list":["post-898","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-education","category-habits","category-personal-growth","category-personal-stories","category-question","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/898","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=898"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/898\/revisions"}],"predecessor-version":[{"id":900,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/898\/revisions\/900"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/899"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=898"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=898"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=898"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}