{"id":913,"date":"2023-06-22T18:14:08","date_gmt":"2023-06-22T18:14:08","guid":{"rendered":"https:\/\/llgt.cafe\/?p=913"},"modified":"2023-06-22T18:14:08","modified_gmt":"2023-06-22T18:14:08","slug":"good-gifts","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/good-gifts","title":{"rendered":"Good Gifts"},"content":{"rendered":"\n<p>I’ve seen protesters complain about this country. Now, I don’t care for most country music, but I’m speaking of the U.S.A. I’ve also seen one who espouses the Second Amendment. But this is where I differ: I don’t believe that the right to freedom of speech is a right. I believe it is a gift. I believe that God gave U.S. this gift. And He won’t take it back. He will not flaunt how much it cost Him. But, as with any gift, we have the right to exchange it, with or without a receipt.<\/p>\n\n\n\n<p>For me, birthdays or holidays can be painful reminders of the past. But I do enjoy the occasional, well thought out gift. Even if it comes from the dollar store. Over the years, I’ve been gifted and have given many a gift. Some of them are listed below:<\/p>\n\n\n\n<p>Books, letters, a car, coats, clothing, shoes, more books, travel, cameras, toys, gum, candy and, of course, money.<\/p>\n\n\n\n<p>I couldn’t think of anything else. We all like these things, right? I know I do. But this isn’t a thank you letter to the senders, or an “I wish you would send more”. Nor is it a pat on the back.<\/p>\n\n\n\n<p>Now, here are some more gifts that I’ve gotten: gifts that I have gotten and that others have been give:<\/p>\n\n\n\n<p>Love, joy patients.<\/p>\n\n\n\n<p>The list could go on. All of us want these gifts, right? I don’t. Patients require hard work. Joy takes twice the work. Love takes 10x the work. But these are the very things that God uses to draw us to Himself. These, according to the Bible, are the things that build in us the character of Christ of patients within us. This is God’s desire for our lives.<\/p>\n\n\n\n<p>God can choose from either list. And He does. He gives us a little of each. Some cannot handle things from the first list, while others cannot handle things from the second list. So, God gives us gifts according to His will: according to our unique personality. He made us, so He knows us best.<\/p>\n\n\n\n<p>Money will draw one person to God — knowing that it will make him or her realize that he\/she cannot go it alone. Another may not be able to handle the gift of money well, so God doesn’t give that person that gift. The thing is that God will use every resource at hand to draw people to Him.<\/p>\n\n\n\n<p>For me, it was loneliness, depression and anxiety, along with dyslexia and other things. When I heard the Gospel, I said, “Sign me up.” My only stipulation was that I not pray aloud. I was so shy. And I knew in my heart that God would hear my prayer.<\/p>\n\n\n\n<p>Some 40 plus years later, I still have so much to learn. What it all boils down to is, I am a servant. Nothing more; nothing less. What are my gifts? One is the ability to listen. It’s free and travels well. Just be patient as you may have to repeat yourself a time or two. After that, I give up and nod. The second is a keen eye that can find the beauty in just about anyone or anything. The third gift is to overcome the past; perhaps, it is the hardest pill to take.<\/p>\n\n\n\n<p>Think about it and ask yourself, “What gifts has God given me?” If you care to share, please, comment below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I’ve seen protesters complain about this country. Now, I don’t care for most country music, but I’m speaking of the U.S.A. I’ve also seen one who espouses the Second Amendment. But this is where I differ: I don’t believe that the right to freedom of&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/good-gifts\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":914,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[25,14,29],"tags":[3],"class_list":["post-913","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-faith","category-spiritual","category-think-about-it","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/913","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=913"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/913\/revisions"}],"predecessor-version":[{"id":915,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/913\/revisions\/915"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/914"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=913"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=913"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=913"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}