{"id":931,"date":"2023-06-28T17:58:36","date_gmt":"2023-06-28T17:58:36","guid":{"rendered":"https:\/\/llgt.cafe\/?p=931"},"modified":"2023-06-28T17:58:36","modified_gmt":"2023-06-28T17:58:36","slug":"had-enough","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/had-enough","title":{"rendered":"Had enough?"},"content":{"rendered":"\n<p>How much is enough? It’s a simple question, right? Last night, I got about four hours sleep. I got to bed late and woke up early. For a few, this might be enough sleep. For me, it’s not. Fortunately, I did get a little more sleep after going to an appointment that I had, but it still doesn’t seem like enough.<\/p>\n\n\n\n<p>But there are less needed things that make it harder to know when enough is enough. For example, I got another lens for my camera last week. It wasn’t all that expensive compared to most of the lenses that Canon sells and it fills a “need” that my other lenses don’t. But it’s not a need, it’s a want.<\/p>\n\n\n\n<p>Similarly, there is a mixer on display at Sam’s Club that looks so nice. But it’s not a need or a want, at least not now. And I don’t have room for it in my kitchen. Really the list of things could go on.<\/p>\n\n\n\n<p>Conversely, there are things that I have in my life from time to time that I would rather not have: frustration, irritation and loneliness, just to name a few. These are just some of the things that I would rather not deal with.<\/p>\n\n\n\n<p>Did you know that, according to the Bible, it’s the latter things — the loneliness and frustrations — that draw us closer to or make us more like God? I know it, but it’s easy to forget, especially when we’re “suffering” these things.<\/p>\n\n\n\n<p>So, what are we to do? For the first, it’s best to have a budget. It needs to be one that we can stick with, and it should be as close to our actual needs as possible. I say this because things like groceries can be hard to predict, unless we really work hard at planning both the budget and our diet.<\/p>\n\n\n\n<p>For the other things, we can learn to deal with them. Breathing exercises — taking a long breath in through the nose, holding it for a few seconds and a long breath out the mouth can help. Just counting slowly to ten can also help.<\/p>\n\n\n\n<p>You see, most of our life depends on how we see it. If we see getting a parking ticket as a bad thing, it becomes a bad thing. But if we are able to see it as building patients, it can become a positive thing; that is, if we want to be more patient. For now, I think there might be enough time for another nap.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How much is enough? It’s a simple question, right? Last night, I got about four hours sleep. I got to bed late and woke up early. For a few, this might be enough sleep. For me, it’s not. Fortunately, I did get a little more&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/had-enough\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":932,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[26,25,62,43,67,16,53,70,14],"tags":[33,8,3],"class_list":["post-931","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-emotions","category-faith","category-finances","category-food","category-habits","category-health","category-hobbies","category-lifestyle","category-spiritual","tag-bible","tag-god","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/931","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=931"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/931\/revisions"}],"predecessor-version":[{"id":933,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/931\/revisions\/933"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/932"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=931"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=931"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=931"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}