{"id":934,"date":"2023-06-29T15:04:06","date_gmt":"2023-06-29T15:04:06","guid":{"rendered":"https:\/\/llgt.cafe\/?p=934"},"modified":"2023-06-29T15:04:06","modified_gmt":"2023-06-29T15:04:06","slug":"picture-this","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/picture-this","title":{"rendered":"Picture This"},"content":{"rendered":"\n<p>June 29 is National Camera Day. You can celebrate by buying shopping for or buying a new camera, buying a tripod or flash, or by taking pictures with whatever camera you have.<\/p>\n\n\n\n<p>The camera has changed so much from the first cameras to today’s cameras. And the pictures that have been taken not only enrich our lives, recording moments of history, but have been used to shape our world.<\/p>\n\n\n\n<p>Below are some tips for taking better pictures. Keep these some of these ideas in mind next time you take pictures.<\/p>\n\n\n\n<p><strong>Keep it Simple<\/strong><br>Don’t over complicate an image by trying to include too many subjects.<\/p>\n\n\n\n<p><strong>Fill the Frame<\/strong><br>Try to make sure that everything that is in the image belongs in the image.<\/p>\n\n\n\n<p><strong>Rule of thirds<\/strong><br>The idea of the rule of thirds is to keep the subject out of the center of your image. Imagine placing a tic-tac-toe over your image. Try to place the main subject of your image where these imaginary lines intersect. Some cameras will place these lines on your screen for you, making it easier to follow this rule. Remember, however, that thought it is called a rule, it really is just a suggestion.<\/p>\n\n\n\n<p><strong>Lead the Viewer’s Eye<\/strong><br>A good image should direct the viewer’s eye to the subject, and all of the elements of a photograph should contribute to the subject, as well as, point to that subject. Anything else may just be a distraction.<\/p>\n\n\n\n<p><strong>Balance<\/strong><br>Balance refers an equality in size and\/or weight of the elements in a photograph.<\/p>\n\n\n\n<p><strong>Other Elements<\/strong><br>There are other elements that help make a good image, but they may not be present in every photograph.<\/p>\n\n\n\n<p><strong>Lines<\/strong><br>Lines that are parallel, are “S” curved, or lead to the subject work best. A photograph may have one set of lines, or many.<\/p>\n\n\n\n<p><strong>Patterns<\/strong><br>A patterns refers to elements that repeat, or at least seem to repeat, or elements that compliment each other. A pattern may or be a pattern of lines, shapes or or colors.<\/p>\n\n\n\n<p><strong>Shapes<\/strong><br>Shapes should compliment the subject. Shapes usually refer to squares, triangles, rectangles, circles ad ovals. A square or rectangle, for example, may be used to frame the subject. Also, shapes may or may not be clearly defined, as in the visual triangle formed when three people are photographed looking at each other.<\/p>\n\n\n\n<p><strong>Texture<\/strong><br>Texture in photography usually refers to an object with a rough surface. Such a surface, with the right lighting, can provide a high level of contract.<\/p>\n\n\n\n<p><strong>Space to Move<\/strong><br>When photographing something associated with movement, this means giving the object space ahead of it. If it is a person, looking off into the distance, it means having the person look into the open space in the picture instead of at the edge of the picture.<\/p>\n\n\n\n<p><strong>Point of View<\/strong><br>Point of view refers to the angle that the picture is taken from. Often, it’s not possible to climb up on a ladder or onto the top of a building, but it may be possible to stoop down to get a lower angle.<\/p>\n\n\n\n<p><strong>Color<\/strong><br>Color can be a very important element of a photograph, and even a black and white image may have an element of color but, as with other elements, colors should compliment the subject, and not clash with or overcome the subject.<\/p>\n\n\n\n<p><strong>Timing<\/strong><br>One other aspect of photography is timing. Timing could be a matter of capturing the image at just the right moment, such as a baseball hitting a bat, or waiting for just the right light. Timing is a skill that comes with practice and, sometimes, it’s just a matter of being at the right place at the right time.<\/p>\n\n\n\n<p>Finally, photography, like other forms of art has the ability to transform our lives. It not only boost our income but it can boost our energy level as well as the “feel good” hormones in our brain. Trust me — and the several doctors\/psychologist who have proven it.<\/p>\n\n\n\n<p>Don’t be afraid to take a lot of pictures. Try different angles, and taking pictures at different times of day. Then you can go back and find out what pictures you like most. Above all, have fun.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>June 29 is National Camera Day. You can celebrate by buying shopping for or buying a new camera, buying a tripod or flash, or by taking pictures with whatever camera you have. The camera has changed so much from the first cameras to today’s cameras.&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/picture-this\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":935,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[53,24],"tags":[3],"class_list":["post-934","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-hobbies","category-holidays","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/934","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=934"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/934\/revisions"}],"predecessor-version":[{"id":936,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/934\/revisions\/936"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/935"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=934"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=934"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=934"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}