{"id":961,"date":"2023-07-04T23:57:16","date_gmt":"2023-07-04T23:57:16","guid":{"rendered":"https:\/\/llgt.cafe\/?p=961"},"modified":"2024-07-18T14:32:06","modified_gmt":"2024-07-18T14:32:06","slug":"letters-from-a-time-travel-charles-and-rebekah","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/letters-from-a-time-travel-charles-and-rebekah","title":{"rendered":"Letters From A Time Travel: Charles and Rebekah"},"content":{"rendered":"\n<p>Chapter 1 Letters<\/p>\n\n\n\n<p>Charles swept a small pile of dirt into a dustpan and carefully threw it into a waste basket in the front of the class.<\/p>\n\n\n\n<p>“Charles,” said a warm, feminine voice at the back of the class.<\/p>\n\n\n\n<p>“Charles,” repeated Rebekah, as she stood in the door, holding her briefcase. “What are you doing here? Class doesn’t start for…”<\/p>\n\n\n\n<p>There was a pause. “I—I wanted to make the room look nice for you, Mrs. Rebekah.”<\/p>\n\n\n\n<p>“Thank you, Charles,” said Rebekah, walking into the classroom. “And I tracked mud in from outside,” she added, looking back at where she had walked.<\/p>\n\n\n\n<p>“That’s okay,” said Charles.<\/p>\n\n\n\n<p>“You can have a seat, Charles, if you like,” added Rebekah, “and wait for class to start. I have to get my notes in order and write on the chalk board.”<\/p>\n\n\n\n<p>“Is there anything I can do for you, Mrs. Rebekah,” asked Charles?<\/p>\n\n\n\n<p>“No, thank you, Charles.” There was another pause and, “Unless you want to clean up the mud I…. Never mind. Thank you Jack.”<\/p>\n\n\n\n<p>“As a last gentle breeze, as the sun’s waning fire<\/p>\n\n\n\n<p>“Enliven the end of the day,<\/p>\n\n\n\n<p>“Awaiting the gallows, again, I try my lyer&#8221;<\/p>\n\n\n\n<p>In Rebekah’s mind, she stroked Jack’s straight blonde hair with her fingers and looked deeply into his piercing blue eyes as he spoke these words. But then, when she came to, other students were entering the classroom and Rebekah had to get read ready to teach.<\/p>\n\n\n\n<p>Rebekah knew very little about Jack, except that he sat in on her World Literature 101 class and that he worked for the university as a janitor.<br>Or, so it seemed, since he kept cleaning the class for Rebekah. Jack wrote, but never turned in any of his work. After class, Jack would disappear until the next class.<\/p>\n\n\n\n<p>One Monday morning, Rebekah found a Bible sitting on her classroom desk. She hadn’t seen it before, but it was old and dust covered as if it had been there for some time. There was an old envelope protruding from the Bible and opening the Bible to the Psalms, Rebekah picked up the envelope, opened it and began reading.<\/p>\n\n\n\n<p>Dear Rebekah,<\/p>\n\n\n\n<p>I hope that this letter finds you well. I’m not sure how I got here, or how I might get back. I can say that year is 1792 and that Paris is lovely this time of year.<\/p>\n\n\n\n<p>Le Procope is a lovely cafe if you are able to visit. Remember to pack warm clothes as it is cold this time of year. Also, make sure to celebrate the New Year for me.<\/p>\n\n\n\n<p>Words cannot express how much you meant to me, Rebekah. I love you so much, and I look forward to being with you once more.<\/p>\n\n\n\n<p>Love Always,<br>Charles<\/p>\n\n\n\n<p>PS: You will first need to go to The Library in town. Look for a small box buried east of the old oak tree. You will know what to do when you find the box. And bring a pitch fork to help you find the box, along with a shovel.<\/p>\n\n\n\n<p>“Is this a joke,” Rebekah said out loud.? But Charles wasn’t there.<\/p>\n\n\n\n<p>Rebekah moved the Bible, noting the dust on her hand and the hand prints now on the Bible. Looking up, Rebekah realized that half of her students were already seated, and she had not yet begun to get ready.<\/p>\n\n\n\n<p>When the bell rang, Rebekah addressed her students.<\/p>\n\n\n\n<p>“Who read the first three chapters of ‘Homer,’” asked Professor Abrams?<br>Most hands went up, while some students just stared. “Good,” added Sarah. I want to start with another question. Say, for example, you find<br>a letter. It’s dated December 5, 1792 and it tells you where to find a box that has been buried. What do you do?”<\/p>\n\n\n\n<p>“What’s in it,” asked one?<\/p>\n\n\n\n<p>“Who tried it,” asked another?<\/p>\n\n\n\n<p>The vast number of students, however, indicated that they would dig up the box, while a few students expressed concern that it might be contaminated with “horrible germs.” Never mind them.<\/p>\n\n\n\n<p>Just after dinner, Rebekah tuned off her television, turned out the lights, locked the door and gently placed a shovel and pitch fork into the back of her pickup.<\/p>\n\n\n\n<p>“I’m off,” said Rebekah to herself. “In more than one way.”<\/p>\n\n\n\n<p>Pulling into the parking lot at The Library — where they came up with that name, Rebekah would never know. Climbing out of the truck, Rebekah grabbed her gear and began looking. It didn’t take long, to her amazement, to find the box, but it took longer than she wanted to dig it up. And she hid more than once as another vehicle passes by.<\/p>\n\n\n\n<p>The box was made of pine. It was old and covered in dirt. The front latch and hinges showed signs of wear, but seemed in good condition. Inside the box were 13 gold coins —baker’s dozen — and a note. The note read:<\/p>\n\n\n\n<p>Dear Rebekah,<\/p>\n\n\n\n<p>Thank you for taking a chance and looking for the box. You will need to take it and go because the police will arrive in less than 10 minutes.<\/p>\n\n\n\n<p>Go to the jeweler in town — not, I repeat, not to the pawn shop. There you will get a fair price. Trade in the coins and open a checking account. You should get at least $20,000. Use it wisely. Then get a plane ticket and go to Le Procope. Order a Big Mac. They will know what to do.<\/p>\n\n\n\n<p>Love Always,<br>Charles<\/p>\n\n\n\n<p>Rebekah tossed and turned, but finally fell asleep just after midnight. Finally, after waking up several times, Rebekah drove to the university to let her colleges and students know that she would be out of town for “a few days”. Then she drove to town to sell twelve of the coins and after getting $19,875, went on to open a checking account, complete with debit card. “Next stop,” she told herself, “Paris.”<\/p>\n\n\n\n<p>It’s never as easy as you would hope to travel internationally. There’s not only the ticket, but L’hôtel and, oh yes, a passport. Fortunately, Rebekah was able to book a late flight for less than $700 and be on her way. During that time, Rebekah was able to finish the semester with her students before leaving — just after Christmas. She brought one gold coin and the Bible that she had found in her classroom, along with enough clean clothes for a week.<\/p>\n\n\n\n<p>Chapter 2 When in Paris<\/p>\n\n\n\n<p>If you ever have the chance to visit Paris, do. But never sing the words to the song that go: “Voulez-vous voucher avec moi?,” unless you want others to laugh at you.<\/p>\n\n\n\n<p>Lesson Learned. It took about 45 minutes to get from the airport to the hotel, and another 15 minutes to check in and for Rebekah to make it to her room on the second floor.<\/p>\n\n\n\n<p>A few hours later, Rebekah woke up. It was time for dinner, so she got up, spruced up a little and headed to Le Procope.<\/p>\n\n\n\n<p>“What do you mean you want a Big Mac,” demanded the waiter.<\/p>\n\n\n\n<p>Rebekah was certain that the whole thing had been a big mistake when the waiter arrived with yet another letter and a bowl of soup.<\/p>\n\n\n\n<p>“I think you’ll like this soup,” said the waiter. “It’s a house special.”<\/p>\n\n\n\n<p>Rebekah tasted the soup — French onion — opened the letter and began reading.<\/p>\n\n\n\n<p>Dear Rebekah,<\/p>\n\n\n\n<p>I don’t know how to explain this, but I hope you will trust me. And day, after class, I found a small package on my front steps. It was from my father. I never knew my father. He disappeared when I was just two.<\/p>\n\n\n\n<p>Inside was a time piece — a pocket watch — and 26 pieces of gold. I opened it up and nothing happened. But I found another latch and, when I opened it up, I was suddenly taken to 1792, where I’ve been for the past month. These letters are the only way I knew how to reach you. If you can figure out where I am, you can bring me home. If not, I will be stuck here till I die.<\/p>\n\n\n\n<p>I know you will do what is right. Know that I love you very much.<\/p>\n\n\n\n<p>Love Always,<br>Charles<\/p>\n\n\n\n<p>PS: Go to the library and find “Homer’s Iliad”. I’ve arranged for a man to translate for you.<\/p>\n\n\n\n<p>“Good,” said Rebekah to herself. “Bien.”<\/p>\n\n\n\n<p>Chapter 3 The Bibliothèque<\/p>\n\n\n\n<p>At the Paris library stood a 50ish year old man holding the sign, “Rebekah”.<\/p>\n\n\n\n<p>“Are you my translator,” asked Rebekah?<\/p>\n\n\n\n<p>“Oui,” said the man. “I mean, jes.” He continued, “It looks like it could snow. We should probably go inside.”<\/p>\n\n\n\n<p>The two stepped inside. “My name is Michael,” said the man. “How long will you be in town,” he asked?<\/p>\n\n\n\n<p>Rebekah followed Micheal to a table and after saying something in French, Michael was handed a book. The two went upstairs and found a quiet place where Michael could read out loud to Rebekah. As he read, he translated.<\/p>\n\n\n\n<p>Michel read to Rebekah for the next five days, reading quickly and skipping some parts — 12 hours, until he had finished the book. Rebekah took notes as Michel read.<\/p>\n\n\n\n<p>“Be strong, saith my heart; I am a soldier; I have seen worse sights than this.”<\/p>\n\n\n\n<p>“You, why are you so afraid of war and slaughter? Even if all the rest of us drop and die around you, grappling for the ships, you’d run no risk of death: you lack the heart to last it out in combat—coward!”<\/p>\n\n\n\n<p>“The proud heart feels not terror nor turns to run and it is his own courage that kills him.”<\/p>\n\n\n\n<p>“Like a girl, a baby running after her mother, begging to be picked up, and she tugs on her skirts, holding her back as she tries to hurry off—all tears, fawning up at her, till she takes her in her arms… That’s how you look, Patroclus, streaming live tears.”<\/p>\n\n\n\n<p>“But listen to me first and swear an oath to use all your eloquence and strength to look after me and protect me.”<\/p>\n\n\n\n<p>“But listen to me first and swear an oath to use all your eloquence and strength to look after me and protect me.”<\/p>\n\n\n\n<p>“Wait,” said Rebekah, “read that, again.<\/p>\n\n\n\n<p>“But listen to me first and swear an oath to use all your eloquence and strength to look after me and protect me.”<\/p>\n\n\n\n<p>“None of it makes sense,” said Rebekah, as Michael finished reading. “Is there anything else?”<\/p>\n\n\n\n<p>Michael stood and walked away, returning with a small book. “They gave me this,” said Michale. “It’s called, “The Last Lines of André Chénier.” As Michel began to translate, he read these words:<\/p>\n\n\n\n<p>“As a last gentle breeze, as the sun’s waning fire<\/p>\n\n\n\n<p>“Enliven the end of the day,<\/p>\n\n\n\n<p>“Awaiting the gallows, again, I try my lyer.”<\/p>\n\n\n\n<p>“That’s him,” exclaimed Rebekah. “I remember Charles saying those words. “That’s him. Somehow he got Chénier to write those words. I just know it.”<\/p>\n\n\n\n<p>“How much longer do you have in Paris,” asked Micheal, “before you have to go back to America?”<\/p>\n\n\n\n<p>“Tomorrow,” replied Rebekah. “I fly back home Friday.”<\/p>\n\n\n\n<p>“That’s just enough time,” said Michel. “You need to see Paris before you leave.”<\/p>\n\n\n\n<p>“The Eiffel Tower,” asked Rebekah?<\/p>\n\n\n\n<p>“No,” answered Michael. “No, you need to see the real Paris.”<\/p>\n\n\n\n<p>Chapter 4 The Real Paris<\/p>\n\n\n\n<p>The sound of the phone ringing woke Rebekah from her sleep.<\/p>\n\n\n\n<p>“I hope I didn’t wake you,” said Michael.<\/p>\n\n\n\n<p>“No,” said Rebekah, sounding a little groggy.<\/p>\n\n\n\n<p>“Good,” said Michael. “Are you ready?”<\/p>\n\n\n\n<p>“Ready to see Paris.”<\/p>\n\n\n\n<p>“I need about an hour,” replied Rebekah.<\/p>\n\n\n\n<p>“No problem,” said Michael. “I’ll meet you in the hotel lobby.”<\/p>\n\n\n\n<p>Rebekah began getting ready and, after a shower, put on her makeup and a red dress that went down to her ankles. It took just over an hour to get ready, but Rebekah felt that the time was well worth it.<\/p>\n\n\n\n<p>“Sorry I’m late,” said Rebekah, as she met Michael in the lobby.<\/p>\n\n\n\n<p>“No problem,” replied Michael. “I hope you don’t mind me bringing my children.”<\/p>\n\n\n\n<p>“Children?”<\/p>\n\n\n\n<p>“My girls,” said Michael. “Sarah is seven and Maddie is five. They’re both very sweet and won’t get in the way.”<\/p>\n\n\n\n<p>“Oh,” said Rebekah, still a little sleepy.<\/p>\n\n\n\n<p>“Their mother…,” replied Michael.<\/p>\n\n\n\n<p>“She’s at work?”<\/p>\n\n\n\n<p>“No,” answered Michael. “She…. How you say? She died.”<\/p>\n\n\n\n<p>“Oh,” said Sarah. “I’m so sorry. And I’ve been keeping you from your family.”<\/p>\n\n\n\n<p>“It’s okay. The girls stayed with their grandma-ma. They love her. Their father left after their mother died. I am their grandpa.” Michael added, “Have you had breakfast?”<\/p>\n\n\n\n<p>Sarah shook her head.<\/p>\n\n\n\n<p>“No? We will have to stop at a store.”<\/p>\n\n\n\n<p>Michael and Rebekah climbed into Michael&#8217;s 1993 BMW where Sarah and Maddie sat in the back seat. Then the two took off down the road.<\/p>\n\n\n\n<p>“First stop,” said Michael, “Carrefour Market.”<\/p>\n\n\n\n<p>It was a short drive. Michael parked on the street and the four went inside. “Be good, girls,” Michael told Sarah and Maddie.<\/p>\n\n\n\n<p>“We will pa-pa.”<\/p>\n\n\n\n<p>Carrefour Market could have been an art museum, thought Rebekah. Everything from the produce to the bottles of wine was simply gorgeous.<br>“We’ll get bacon from the deli and eggs,” said Michael. “I like English bacon. We’ll also get something for dinner.”<br>It took about fifteen minutes to get everything and another ten minutes in line to pay for it. Then there was a twenty minute ride back to Michael’s and Willow’s flat.<br>Willow was a charming woman, a few years older than Michael. Deep black hair and lovely hazel eyes, she stood just 5’, but with such amazing character.<\/p>\n\n\n\n<p>“I love your home,” said Rebekah.<br>“Thank you,” blushed Willow, in replay.<br>“Maddie and Sarah told me all about you on our drive here.”<br>“They are my life,” said Willow. “Michael, too,” she added, kissing Michael on the cheek.<br>Michael and Rebekah sat on apposing chairs in the dining room while Willow and the girls made breakfast.<br>“What is it that you are trying to do,” asked Michael.<br>“The short answer is that I am looking for a friend,” answered Rebekah.<br>He is special,” asked Michael.<br>“Quite,” replied Rebekah.<br>It took about twenty minutes for breakfast to be ready and the girls helped bring plates in to the dining room table before all sat down. Michael prayed.<br>“Heavenly Father,<br>Bless this food we are about to eat. Thank you for Rebekah, Sarah, Maddie and especially for Willow.<br>Amen”<br>“This looks amazing,” said Rebekah.<\/p>\n\n\n\n<p>“Thank you,” replied Willow.<\/p>\n\n\n\n<p>“Everything looks amazing.”<\/p>\n\n\n\n<p>“The girls will stay here with Willow while we paint the town yellow,” said Michael.”<\/p>\n\n\n\n<p>“You mean red,” asked Rebekah?<br>“No,” said Michael. “I paint the streets, and today I am using yellow.”<\/p>\n\n\n\n<p>“Oh,” said Rebekah, a little shocked.<\/p>\n\n\n\n<p>“This way,” said Michael, you will get to see what Persians are really like. And you can help me by holding the paint can.”<\/p>\n\n\n\n<p>“Good, then,” said Rebekah. “I can hardly wait.”<\/p>\n\n\n\n<p>The five finished breakfast and Michael and Willow kissed before Michael and Rebekah headed off to paint the streets of Paris.<\/p>\n\n\n\n<p>“It’s a part time job,” said Michael, after parking in one of the cities parking lots. “I’ll work just four hours, today.”<\/p>\n\n\n\n<p>It was cold out, but Michael gave Rebekah his coat.<\/p>\n\n\n\n<p>“Here you go, lovely,” he said, as he handed Rebekah the leather jacket that he had worn for some 25 years.<\/p>\n\n\n\n<p>“Thank you, Michael,” said Rebekah, picking up and holding the can of paint, making sure to not get any paint on Michael’s jacket.<\/p>\n\n\n\n<p>The work took just over four hours, with a fifteen minute break in the middle.<\/p>\n\n\n\n<p>“What time is your flight,” asked Micheal, as the two sat on the curb?<\/p>\n\n\n\n<p>“Eight AM,” said Rebekah.<\/p>\n\n\n\n<p>“I will take you to the airport. The girls will probably want to go along for the ride.”<\/p>\n\n\n\n<p>“I would love to see them, again,” said Rebekah.<\/p>\n\n\n\n<p>“You will,” replied Micheal. “You’ll see them this evening.”<\/p>\n\n\n\n<p>At a little past noon, Michael and Rebekah climbed into Michael’s car and took off, stopping in near a cosy little cafe for cucumber sandwiches and tea.<\/p>\n\n\n\n<p>“I learned my English while studying at Oxford,” explained Michael.<\/p>\n\n\n\n<p>“Did you graduate,” asked Rebekah?<\/p>\n\n\n\n<p>“Sadly, no,” said Michael.<\/p>\n\n\n\n<p>“Sorry,” said Rebekah.<\/p>\n\n\n\n<p>“Enough about me, said Michel, “tell me about yourself.”<\/p>\n\n\n\n<p>“I grew up in Chelsea, MA, and attended Boston College,” said Rebekah. “I got my bachelors in basket weaving,” she said, joking, and my masters in world literature.”<\/p>\n\n\n\n<p>Michael laughed. “I got my degree from the city of Paris. They handed my an apron and said ‘Congratulations, you’re a painter.’”<\/p>\n\n\n\n<p>“Sounds fun,” said Rebekah.<\/p>\n\n\n\n<p>“What did you learn,” asked Michael, “when you worked with me?”<\/p>\n\n\n\n<p>“That the French are a lot more patient than Americans.”<\/p>\n\n\n\n<p>“And?”<\/p>\n\n\n\n<p>“Painting is harder than I thought,” added Rebekah.<\/p>\n\n\n\n<p>After lunch, the two climbed back into Michael’s car and stopped at a hardware “museum” for a fresh pale of paint.<\/p>\n\n\n\n<p>Then they found a quiet park and, parking the car, found a quiet park bench and fed the pigeons.<\/p>\n\n\n\n<p>The two hardly spoke, but for an hour, they just enjoyed each other’s company. Then they climbed back into the car and headed to Michael’s flat.<\/p>\n\n\n\n<p>Rebekah spent an hour and a half playing hide and seek with Sarah and Maddie, while Willow made dinner. When it was nearly five in the evening, the lot of them ate dinner.<\/p>\n\n\n\n<p>“It seems that Rebekah is quite the painter,” said Michael.<\/p>\n\n\n\n<p>“Yes,” said Rebekah, “but I couldn’t have done it without Michael.”<\/p>\n\n\n\n<p>“So,” asked Willow,” what brings you to Paris, if you don’t mind me asking?”<\/p>\n\n\n\n<p>“I’m looking for a friend.”<\/p>\n\n\n\n<p>“Don’t you have a friend in Boston,” she asked?<\/p>\n\n\n\n<p>“I’m trying to find clues that my friend, Charles, left behind.”<\/p>\n\n\n\n<p>“Oh,” said Willow. “Sounds complicated.”<\/p>\n\n\n\n<p>“Very,” said Rebekah. “But Michael has been such a huge help.”<\/p>\n\n\n\n<p>The girls got ready for bed, bathing and getting dresses in their pajamas before grandpa-pa read to them. Maddie sat on grand’s lap while Sarah sat on Rebekah’s.<\/p>\n\n\n\n<p>“It all began one day when…,” read Michael, so the story goes. “And they all lived happily ever after.”<\/p>\n\n\n\n<p>Chapter 5 No “The End”<\/p>\n\n\n\n<p>Michael and the girls arrived and picked up Rebekah from her hotel, driving her to the airport.<\/p>\n\n\n\n<p>“Will you have anyone waiting for you when you get back home,” asked Sarah.<\/p>\n\n\n\n<p>“No, sweetie,” said Sarah. “I’ll hale a taxi.”<\/p>\n\n\n\n<p>“Oh,” said Sarah.<\/p>\n\n\n\n<p>When they arrived at the airport, Rebekah hugged Michael and gave the girls each a kiss on the cheek. “Thank you for everything,” she said, waving goodbye until the BMW was out of sight.<\/p>\n\n\n\n<p>The flight home seemed longer than the flight to Paris. As much as Rebekah had enjoyed her stay in Paris, she was anxious to see Charles, again. Unfortunately, it would have to wait till the start of the spring semester.<\/p>\n\n\n\n<p>When Sarah returned to her class, instead of Charles, Rebekah found another letter.<\/p>\n\n\n\n<p>Dear Rebekah,<\/p>\n\n\n\n<p>Great job. But it seems that I’m still not back home. Instead, I’ve traveled to the year 1805.<\/p>\n\n\n\n<p>I cannot tell you anything more at this time. Just know that I love you and will write more when I can.<\/p>\n\n\n\n<p>Love Always,<br>Charles”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chapter 1 Letters Charles swept a small pile of dirt into a dustpan and carefully threw it into a waste basket in the front of the class. “Charles,” said a warm, feminine voice at the back of the class. “Charles,” repeated Rebekah, as she stood&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/letters-from-a-time-travel-charles-and-rebekah\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":962,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[73,72],"tags":[3],"class_list":["post-961","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fiction","category-letters-from-a-time-traveler","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/961","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=961"}],"version-history":[{"count":2,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/961\/revisions"}],"predecessor-version":[{"id":964,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/961\/revisions\/964"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/962"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=961"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=961"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=961"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}