{"id":998,"date":"2023-07-12T16:09:20","date_gmt":"2023-07-12T16:09:20","guid":{"rendered":"https:\/\/llgt.cafe\/?p=998"},"modified":"2023-07-12T16:09:20","modified_gmt":"2023-07-12T16:09:20","slug":"love-worth-finding","status":"publish","type":"post","link":"https:\/\/llgt.cafe\/love-worth-finding","title":{"rendered":"Love Worth Finding"},"content":{"rendered":"\n<p>You don’t realize that it’s really you doing these things until it’s too late.<\/p>\n\n\n\n<p>August 23, 2005: The Warning Signs<\/p>\n\n\n\n<p>Jack sat in his recliner watching television. Unable to afford cable, Jack preferred to watch shows that he had managed to record on an old VCR, watching them on his old 19” Sony television.<\/p>\n\n\n\n<p>In one hand, Jack held a beer. Most of the time that Jack was at home and felt alone, he had a beer in one hand. In his other hand, Jack held a Nokia. A revolver sat on Jack’s lap.<\/p>\n\n\n\n<p>“Nine-one-one”, said the voice on the other end of the phone.<\/p>\n\n\n\n<p>“Hi,” said Jack, “I’m drunk.” There was a pause. “I mean I’m Jack.”<\/p>\n\n\n\n<p>“How can I help you Jack,” asked the female voice, a woman who spoke with a thick New Orleans accent?<\/p>\n\n\n\n<p>“I have a gun,” said Jack, “and I’m not sure how to use it. I want to shoot myself, but…”<\/p>\n\n\n\n<p>“Do you want me to send someone Jack,” asked the woman?<\/p>\n\n\n\n<p>“No,” said Jack. “I’ll call my dad. Maybe he’ll know how to use a gun.”<\/p>\n\n\n\n<p>“Are you sure,” asked the 911 operator?<\/p>\n\n\n\n<p>“Yeah,” said Jack. “Have a good night.”<\/p>\n\n\n\n<p>Jack hung up the phone. He set the phone down and picked up the revolver. His wife would be home soon. Jack looked at the gun and then put it on the table between the remote and his phone.<\/p>\n\n\n\n<p>At least Jack could look forward to talking to his wife, Sandy, who actually had a job. Sandy was a resident nurse at the Tulane Medical Center. But even a nurse couldn’t help Jack with what ailed him. And though the conversation would likely turn into an argument — over Jack’s lack of ambition, finances, Jack’s obsession with the TV, or the pile of dirty dishes in the kitchen sink — at least it was a conversation. Jack just hoped that Sandy never found anyone else who treated her better.<\/p>\n\n\n\n<p>August 24, 2005 : Just Watching<\/p>\n\n\n\n<p>There was no argument the night before. Jack had simply fallen asleep before Sandy made it home. He didn’t hear her come in, turn off the television or sigh before going to bed. And Jack wasn’t wasn’t aware of the fact that Sandy had covered him with her favorite blanket before going to bed.<\/p>\n\n\n\n<p>When Jack became aware enough, he got up and looked at the clock. It was just after four in the morning and so, after getting another beer out of the fridge, Jack put in the video and turned, sitting back down, turned on the television with the remote.<\/p>\n\n\n\n<p>The video began playing right away. The video was of the last vacation that Sandy, Jack and Sarah had taken together. It was an overnight trip to Biloxi, Mississippi — and it had been Jack’s and Sandy’s annual vacation since they had gotten together nine years before. Together, Jack and Sandy were living their dream.<\/p>\n\n\n\n<p>Then came the nightmare. It was a Saturday, and Sandy was at work, leaving Jack and Sarah at home. Sarah got bored watching the New Orleans Saints, so Jack gave Sarah, their eight year old daughter, permission to cross the street to see her best friend. However, when a red Mustang jumped the curb, Sarah was no more. The driver fled the scene. Police said that she never knew what hit her, but Jack and Sarah each felt the pain as if a dump truck had hit them.<\/p>\n\n\n\n<p>Sandy drown her pain in work. If she could just keep working, she wouldn’t feel the pain so much. Right? Jack began drinking, choosing, rather, to drown his pain in the beer after which he had been named and whose processing plant was just a few miles away.<\/p>\n\n\n\n<p>Jack was unaware that Sandy had woken up. She spotted the beer and, in a moment, the two were arguing. Things got so heated that Sandy left without having even a cup of coffee. Instead, she left for work and had a quick breakfast at one of the restaurants near the hospital.<\/p>\n\n\n\n<p>After Sandy left, Jack turned off the television. He found a notebook and a pen in the kitchen and, after making a cup of coffee — black — Jack wrote this note.<\/p>\n\n\n\n<p>Dear Sandy,<br>I just need to get away for a while. I’m going to see dad near Picayune. I’ll be gone at least a week. Perhaps, after a little time away, we’ll be able to work things out.<br>Jack<\/p>\n\n\n\n<p>Jack signed the letter without the word “Love”. Jack still loved Sandy very much. He just couldn’t express how he felt and he felt that, if he had done things differently, Sarah would still be around.<\/p>\n\n\n\n<p>It took jack about half an hour to pack a medium sized suitcase, along with a few beers and put it in his 1992 Dodge truck. It took Jack just over an hour to get to his dad’s house near Hide-A-Way Lake. It was a nice little community and Jack’s dad had retired from construction, though he had continued to work, building homes for missionaries returning home. The nice home and the nice car, however, were just reminders to Jack of how poorly he was doing.<\/p>\n\n\n\n<p>Jack’s dad was going yard work in the front yard when Jack pulled into the driveway.<\/p>\n\n\n\n<p>“Hi, dad,” said Jack.<\/p>\n\n\n\n<p>“Good to see you, Jack,” said Michael. “What brings you here this time,” Michael continued, “and where is..”<\/p>\n\n\n\n<p>Jack interrupted, “I just needed to get away for a while — maybe a week or more. I just need time to think — and maybe talk a little.<\/p>\n\n\n\n<p>“Okay, Jack,” said his dad, “you know you’re always welcome. You can sleep on the couch.”<\/p>\n\n\n\n<p>Mom had died of cancer three years earlier, so it was just dad in the single bedroom home and, though the outside looked well kept, there were dirty dishes piled up in his kitchen sink, too. Jack found a rake leaned up against the house and began helping his dad with the yard work. Then the two went inside and, taking their place on the couch and in a recliner, the two began talking.<\/p>\n\n\n\n<p>“Do you remember when mom put the electric kettle on the hot stove,” asked Jack?<\/p>\n\n\n\n<p>“I sure do,” said his dad. “It stunk up the kitchen for days.” There was a pause. “I sure do miss your mom.”<\/p>\n\n\n\n<p>“Yeah,” said Jack, “me too.”<\/p>\n\n\n\n<p>Jack’s dad turned on the television and flipped though what seemed like a hundred channels. There wasn’t much on, but they did find news of a storm somewhere out there that might turn into a hurricane.<\/p>\n\n\n\n<p>August 25, 2005: A Chosen Path<\/p>\n\n\n\n<p>Hurricane Katrina took paid a visit to the south tip of Florida before becoming a tropical storm and heading southwest into the gulf. But Jack had no idea what lay ahead as he and his dad began an eight hole round of golf. Jack had always hated golf, but it seemed to be the only way that he could spend any time with his dad.<\/p>\n\n\n\n<p>“What do you do when you miss mom,” Jack asked his dad, after what seemed like an eternity of silence.<\/p>\n\n\n\n<p>“I pray,” said Michel. “She’s in God’s care, now. And though I miss her dearly, I wouldn’t want to take her away from her real home, not to the pain that she felt while she was here. Especially when…”<\/p>\n\n\n\n<p>Michael didn’t have to finish the sentence. Jack knew what he was talking about.<\/p>\n\n\n\n<p>“You’re welcome to come to church with me, tomorrow, if you like,” Jack. “They’d love to see ya there.”<\/p>\n\n\n\n<p>“Yeah,” said Jack, softly.<\/p>\n\n\n\n<p>“What’s that,” asked his dad. “I’m a little hard of hearing these days.”<\/p>\n\n\n\n<p>“I’ll go,” said Jack, louder this time. “I’ll go,” implying that he probably wouldn’t enjoy it.<\/p>\n\n\n\n<p>The two had lunch at the club before heading home — to Jack’s dad’s home, where Jack drank beer as he watched television. His dad passed time by building small end tables in the garage.<\/p>\n\n\n\n<p>“Those are beautiful,” Jack had told his dad at one point. But Jack was asleep when his dad finally came in from the garage.<\/p>\n\n\n\n<p>August 26, 2005: In the Middle of Nowhere<\/p>\n\n\n\n<p>It was still dark-fifteen when Jack woke up and looked at the digital clock by his “bed.” It took about five minutes for Jack to find his dad’s keys and unlock his gun cabinet before throwing a shotgun into his trunk before taking off to go duck hunting. It was nearly an hours drive to a secluded piece of land where Jack could just get away and try to get something for dinner — for a weeks worth of dinners — for him and his dad. But Jack wound up with nothing, except for more than a few chiggers,<\/p>\n\n\n\n<p>Jack finally packed up when his sunburn became noticeable. Then he drove back to his dad’s house. It had just turned past 3 PM according to WWL radio and King Edward when Jack rolled into his dad’s driveway, again. Jack’s dad was watering the flowers in the front yard.<\/p>\n\n\n\n<p>“Sorry I missed church” came at the same time as “Sorry you missed church.” There was a pause and then Jack’s dad added, “You can go with me tonight, if you like.”<\/p>\n\n\n\n<p>“Sure, dad,” said Jack. “Wouldn’t miss it for the world.”<\/p>\n\n\n\n<p>“Good,” said Michael. “We’ll leave at 17:30 sharp —or 5:30, if you prefer.”<\/p>\n\n\n\n<p>“Sure, dad,” replied Jack, “5:30 sharp.”<\/p>\n\n\n\n<p>Jack wasn’t used to being a passenger. He was used to driving.<\/p>\n\n\n\n<p>“How is Sandy doing,” asked Jack’s dad?<\/p>\n\n\n\n<p>“We don’t talk much these days,” said Jack. “I know she hurts,” Jack added. “I just don’t know what to say.”<\/p>\n\n\n\n<p>“Tell her you love her,” said Michael. “You do love her don’t you?”<\/p>\n\n\n\n<p>“You know I do,” answered Jack. “I just feel so….” Jack paused. “It’s hard to explain.”<\/p>\n\n\n\n<p>“Try,” said Jack’s dad.<\/p>\n\n\n\n<p>“It hurts,” said Jack. “It hurts so bad I can hardly stand it.”<\/p>\n\n\n\n<p>“Tell her,” said Michael. “And tell her that you love her. She’s hurting, too. After all, Sarah was her baby, too.”<\/p>\n\n\n\n<p>“Okay, dad,” said Jack, as the two turned the last corner to the church and pulled into the church parking lot.”<\/p>\n\n\n\n<p>“Hi brother,” said Daniel.<\/p>\n\n\n\n<p>“Hi brother,” said Michael.<\/p>\n\n\n\n<p>“Hi Jack,” said Daniel. “Welcome.”<\/p>\n\n\n\n<p>“Thanks,” said Jack, not sure what to think. Jack hadn’t been to church since he was eight, but nothing had changed. It was still the same small brick and mortar building that seated less than a hundred. But it had a homy feeling that Jack could’t shake.<\/p>\n\n\n\n<p>There were only a hand full of people in attendance at the evening service and, after a few minutes of condolences and “good to see ya’s,” Jack and his dad took their seats third row from the back. Jack took an end seat, in case he needed to leave or use the bathroom.<\/p>\n\n\n\n<p>“Turn in your Bibles to Psalm 22,” said Pastor Edmonds, after precisely three hymns.<\/p>\n\n\n\n<p>Over the next hour, Jack listen intently as the pastor walked the small group thought Jesus’ crucifixion. He spoke of the pain that Jesus felt as he was beaten and hung on the cross to pay our sin debt. He shard the pain that Jesus felt when his Heavenly Father turned away — forced to look away from our sins that “Jesus bore for us.”<\/p>\n\n\n\n<p>Pastor finished with these words from the book of John: “For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”<\/p>\n\n\n\n<p>Jack was so overcome by emotion that he didn’t wait to hear pastor call for an alter call before going up front. Michael followed and, after a few minutes conversation, Michale listened to Jack as he began to pray, “God, I need you. Help me….” Jack finished his prayer with a hearty “Amen.” And he and his dad both had to wipe the tears away. Half and hour of conversation and several hugs later, Jack and his dad were on their way home, listening to a Michael Card tape that Jack’s dad had picked up at a pawn shop for $1. There was dinner, no beer, a movie on dad’s TV, and the best night of sleep that Jack had had in years.<\/p>\n\n\n\n<p>August 27, 2005: Just Watching<\/p>\n\n\n\n<p>Jack and his dad had breakfast in town before going to the hardware store to pick up some things. This, too, Jack hated, but he loved the time with his dad.<\/p>\n\n\n\n<p>“Now that you’re born again,” said Jack’s dad, “we need to get you dunked.”<\/p>\n\n\n\n<p>“Baptized, you mean,” asked Jack?<\/p>\n\n\n\n<p>“Yea,” said Michael. “We need to get you wet.”<\/p>\n\n\n\n<p>“Okay,” said Jack. “How about next Sunday?”<\/p>\n\n\n\n<p>“Sounds good,” said Michael.<\/p>\n\n\n\n<p>It took two minutes for Jack and his dad to find the screws that Jack’s dad was looking for and what seemed like forever for him to pick out the just the right ones.<\/p>\n\n\n\n<p>“You can’t rush these things,” said Jack’s dad, before finally picking out a pack of 2.5 inch Philips had screws and moving on to the next item on the list: a new hammer.<\/p>\n\n\n\n<p>Jack listened at least somewhat patiently as his dad and the store owner, aka, brother Daniel, talked for a good forty five minutes or more.<\/p>\n\n\n\n<p>“No,” insisted Jack’s dad, “it was only half an hour.”<\/p>\n\n\n\n<p>Michael drove to Churches and the two ordered lunch before heading to the park: Michale with his white meat and Jack with his dark. Each had mashed potatoes, a biscuit and an extra large soda. Jack continued watching a mother and her little girl play in the park as his dad made a trip to “take care of some personal business.”<\/p>\n\n\n\n<p>“It still hurts,” said Jack, as he watched the woman push her daughter on the swing.<\/p>\n\n\n\n<p>“The pain will never go away completely,” said Michel, “but over time, you’ll learn to outsmart it.”<\/p>\n\n\n\n<p>It was a little embarrassing but Jack and his dad made it all the way though the move “War of the Worlds.” It was a better option than the only other movie showing, “The Descent.” It was an early movie and the two finished the evening at Sonics before heading back to Jack’s dad’s place. Jack’s dad offered him a beer that he found in the garage, but Jack opted for a Cherry Sprite, instead.<\/p>\n\n\n\n<p>“Good choice,” said Michael.<\/p>\n\n\n\n<p>“Thanks, dad,” said Jack, “for everything.”<\/p>\n\n\n\n<p>“No problem,” said Michel. “You know that I love you, right son?”<\/p>\n\n\n\n<p>“Yes, dad,” said Jack, “I do now.”<\/p>\n\n\n\n<p>“Good night, Jack,” said Michael, finally. “Have a good night. See you in the morning.”<\/p>\n\n\n\n<p>“Good night, dad,” replied Jack. “I love you, too.” But apparently Jack’s dad was in a hurry to get to the bathroom.<\/p>\n\n\n\n<p>August 28, 2005: Where now?<\/p>\n\n\n\n<p>Jack woke up but lay in bed. It was still dark out. There wasn’t enough light to read the wall clock, something was blocking the digital clock next to the television and Jack didn’t feel like looking at his phone to find out what time it was.<\/p>\n\n\n\n<p>Deep inside, Jack felt that something had changed. He was different. Yet, he wasn’t sure what it was.<\/p>\n\n\n\n<p>“You got the Holy Spirit in you,” said Micael, at the breakfast table. “And you’re alive in Christ.”<\/p>\n\n\n\n<p>“That’s what’s different,” asked Jack?<\/p>\n\n\n\n<p>“Yep,” said Michael. “That’s what’s different,” he continued, with a great brig grin. “We need to get you a Bible and find you a church where you can get married — I mean, go to.”<\/p>\n\n\n\n<p>“I think I’m going to go hunting, again,” said Jack, “and leave for home tomorrow.”<\/p>\n\n\n\n<p>“Katrina might be headed that way,” said Michael. “You never know with these things. I’m going to the store to pick up a few supplies. Is there anything you’d like?”<\/p>\n\n\n\n<p>“Can I borrow your Bible,” asked Jack?<\/p>\n\n\n\n<p>“Sure, son. You know where to find it,” said Michael. “I’ll get one for you in town,” Michale added as he put on his raincoat and headed out the door.<\/p>\n\n\n\n<p>Jack found his dad’s Bible in its usual spot, on the night stand by his dad’s bed. Michael always liked to start his day right: in God’s Word. Jack wasn’t sure where to start, but he remembered his dad saying something about the book of John. So, after looking in the front of the Bible, Jack turned to John chapter 1 and began reading.<\/p>\n\n\n\n<p>“In the beginning was the Word, and the Word was with God, and the Word was God. The same was in the beginning with God. All things were made by him; and without him was not any thing made that was made.”<br>It seemed that there was so much to learn about his new found faith, yet, deep within, Jack knew where he needed to begin. Indeed, Jack was’t sure who he had become, but he was fairly certain that he knew who he wasn’t.<\/p>\n\n\n\n<p>August 29, 2005: Reality Check<\/p>\n\n\n\n<p>Jack sat up on the couch — awoken from a deep sleep.<\/p>\n\n\n\n<p>“Hi, dad,” said Jack, still half asleep.<\/p>\n\n\n\n<p>“Morning, son,” said Michael, sipping from his mug. “I’ve not made breakfast yet but there’s a fresh pot of coffee in the kitchen if you want some.”<\/p>\n\n\n\n<p>Jack staggered into the kitchen, found a mug sitting on the counter and poured a steaming cup before returning to his spot on the couch.<\/p>\n\n\n\n<p>“I had a strange dream,” Jack told his dad after taking his first sip of coffee.<\/p>\n\n\n\n<p>“Yea,” inquired Michael.<\/p>\n\n\n\n<p>“I dreamed that there was an alien invasion. I needed to stay inside to keep from dying, but I needed to rescue Sandy.”<\/p>\n\n\n\n<p>“Sounds exciting,” said Michel. “My dreams are usually so boring they put me to sleep.”<\/p>\n\n\n\n<p>“Funny, dad,” said Jack.<\/p>\n\n\n\n<p>“Have you heard from Sandy,” asked Michael? “They’re evacuating much of lower Louisiana because of Katrina.”<\/p>\n\n\n\n<p>“Who’s Katrina,” asked Jack, “and what did she do?”<\/p>\n\n\n\n<p>“Hurricane Katrina,” said Michael.<\/p>\n\n\n\n<p>“Oh,” said Jack. “I guess I’ve been kind out out of it for the past few days.”<\/p>\n\n\n\n<p>“Kind of,” asked Jack’s dad? “Phone is on the wall in the kitchen if you want to use it.”<\/p>\n\n\n\n<p>“Thanks dad,” said Jack, slowly standing up.<\/p>\n\n\n\n<p>Jack walked back into the kitchen and, dialed his home phone. “Sandy must be at work already,” said Jack, calling back to his dad.<\/p>\n\n\n\n<p>“I guess she’s needed at the hospital,” said Michael, as Jack returned to the living room.<\/p>\n\n\n\n<p>“I never noticed that family photo — Sandy, Sarah and me — on the wall in the hallway before,” said Jack.<\/p>\n\n\n\n<p>“You gave it to us,” said Michael, “Just before your mom died.”<\/p>\n\n\n\n<p>“Oh,” said Jack, turning his attention back to the news.<\/p>\n\n\n\n<p>“New Orleans,” said Michel, “She’s an old lady — and she’s falling apart.”<\/p>\n\n\n\n<p>“Huh,” said Jack.<\/p>\n\n\n\n<p>“Katrina is taking her toll on the crescent city.” Michael continued, “Levees aren’t holding the water back and there’s going to be flooding.”<\/p>\n\n\n\n<p>7:45 AM, Some times you hear the splash<\/p>\n\n\n\n<p>Sandy managed to take a quick peek outside one of the hospital’s windows, though she was busy and tried to avoid being near any window with all of the debris flying around from the incredible winds that engulfed the hospital.<\/p>\n\n\n\n<p>Sandy had been along Lake Pontchartrain many tines, even when the wind was strong, causing white caps on lake waves, but nothing like this. You could hear the splash of the waves against the levees but mostly, there was the sound of the wind as it rushed by one’s ears.<\/p>\n\n\n\n<p>“How is Jack doing,” asked another nurse, Charity?<\/p>\n\n\n\n<p>“He’s gone to spend time with his dad,” said Sandy. “I worry about him. He’s not handled Sarah’s death well and I’m sure he blames himself.”<\/p>\n\n\n\n<p>“It wasn’t his fault,” said Charity.<\/p>\n\n\n\n<p>“You know that and I know that,” said Sandy, “but there’s no convincing Jack. Now, he just spends his time drinking, and it’s getting to me.”<\/p>\n\n\n\n<p>“Just hang in there, Sandy,” said Charity.<\/p>\n\n\n\n<p>There was a silence in the room for a moment until the loud speaker broke in: “Code blue, C12, code blue, C12.”<\/p>\n\n\n\n<p>9:01 AM: The truth sinks in<\/p>\n\n\n\n<p>“It’s been said that all of the water from Lake Pontchartrain couldn’t wash New Orleans and, especially the French Quarter, clean,” said Jack.<\/p>\n\n\n\n<p>“No,” said Micheal, “it just sent the dirt other places — like Houston.”<\/p>\n\n\n\n<p>Jack and Michel watched the television, uncertain of what to think, as the Chief of Police for Orleans County, drenched in tears, spoke of the damage from Katrina on WWL News. The full extent of the damage would not be known for some time, but it was clear that so many had lost homes.<\/p>\n\n\n\n<p>Jack returned to the kitchen. This time he tried calling Sandy’s cell phone. But power had gone out and there was no cell service.<\/p>\n\n\n\n<p>“I need to find Sandy,” said Jack, as he faced his dad.<\/p>\n\n\n\n<p>9:33 AM: Off to see Jim<\/p>\n\n\n\n<p>Jack had a friend several miles down a long dirt road. He had flown helicopters in Korea. Maybe he could help Jack get back to New Orleans. The only problem was that Jack hadn’t been invited and Jack didn’t know Jim’s phone number. He did know that Jim owned his own helicopter and that he couldn’t stand the thought of just sitting around doing nothing.<\/p>\n\n\n\n<p>Jack set his luggage back in the trunk of his car and, after hugging his dad, climbed back into the driver’s seat and headed down the road to see Jim.<\/p>\n\n\n\n<p>It was some drive to Jim’s house. One fill up and two pit stops later, down highways and dirt roads, Jack finally reached the edge of Jack’s property.<\/p>\n\n\n\n<p>Jack read these words at the entrance to Jim’s property. “If I don’t know you, you ain’t welcome. I will kill you with kindness,” which was the name that Jim gave his rifle. Maybe he named his bullets love, but Jack wasn’t concerned about that, now. Jack opened the gate and drove up to Jim’s house. Jim stood at the door with kindness, but set it down when he recognized Jack.<\/p>\n\n\n\n<p>“Good to see you, Jack,” said Jim. “It’s been a while.”<\/p>\n\n\n\n<p>“Too long,” said Jack.<\/p>\n\n\n\n<p>“Come on in,” said Jim. “Are you hungry?”<\/p>\n\n\n\n<p>“I am, a bit,” admitted Jack.<\/p>\n\n\n\n<p>“Clair made lunch,” said Jim. “And you know her, she has trouble cooking for just the two of us.”<\/p>\n\n\n\n<p>“Hi Jack,” said Clair, as she greeted Jack at the door with a hug and a kiss on the cheek. Now, this wasn’t just a house, it was a home.<\/p>\n\n\n\n<p>“I need a ride to New Orleans,” said Jack. “Roads are out so it’ll have to be by helicopter.<\/p>\n\n\n\n<p>“Okay,” said Jim, “but we’ll have to wait till winds die down — for our own safety.”<\/p>\n\n\n\n<p>“Breakfast is getting cold,” said Clair.<\/p>\n\n\n\n<p>“I don’t mind,” said Jack. “As long as the hearts are warm.”<\/p>\n\n\n\n<p>5:30 PM: A beautiful dinner<\/p>\n\n\n\n<p>Clair pulled a whole chicken out of the oven and set it on the kitchen’s island before putting freshly chopped parsley on the steaming bowl of mashed potatoes. It was enough to feed a small platoon, but Clair loved to cook, especially for Jim. Jack watched with amazement as Clair worked, neatly stacking her dishes by the kitchen’s double sink.<\/p>\n\n\n\n<p>“I love my kitchen,” said Clair. “I could spend the whole day in here,” she continued, “if it weren’t for Jim’s health getting worse lately.” There was an awkward pause and then “Serve yourself. You can find your plate on the table.”<\/p>\n\n\n\n<p>Famished, Jack grabbed his plate and, wanting to be polite, chose moderation.<\/p>\n\n\n\n<p>“Take all you want,” said Clair.<\/p>\n\n\n\n<p>So Jack took a little more and went to his seat. He did wait till Jim and Clair joined him before he began to eat. Jim was next to be seated at the gorgeous dining room table that had the most beautiful multi colored roses as a center piece. All bowed their heads and Jim prayed.<\/p>\n\n\n\n<p>“Father, thank you for this wonderful food that my beautiful wife prepared. Thank you for bringing Jack here safely. Bless the remainder of the evening and our travels tomorrow. Amen.”<\/p>\n\n\n\n<p>Jack wasn’t sure where to start first, so he began with the cornbread. It was amazing and had pieces of corn in it.<\/p>\n\n\n\n<p>Clair started the conversation. “Jim tells me that you were both in the Army.”<\/p>\n\n\n\n<p>“Yes,” said Jack, after swallowing. I was a cook on the flight line.<\/p>\n\n\n\n<p>“Did you two meet in the military?<\/p>\n\n\n\n<p>“No, actually,” replied Jack. “I took a job at the VA as a cook and so we met there.”<\/p>\n\n\n\n<p>“Do you have any favorite recipes,” asked Clair?<\/p>\n\n\n\n<p>“No,” answered Jack. “I don’t cook much these days. “One day, I hope to go to cooking school and open a restaurant. It’s just a dream right now.”<\/p>\n\n\n\n<p>“It’s good to have a dream,” said Jim. “The Bible says that people perish without a vision.”<\/p>\n\n\n\n<p>The conversation was going slowly, and Jim quickly finished his first plate.<\/p>\n\n\n\n<p>“You’re welcome to seconds, Jim,” said Clair.<\/p>\n\n\n\n<p>“Thank you,” said Jack, “I think I will have seconds. It’s all so delicious.”<\/p>\n\n\n\n<p>“There’s desert in the fridge, too, if you have room left,” said Clair, but Jack was already gone by the time Clair finished talking.<\/p>\n\n\n\n<p>Claire got up and went into the kitchen as Jack finished his second plate of food. She returned for a moment, carrying a small plate with freshly baked peach pie smothered in vanilla ice cream.<\/p>\n\n\n\n<p>“You don’t have to eat it,” said Clair, handing a similar plate to Jim.<\/p>\n\n\n\n<p>“Oh,” said Jack, “I wouldn’t dream of passing up on this. Thank you so much. It looks delicious.”<\/p>\n\n\n\n<p>“You’re welcome,” said Clair, before disappearing back into the kitchen.<\/p>\n\n\n\n<p>“So, Jack,” asked Jim, “what’s your plan?”<\/p>\n\n\n\n<p>“Roads are gone,” said Jack.<\/p>\n\n\n\n<p>“I’ve flown into both New Orleans’ airports,” said Jack, but I don’t know what shape they’ll be in.”<\/p>\n\n\n\n<p>“Right,” continued Jack. “Sandy’s likely at the hospital. She’s probably safe, but I don’t want to get home to find out that I was wrong.” Jack paused and then continued, “The best option is for you to take me into the French Quarter and drop me off near the hospital. There’s a Greyhound but station across the street. Maybe you can drop me off on the roof. I doubt the hospital will let you land on their roof.”<\/p>\n\n\n\n<p>“They might,” replied Jim, “but I have a good friend near City Park that has a boat. He can pick you up from, say, one of the bridges in town and take you to the hospital in no time.”<\/p>\n\n\n\n<p>“Sounds good,” said Jack. “What time do you want to leave?<\/p>\n\n\n\n<p>“I would say 06:00 hours,” said Jim, “but, sorry Jack, I wouldn’t miss Clair’s breakfast for the world. We can leave at 8 AM.<\/p>\n\n\n\n<p>“Good,” said Jack, “I look forward to breakfast, too.”<\/p>\n\n\n\n<p>Jack got up to walk into the kitchen. “Have a good night Jim. Your room is down the hall and to the left. I’d love to talk more, but this is Clair’s and my cuddle time.”<\/p>\n\n\n\n<p>“Thanks Jim,” said Jack, but Jim was already gone.<\/p>\n\n\n\n<p>August 30, 2005: They say you can never go back to what you left<\/p>\n\n\n\n<p>After breakfast, Jim preformed a quick pre-flight check while Jim took a much needed shower and changed clothes.<\/p>\n\n\n\n<p>“I phoned Al,” Jim told Jack. “He has one of those fancy satellite phones. He’ll meet you near the Twin Span and take you to Tulane Medical Center.”<\/p>\n\n\n\n<p>It was a short flight to the Twin Span and Jack could see Al waiting in his boat as the two approached in Jim’s helicopter.<\/p>\n\n\n\n<p>Jim landed and Jack climbed out of the helicopter then climbed down one of the bridge’s pillars and into Al’s boat. A quick introduction and the two were off.<\/p>\n\n\n\n<p>“I’ll get you as close as I can to the front of the hospital,” said Al, but the entrance is probably under water. You know how to swim,” asked Al?<\/p>\n\n\n\n<p>“A little,” answered Jack. “I used to swim in creaks and streams, growing up.”<\/p>\n\n\n\n<p>“Well,” said Al, “Lake Pontchartrain has come to us.”<\/p>\n\n\n\n<p>“It was just after 11 AM as Al drove his boat up to the front of the hospital. And the two had seen what Katrina had done to the Super Dome.<\/p>\n\n\n\n<p>“They have a lot to rebuild,” said Al.<\/p>\n\n\n\n<p>“Yeah,” replied Jack, “a lot.”<\/p>\n\n\n\n<p>“As I see it,” said Al, “we have a few options. We can try to get someone to open a window, or you can try to make your way though the front door.” There was a pause. “I don’t know if those windows open.”<\/p>\n\n\n\n<p>“I’ll try swimming,” said Jack.<\/p>\n\n\n\n<p>“Take deep breaths before you go into the water. It’s cold,” said Al, after sticking a finger into the water. “I don’t think there’s too much floating in the water, but be careful. If you can’t get in right away, come back. I’ll be waiting for you.” There was another pause. “I’ll give you half an hour before I head home. Remember, be careful.”<\/p>\n\n\n\n<p>Al handed Jack a flashlight. “Here,” said Al, “you’re going to need this.”<\/p>\n\n\n\n<p>The flashlight turned out to be waterproof, but after a swim of nearly two minutes, Jack emerged to find that his watch wasn’t nearly as waterproof. It had stopped working soon after Jack hit the cold water. “No evaluator,” thought Jack to himself so, after finding the stairway, Jack went up to the second floor. He was soaking wet when he got there and out of breath.<\/p>\n\n\n\n<p>“Do you know where I can find Sarah Hammer,” Jack asked a nurse.<\/p>\n\n\n\n<p>“She’s on the fifth floor,” answered the nurse. “Are you a relative?”<\/p>\n\n\n\n<p>“I’m her husband,” said Jack, proudly.<\/p>\n\n\n\n<p>“Okay, then,” said the nurse. “You’ll have to take the stairs.”<\/p>\n\n\n\n<p>“Yes,” said Jack, softly, “I know.”<\/p>\n\n\n\n<p>11:48 AM: Where’s Sandy?<\/p>\n\n\n\n<p>Jack’s watch may not have worked, but the battery powered clock on the wall of the fifth floor did.<\/p>\n\n\n\n<p>“Where can I find Sandy Hammer,” asked Jack.<\/p>\n\n\n\n<p>“She’s not available right now,” said the nurse. “Can I give her a message?”<\/p>\n\n\n\n<p>“A message,” asked Jack.<\/p>\n\n\n\n<p>“Your name,” asked the nurse?<\/p>\n\n\n\n<p>“Jack,” was the reply. “Sandy is my wife.”<\/p>\n\n\n\n<p>“Oh,” said the nurse. “I’m Charity, “Sandy has told me so much about you. But…”<\/p>\n\n\n\n<p>“But what,” asked Jack.<\/p>\n\n\n\n<p>“Sandy is in emergency surgery.” Charity continued, “she won’t be out for at least another hour.”<\/p>\n\n\n\n<p>It was nearly an hour and a half before Sandy emerged from the operating room and was able to change out of surgery garb and into her normal nursing uniform. Charity had told her that Jack was waiting for her and, by the time that the two met, again, out in the hallway, Jack was mostly dry.<\/p>\n\n\n\n<p>“Good to see you, Jack,” said Sandy.<\/p>\n\n\n\n<p>“I love you so much, Sandy,” said Jack. Sliding down to the floor, Jack got on his knee and, with tears in his eyes, said, “Sandy, will you marry me?”<\/p>\n\n\n\n<p>“I’d love to,” said Sandy, herself, holding back tears of joy. “But…”<\/p>\n\n\n\n<p>“But what,” asked Jack?<\/p>\n\n\n\n<p>“I’m needed in surgery in an hour, and…” continued Sandy. “I don’t know if I should take a quick nap or get something to eat. I’m starved.”<\/p>\n\n\n\n<p>“I can’t help you with the nap,” replied Jack, “but I’m hungry, too.”<\/p>\n\n\n\n<p>A Brief History<\/p>\n\n\n\n<p>In 1803, the United States purchased no small stretch of land from French First Republic known as the Louisiana Purchase. It stretched from New Orleans in a narrow strip of land, widening as it went north, even covering a portion of Canada. East to west, it covered much of the Central time zone as well as part of the Mountain time zone.<\/p>\n\n\n\n<p>New Orleans, LA, as with some other coastal areas, turned out to be sinking sand. It seems that some early structures in the area sank, as much as one story, until a way was discovered to build on that type of soil. The French had build levees in the New Orleans area as early as 1717. The city of New Orleans has been below sea level for some time now and must pump rain water out of the city.<\/p>\n\n\n\n<p>Now, in 1984, Sandy Hammer graduated from nursing school at Tulane University’s nursing school. Then, after graduation, she got a job at Tulane Medical Center. In early 1994, Sandy was raped by a man she thought was her friend. Sandy kept her baby and so Sarah Hammer was born.<\/p>\n\n\n\n<p>It was in 2001 that Jack and Sandy met and, after dating for a few months, Jack moved in with Sandy and her daughter. Jack had moved from Mississippi to New Orleans where he took odd jobs with the hopes of saving up enough money to one day to get his culinary degree and perhaps open his own restaurant. In 2003, Sarah was killed by a hit-and-run driver and, for Jack and Sandy, things just went down hill from there.<\/p>\n\n\n\n<p>The day that Sarah died, she was going to see her friend, Sophia, who Sarah said, “needed Jesus.”<\/p>\n\n\n\n<p>“What,” I asked Sarah.<\/p>\n\n\n\n<p>“Sophia need to know that God loves her.”<\/p>\n\n\n\n<p>“Okay, sweetie,” I said. “Be careful.”<\/p>\n\n\n\n<p>“I will,” said Sarah.<\/p>\n\n\n\n<p>Then she was gone. Now, I know that she’s with Jesus.<\/p>\n\n\n\n<p>August 31, 2005 and beyond: What now?<\/p>\n\n\n\n<p>Jack woke up from a deep sleep and sat up. All he knew now was that Sandy had given him a blanket and a pillow and he had spent the night on one of the hospital’s few couches. Jack knew that there was a lot of water but, just how much water there was, Jack wasn’t sure. He didn’t know, for example, that some estimated that as much as ninety percent of New Orleans was under water — as much as nine feet in some places.<\/p>\n\n\n\n<p>It was nearly a week — a week of hospital food and sleeping on the same couch — that Jack and Sarah were able to leave the hospital.<\/p>\n\n\n\n<p>Sarah took some time off from work and went to stay in Baton Rouge with family while Jack was able to head back to his dad’s in Mississippi where he would stay until he and Sandy could have a “proper marriage.”<\/p>\n\n\n\n<p>September 24, 2023: The phone call<\/p>\n\n\n\n<p>Jack picked up the phone at his dad’s house and dialed the phone number. In his right hand, Jack held the phone to his ear. With his left hand, Jack held his dad’s credit card.<\/p>\n\n\n\n<p>“Times-Picayne,” said the woman on the other end of the line. “How may I direct your call?”<\/p>\n\n\n\n<p>“I need to place an obituary in the paper,” said Jack.<\/p>\n\n\n\n<p>Jack’s call was answered by a man named Ken and, after a few minutes, Ken read Sarah’s obituary back to Jack.<\/p>\n\n\n\n<p>“Sarah Hammer was born September 23, 1994 in New Orleans, LA. She died September 23, 2003 from injuries caused by a hit-and-run driver who was never identified. Sarah died way too young. Jack, Sarah’s adopted dad, wants the driver to know that, whoever you are and wherever you may find yourself, he forgives you.”<\/p>\n\n\n\n<p>There was a moment of silence but Jack could tell that Ken was choking back tears, too.<\/p>\n\n\n\n<p>“That will be $72,” said Ken. “How would you like to pay?”<\/p>\n\n\n\n<p>“Do you accept Monopoly money, asked Jack?<\/p>\n\n\n\n<p>October 1, 2005: The call that changes everything<\/p>\n\n\n\n<p>Jack had been with a friend at work when a family member had phoned to say that her 29 year old son in California had “finally succeeded in killing himself.” And Jack had held his friend as the tears flowed.<\/p>\n\n\n\n<p>Jack had also heard of friends who got “the call” from the doctor’s office to let them know that the results were in and that they needed to come in as soon as possible for a followup visit.<\/p>\n\n\n\n<p>This time, it was Jack who was getting the phone call.<\/p>\n\n\n\n<p>“I know what you did,” said the voice on the other end of the line.<\/p>\n\n\n\n<p>“What,” asked Jack.<\/p>\n\n\n\n<p>“Sorry,” said the man. “It’s Al. I heard what you did, and I’m impressed.”<\/p>\n\n\n\n<p>There was a pause as Jack wondered what it was that he had done.<\/p>\n\n\n\n<p>“Your dad told me more about you. He also told me about you and Sandy. He also told me about Sarah’s obituary. I’m impressed, Jack.”<br>“Oh,” said Jack, not sure what else to say. “Okay.”<\/p>\n\n\n\n<p>“I’ve been working on some numbers,” said Al. “In the fall, you can move into an apartment in Baton Rouge, where you will start classes at the Louisiana Culinary Institute. And, Jack,” added Al, “It’s all paid for.”<\/p>\n\n\n\n<p>Jack was stunned. “I &#8211; I -I,” was about all Jack could get out. “But how?”<\/p>\n\n\n\n<p>“After graduation,” continued Al, “You can come work for me at one of my restaurants and we can work on getting you your own restaurant. How does that sound, Jack,” asked Al?<\/p>\n\n\n\n<p>“It sounds Amazing,” said Jack.<\/p>\n\n\n\n<p>“When you finish school,” said Al,”we can work on wedding plans.”<\/p>\n\n\n\n<p>January 7, 2006: Off to school<\/p>\n\n\n\n<p>Jack packed the last of his things into the back of his car and, after giving his dad one last hug, drove just over one-hundred miles to his new apartment in Baton Rouge. Within a week, Jack had a job delivering pizza for a locally owned restaurant. It fit well with Jack’s classes and allowed Jack to get to know the area better. Jack also took time to visit many of the local restaurants.<\/p>\n\n\n\n<p>Jack’s time at the school passed quickly and, when it came time, Jack contacted Al, again.<\/p>\n\n\n\n<p>“I have to do six months externship,” Jack told Al, “before I can graduate.”<\/p>\n\n\n\n<p>“Good,” said Al.<\/p>\n\n\n\n<p>“I’d like to work at the Copeland’s in Slidell,” said Jack.<\/p>\n\n\n\n<p>“Great,” said Al, “I know the owner, personally,” he said, laughing.<\/p>\n\n\n\n<p>“Yeah,” said Jack, still disbelieving all that he had been blessed with over the past year.<\/p>\n\n\n\n<p>“Have you thought about yours and Sandy’s wedding,” asked Al?<\/p>\n\n\n\n<p>“Every day since I asked Sandy to marry me,” said Jack.<\/p>\n\n\n\n<p>“Great,” said Al. “Send me an email with the details when they day approaches. And Jack,” added Al, “don’t worry. It’s covered.”<\/p>\n\n\n\n<p>The email<\/p>\n\n\n\n<p>Jack finished his externship at the end of May 2007 and sent Jack an email before driving from Slidell to Baton Rouge for his classes graduation. Before leaving, Jack sent the following email to Al.<\/p>\n\n\n\n<p>Hi Al,<br>I want to thank your all that you’ve done. Graduation is tomorrow, and I look forward to returning to Coplands where I’m moved up to being assistant manager in training. I plan to marry Sandy at my dad’s house just outside of Picayune. You’re welcome to come but there’s no need to have an expensive wedding. My dad’s pastor is conducting the wedding. Sandy and I have both invited our families and a few friends. If you don’t mind, I would like for you to be the best man.<\/p>\n\n\n\n<p>Also, if you could drop by and pick up a little girl named Sophia in New Orleans. I’ve contacted her mom and she has agreed to allow Sophia to be the flower girl. Unfortunately, he mom doesn’t have a car, or a job.<\/p>\n\n\n\n<p>Thanks, again.<\/p>\n\n\n\n<p>Sincerely,<\/p>\n\n\n\n<p>Jack<\/p>\n\n\n\n<p>More bad news<\/p>\n\n\n\n<p>Jack picked up his copy of the “Times-Picayune” and, flipping though it’s pages, saw these words: “Eleven Year Old Girl Killed in Accidental Gang Shooting.”<\/p>\n\n\n\n<p>Normally, Jack wouldn’t pay much attention to such an article, but the name of the girl caught Jack’s attention. It was Sophia, the girl that had been Sarah’s friend, the one who lived across the street, that had been killed by a bullet meant for an individual at the home next door to Sophia’s.<\/p>\n\n\n\n<p>In following days, Jack searched for and found Sophia’s obituary and, when the day arrived, attended her funeral. Jack’s hopes of having Sophia as a flower girl had been dashed and it hurt Jack deeply.<\/p>\n\n\n\n<p>At the funeral, Jack found Sophia’s mother and, as the two embraced, both Jack and Louise wept. It was hard — so hard — for both of them. And neither one could figure out why such a thing had happened. Why would a loving God have allowed Sophia to have been killed a such a young age? Why would anyone die at such a young age. Unfortunately, this world offers us no answers.<\/p>\n\n\n\n<p>The only positive was that Both Sophia and her mother had asked Jesus into their lives because of Sarah’s love for Jesus.<\/p>\n\n\n\n<p>June 3, 2006:Finally, wedding day arrives<\/p>\n\n\n\n<p>As Jack and Sandy prepared for their wedding, Jack’s dad took pictures of his son with his camera and Sandy’s mom took pictures of her daughter with her camera. Jack was dressed first and used to opportunity to look outside at where the wedding ceremony would be held. At the back, near a table draped with with white linen, was an 8”x10” photograph — a memorial — to Sophia.<\/p>\n\n\n\n<p>11:17 AM<\/p>\n\n\n\n<p>When you’re getting married at your dads home, there is no “late”. But Sandy was a little late, as it was the plan for Sandy to walk down the “isle” at 11 AM. She had to have heard the wedding music playing, but — never mind that. It was now 11:20 and the woman that Jack saw as the most beautiful the world was now standing before him.<\/p>\n\n\n\n<p>Pastor Edmonds gave a short 45 minute “talk” about the importance of marriage, as found in the Bible, before reading Jack’s and Sandy’s vows, having each of them repeat their vows before some eighteen witnesses and guests. Al was Jack’s best man. Sadly, it was the last time Jack would see Al, who died on March 23, 2008.<\/p>\n\n\n\n<p>After the vows, the two exchanged rings and then came the “You may now kiss the bride.” This is an order that no couple refuses, and Jack’s and Sandy’s kiss lasted over a minute.<\/p>\n\n\n\n<p>Next came the signing of the marriage license and the reception which, due to expected rain, was held indoors. There was wedding cake that Sandy’s mom had made — it was beautiful, and champagne that Al had brought. No, there was no cake smearing, but there was more kissing and picture taking. Then there was music and dancing — outdoors, as the rain died down and finally stopped. No one really cared about a little rain.<\/p>\n\n\n\n<p>There was little indication on Jack’s car that he and Sandy had just wed and, around 6 PM, the two said their last goodbyes and made the one hour drive to their hotel in Biloxi, Mississippi for a five day honeymoon, courtesy of Al and the couple’s families. That week, the weather was gorgeous, with the exception of afternoon showers. But Jack and Sandy were in love and even a little rain couldn’t spoil their love for one another.<\/p>\n\n\n\n<p>After the honeymoon, Jack and Sandy Daniels moved into their new home — finally back in New Orleans, Louisiana. It wasn’t huge, but it was beautiful and had the kitchen that Jack had always dreamed of.<\/p>\n\n\n\n<p>March 11, 2007: A trip to the hospital<\/p>\n\n\n\n<p>At 5 AM, Jack drove Sandy to the hospital. And at 7:23 AM, Lily Grace Daniels was born, weighing 6 pounds, 2 ounces and measuring 19 inches. There was something magical about the first time that Sandy and Jack lay eyes on their baby girl. And, in spite of first appearances, it was love at first sight.<\/p>\n\n\n\n<p>There really are happy endings. The good may not last, but neither does the bad. And you can find a silver lining in just about any cloud, somewhere. You just have to know where to look.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You don’t realize that it’s really you doing these things until it’s too late. August 23, 2005: The Warning Signs Jack sat in his recliner watching television. Unable to afford cable, Jack preferred to watch shows that he had managed to record on an old&nbsp;<a class=\"read-more\" href=\"https:\/\/llgt.cafe\/love-worth-finding\">&hellip;<\/a><\/p>\n","protected":false},"author":1,"featured_media":999,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[73],"tags":[3],"class_list":["post-998","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-fiction","tag-llgt"],"_links":{"self":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/998","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/comments?post=998"}],"version-history":[{"count":1,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/998\/revisions"}],"predecessor-version":[{"id":1000,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/posts\/998\/revisions\/1000"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media\/999"}],"wp:attachment":[{"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/media?parent=998"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/categories?post=998"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/llgt.cafe\/wp-json\/wp\/v2\/tags?post=998"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}